[
    {
        "correct": [
            {
                "sent": "“I recognize the council has made a decision, but given that it’s a stupid-ass decision, I’ve elected to ignore it.”",
                "labl": 47634,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "It’s been 7 years since the creator of gifs confirmed the correct pronunciation of the word. This just proves that nobody on the internet has forgiven him.",
                "labl": 474,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Get back here and answer for children with cancer, you motherfucker!",
                "labl": 362,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "There's a lot of disrespect in this thread, and would it be too unreasonable to have more reverence to this comments in this post?\n\nRegardless of what side of the aisle you support, this was an intelligent, resilient, and wise woman. She gave judgments that benefited both sides and fought hard so she could retire peacefully and dignity. \n\n40 years serving from the bench and she battled cancer 5 times, people. There's no reason to fight her spirit now too.\n\nNo matter which party you support you can admire her spirit to show up and deliver sound judgments. Give credit to her will to fight for liberty for all. She was not infallible; she was human. Like you she made mistakes. \n\nIt's been 10 years, she served the US well and I hope she will meet he husband again. RIP.",
                "labl": 2771,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Since there's no question, I'll offer one: why didn't she retire when Obama was president and Democrats controlled the Senate?",
                "labl": 224,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Rip",
                "labl": 9,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "You laugh but having run into these fuckers in the wild I tell you, they would kill you and everyone you love.",
                "labl": 340,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "We never travel alone. Outside of the city walls, we drive in convoys of atleast half a dozen vehicles. Some of them armoured with machine gun turrets.\n\nIf we are lucky, we get aircover.",
                "labl": 175,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "It's been hard, recently my town got attacked and even the m27s were no match for their terrible power",
                "labl": 34,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A while back, I got a job as a popcorn monkey in the local cinema, as a temporary thing while I figured out what the fuck I was doing with my life.\n\nThere was a supervisor that had worked there since the site opened (around 5 years) who was a total bitch and had had numerous complaints about her from countless staff.\n\nIn the first week, I nearly quit because of her attitude - as an example one night I was on a close, and basically cleaned the entirety of the front of house on my own. I stopped to take a drink of water and she marched up to me going \"WE DON'T PAY YOU TO STAND AROUND DRINKING YOU KNOW!\" to which I calmly responded that I was thirsty, and needed a drink of water, and if she wanted to tell me I wasn't allowed to have a glass of water then good luck, but I'm pretty sure health and safety would have something to say about that. She huffed about not having had a break all day, which I ignored cos not my fucking problem, but internally I was put out about it, because it was totally fucking pointless to be such a twat about things.\n\nAbout 2 weeks in I get promoted to Supervisor as I was clearly extremely competent by their usual standards (I could walk and fart at the same time) but she also gets promoted to Floor Manager, so she continues to work her little power trips and try and lord it over me (and everyone else)\n\n4 weeks after that, I get another promotion to Floor Manager, and at this point we're equals, so she can't boss me around anymore. So instead, she tries a different tack, which is to try and lord it over me with her superior knowledge of processes, where to find stuff etc.\n\nMy response is to go (saccharine sweet) \"Oh thanks! That's so helpful, I mean you know how things work so much better than me, because you've been here 5 years, and I've only been here 6 weeks...\"\n\nShe had a face like a smacked arse. It was delightful :)",
                "labl": 1144,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I started working for a welding company as an engineering manager. We were selling an extremely complex weldment (pressure tank that goes under the shitter) for 4.9K, out costs were 9.3K.  The owner took the bid \"to get in with this big company\". The owner legit said \"we'll make it up in volume\"... We weren't.\n\nAnyway the buyer for the larger company was a huge bitch and would regularly yell on phone calls. We sent them a letter that we would honor the last 5 tanks on the current PO at the same price (I didn't even want to do that) but after that they were going up to 10K per.\n\nShe drove down with her boss the next day and demanded an explanation and threatened to pull the business. I replied that we were losing 5K per tank and couldn't do it anymore. She demanded evidence which I already had pulled up and simply turned on the projector. I said, as you can see we cannot continue to make this part at such a huge loss and I don't think anyone can make it for the original price, so if you have to pull the business we understand. \"\n\nHer boss tripped over himself cutting her off and said they weren't pulling out and actually thanked us for honoring the current PO. I didn't have many run ins with her after that.",
                "labl": 2825,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "TL;DR a pair of angry moms threatened legal action if I fired their useless kids.\n\nI work for a trampoline park franchise. We opened a sister location that I ran for about a year and a half before moving back to take over the old location.\n\nWhen I got back, a lot needed fixing but in particular there were 2 teenage employees that had been fired/suspended on numerous occasions. They were generally lazy, rude jackasses that shouldn’t have been hired in the first place. Problem was, they both had aggressive helicopter moms that intimidated the manager into rescinding any punishments.\n\nOnce I came back, I took stock of our employees and had a long talk with the entire leadership team. I learned which employees caused which problems, who was unreliable, who had a regular habit of skipping shifts, texting on shift, etc. I fired about a half dozen that first week, including those two I mentioned. That night, both moms called my personal cell to scream at me (our numbers are listed in the online scheduling tool so employees can find shift covers more easily).  They demanded to know why I fired them, threatened to sue, have me arrested, accused me of discrimination (against their white middle-class sons), etc.\n\nI simply asked, “Is your son over 18? Yes? So you’re demanding I illegally release personal information regarding a former adult employee? Bye”",
                "labl": 180,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My parents were yelling at me and then my grandpa walks over and tells them both to sit the fuck down. They both shut the fuck up and sit their ass down on the couch. It was by far the most powerful thing I've ever seen him do lmao.",
                "labl": 14433,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I had worked for a company for 12 years.  They had cut staff about 18 months prior and assigned the senior engineer workload to me, a normal engineer, on top of my existing workload.  After about a year I began the conversation of a promotion to account for the increased work.  Months and months went by with nothing and then a 2% raise in April.  They fired my boss so I now worked for the plant manager, the highest level in the building.  After 3 meetings of being blown off and \"I'll see what we can do\" I started looking for opportunities.  I had one bite and give me an offer that I couldn't refuse (25%+ raise for the exact same position down the road).  I made one last attempt to argue my case as I really wanted a counter offer.  The plant manager would not accept a meeting and I finally found him up at the water cooler.  I told him I wanted to hash this out today (it was the 2 week mark on the dot) and he said \"I don't have time for you\".  So I let him know then and there that I would be leaving in two weeks and I was on my way to HR to turn in notice.  It was rough dragging my huge balls around the rest of the day lol.",
                "labl": 742,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Just last week we had another supervisor from a different department come and tell us what he needed(not uncommon in my job) like \"oh I need this by this date\" but we're super swamped right now and my coworker said \"oh we can probably get to that next week because we are working on another project\" and the supervisor said \"this needs to be done now\" and my coworker said \"we'll do it in 3 weeks, sorry!\" And there's really nothing the other supervisor can do.",
                "labl": 654,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I was a cashier working at the returns counter for a big box store. Customer wanted to return a drill that stoped working after he dropped it in wet concrete. I told him I couldn't take it back. He got all huffy and wanted to see the manager. The manager backed me up and refused to take it back as well. Things escalated and the customer threatened to call the CEO, \"who was a personal friend\", and get us both fired.\n\nI had recently done some volunteer work that the CEO was heavily involved in and had directly work with him on it over the past few months, so I had his personal phone number.\n\nI took out my phone and brought up the CEOs contact page on my phone. Showed it to guy and asked if he wanted me to place the call for him.\n\nHe threw the drill in the trashcan and stormed out. The look on my managers face was priceless.",
                "labl": 248,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Hey OP cherish 2015 while you can OK?",
                "labl": 34730,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "2020 election results lol",
                "labl": 2914,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Bitcoin price history.",
                "labl": 5496,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Loto numbers, Sports results, stock market stats.",
                "labl": 8606,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "If Blizzard still has Diablo 4 in development, if I'm alive, if so, then to see if I am divorced.",
                "labl": 423,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "Graphic Omnipotent Deity.\n\nNo, that's a hard G, bud.",
                "labl": 3007,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "God isn't really a name though.",
                "labl": 117,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "All politics aside. She was an extraordinary human being who did extraordinary things. RIP Justice Ginsburg.",
                "labl": 918,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Her body isnt even cold yet. \n\n[Mitch McConnell confirms court nominee will get Senate vote.](https://www.cnbc.com/2020/09/18/trump-nominee-to-replace-ruth-bader-ginsburg-on-supreme-court-will-get-senate-vote-mcconnell-says.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard&fbclid=IwAR2KZ7RffOeCRFO0wZvEelyxp4GCRK-CMqPxlwmT-3U1XpPjZXQqrp5FU0E)",
                "labl": 978,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "When I was in high school I worked at popular warehouse club selling computers on the weekends. I was hired by the store manager via referral of a friend. I loved computers and they thought I'd make a good salesman, so my job was to stay in the computer department and sell computers; nothing else.\n\nWell, one of the shift managers didn't like that, and started insisted that I needed to go fold clothes for a while. As in, half my damn shift. I told him that the store manager had instructed me never to leave the technology department, but he insisted. This went on for several weeks.\n\nThe store manager showed up one weekend when both the power trippin shift manager and I were working. The store manager walks up with the shift manager close behind. Store manager slaps a stack of [greenbar paper](https://www.google.com/search?client=safari&rls=en&ei=iiBuX4PQEoqc5gL8gJLQCg&q=greenbar+paper&oq=greenbar+paper&gs_lcp=CgZwc3ktYWIQAzICCAAyBggAEBYQHjIGCAAQFhAeMgYIABAWEB4yBggAEBYQHjIGCAAQFhAeOgQIABBHOgsILhDHARCjAhCTAjoECAAQQzoECAAQCjoECC4QCjoICAAQFhAKEB5Q5g9Y2xRg2RVoAHACeACAAWyIAe8DkgEDNC4ymAEAoAEBqgEHZ3dzLXdpesgBCMABAQ&sclient=psy-ab&ved=0ahUKEwiDvZnA4oTsAhUKjlkKHXyABKoQ4dUDCAw&uact=5) (this was a while ago) down onto a shelf and points to some highlighted numbers.\n\nHe looks at the shift manager and says, \"Do you see this? This is our average technology sales numbers for the weeks you are on shift. See this number over here? This is our average technology sales numbers for weeks you are not. At this point, it would be more cost effective for me to simply fire you. What do you think of that solution?\"\n\nThe guy stammers and stutters like a toddler caught bullying another kid on the playground. Fortunately, the dude wasn't fired, but the store manager made it clear that when I was on shift, I was not to leave the technology department unless I was on break or there was a fire in the store. That shift manager never said another word to me.",
                "labl": 20074,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "sort of a you have no power here moment... but funny none the less.\n\nMy dad and i went to lowes one time, and the guy  helping us had on a veteran hat and a few pins kept trying to insinuate we didnt know what we were talking about, and that we didnt need what we were there for, and kept trying to argue about everything.  so my dad asked what service he was in trying to break ice, and the dude said he was in team 6 1970-1974 in Vietnam, and trained in Great lakes. which was the wrong answer, So my dad asked if he meant seal team 1 or 2. the man recognizing my dads service ring immediately buffed up on my dad and got tomato faced red and tried to assert dominance as a superior.  So my dad immediately called the guy on his shit for stolen valor explained why he was full of shit and threatened to turn him in for it and get his management involved. \n\ni havent seen that guy in town in a while.",
                "labl": 4051,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I had a short stint as private investigator who specialized in providing investigative services to public deffenders.\n\nWe had this one county that was notorious for a sheriff's department that would make BS traffic stops as a pretext to search vehicles. One deputy in particular came up time and time again for this kind of thing.\n\nI was asked to interview this deputy for a defense attorney. Deputy had some of the worse report writing skills I've ever seen. Riddled with grammar and spelling errors. Quite often, deputy wouldn't even include the reason he pulls people over in his reports. \n\nSo I go to interview the guy. As part of the process, there's a senior sheriff's rep there that basically is suppose to protect deputies from people like me and keep them from saying things they shouldn't. \n\nWe sit down and I pull out his report he wrote on the stop he made on my client's defendant.  I've already marked it up, English teacher style with a red pen and start with, \"I had some trouble understanding your report.\" I proceeded to go error by error for the purpose of \"clarifying\" the report. He's getting redder and redder. I then go into trying to determine why he pulled over the defendant because it's unclear in the report. He's not able to give a definitive response.\n\nAll the while, the sherriff's rep, whom I've worked with a lot and who I have seen be very vocal protecting deputies in interviews like this in the past, is silent. Ultimately, charges against client are dropped.\n\nMonths later, I'm driving through the area on the way home from camping, not speeding or breaking any traffic laws. I get pulled over by a deputy. It's the same deputy. He recognizes me immediately, stammers and manages to say, \"Uhhhh, it's almost dusk, turn on your headlights.\" He gets back in his vehicle and takes off before I've even started my engine.",
                "labl": 158,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "I was a registration supervisor in an emergency department. Our manager was out for heart surgery so the manager of a different facility was filling in. She was a righteous cunt who needed everyone to bow to her authority. \n\nDuring a staff meeting she tried to implement a policy that the president of our hospital has specifically rejected. Nothing major, just a process change in how we checked in patients arriving by EMS. This policy worked at her facility but we weren't equipped to implement it. She knew this but thought she was going to force us to do it as a way of showing how it was \"the better way\". After she gave the instructions she said, \"any questions?\"\n\nMy staff all turned and looked at me for a moment, then one of them said, \"is this true, uh-okay?\"\n\n\"No. As you know, we've been told not to do this. Please continue arriving those patients as we have been.\"\n\nThe manager flipped out and tried to write me up for insubordination. Took it to the director who knew we weren't allowed to make this change. He shot her down and dismissed my write-up. It was super validating. It also helped me with my staff because they saw that I wouldn't let them or myself be pushed around.",
                "labl": 369,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I had a guy check my laptop, but it came back to me fixed without my consent, and he was trying to get me to pay 6x the usual rate of what he did.\n\nWe were mediated by a local government official to see if we could resolve this among ourselves. He was spewing lies about me asking him to proceed with fixing it but I saw his face turn pale as I showed everyone there the pictures of our messages indicating otherwise. I even did a little research on the laws he violated and recited it to everyone.\n\nI finished it off by saying I am willing to spend three times more than what he's asking me just to see justice come through and I heard him whimper a bit.\n\nHe ended up returning my laptop and didn't ask for anything. \n\nDefinitely had no power there. I'm still quite proud of myself.",
                "labl": 252,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "A few years ago I was helping my parents move to a new house locally. My father is fairly particular and told me he has reserved a U-Haul truck for specifically 24 hours as we are going to need to make a few trips across a large metro.\n\nI go in to pick the truck up for him, and look at the sheet stating the truck needed to be back in just over 3 hours (we were about 35 minutes late, but that would be okay with 24 hours). I tell the fellow behind the desk that this should be for 24 hours, and he says it is not in the system and it is spoken for already after we return it for another rental. I ask if there is anything we can do at which time the owner comes over to see what the issue is.\n\nI explain it to him and he proceeds to chastise me, saying we must not have ordered it correctly, if we need it so long why are we 35 minutes late, and a bunch of other down talk. By this time my father comes in to see why I have not come out, and also gets talked down to which upsets me internally. I tell the owner that we need to move at least the big things, so if we only have 3 hours we will make it work the best we can (then rent another truck elsewhere during the week) but he keeps chewing up more time arguing then says the kicker. He will look up the call recording to see who is right. I have absolute trust in my father when he says he did something, so I agree and wait.\n\nTurns out the owner was the one that took the call and he gets smug. \"I have done this for 20 some years and I don't make mistakes.\" Five minutes later, sounding defeated, he is asking us to bring it back early so we don't mess up another person's move (guilting us for his mistake that he never makes). On the call you clearly hear my father asking for the 24 hour rental with multiple confirmations from the owner throughout the call. Guy was a real jerk, never even apologized for anything. Also left a lengthy detailed review on multiple sites and emailed U-Haul corporate. It is now my most \"helpful\" review on just about every platform.",
                "labl": 171,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Worked in a military biological research lab for a while as a civilian contractor. Every time a new military officer rotated in as the department head (~2 year cycles) they'd try to boss around the civilians. We are legally allowed to ignore them. They **had** to filter requests through our civilian supervisors. HR supported us completely as it was a huge liability issue (read: lots of paperwork for them if anyone escalated an issue). Ever tell a power-tripping high-ranking US military officer \"no\"? Great stuff.",
                "labl": 371,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "My dad had just finished his 4 years in the army when a higher up saw him out and about with his bdu pants and a rock Tee on. The higher up started to yell at him about why he wasn't dressed up and my did flipped him off and said he had been out for weeks. Must be refreshing",
                "labl": 232,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Lottery numbers -> stock prices -> my name.\n\n&#x200B;\n\nYou may ask why my name but it's very simple as I then can learn if I died until then or got caught for some shit and are still in prison.\n\nEDIT: WHOA, I didn't expect anything. Many thanks for the awards and upvotes.",
                "labl": 22897,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Cat girls",
                "labl": 202,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "Free VR interactive porn or ,,... whats the other one again",
                "labl": 12133,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "The Julia Louis-Dreyfus character and her husband in Christmas Vacation. Everyday, my wife and I are slowly turning into them...",
                "labl": 152,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "School of rock. Like wtf an adult impersonating a teacher and taking kids to places where they shouldn’t be and none of their parents knew where they were",
                "labl": 348,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Not the perfect answer. But Benny from RENT. You don't just get to live in NYC for free, Mark and Roger! Pay your rent. You also told him you would. So you're delusional, and bad friends. Get a job.",
                "labl": 1258,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Yeah, dude, I saw the funny cartoon going around also. Don’t steal jokes.",
                "labl": 23,
                "true_bin": 1,
                "pred_bin": 4
            },
            {
                "sent": "Don't put off dealing with mental health issues. Developing unhealthy coping mechanisms for emotional issues will fuck you up big time down the road. If you have issues, deal with it head on, right away. It can take time, but start the work now.\n\nAlso, save for retirement. You should open a Roth IRA yesterday.",
                "labl": 14572,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "I graduated 10 years ago from high school and none of those people are in my life now. So take your time being you and grow your self esteem and talents now over wasting time trying to impress those pricks you won't even remember in a few months after graduation. \n\nEdit: It seems like there is some confusion as to my advice. I am not saying drop your friends. Those are a very important aspect of life (especially in high school). What I am saying is drop the politics and drama of your school. I know it feels like it is the whole world now, but if you let those who try to bring you down, who mock you, who try and pressure you will not be around forever. Worry about building yourself to being the best you that you can become. I still have contact with a few childhood friends to this day (just not really any I made in high school). But all those negative, drama craving, bullies, and those down beats in general will not follow you.",
                "labl": 21262,
                "true_bin": 1,
                "pred_bin": 3
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "I'll sum it up in two words\n\"fucking scary\"",
                "labl": 5,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "You’re not always going to have a strong wifi signal in your brainchip!",
                "labl": 1041,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "cowboy bebop (original motion picture soundtrack) - seatbelts",
                "labl": 764,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Morrowind",
                "labl": 406,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Albert Speer, the ‘Good Nazi’. \n\nConstructed an elaborate narrative that he didn’t know about the Holocaust, concentration camps, or slavery when he was the Minister of War Production, which was intimately involved in all three of those things.\n\nDue to him being an extremely effective liar, he wasn’t called out on his bullshit until after he died, when the historical narrative was scrutinized.",
                "labl": 2935,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The repetition makes you lose time.   Having the same job, workout regimen, schedule in general makes days blend into one another\n\n\nEdit: autocorrect.  Should have said workout instead of without. Bland to blend. Regime to regiment...to regime. My GAWD, did I spell anything correctly?!? \n\n\nEdit.  Thanks for all the replies.  I just want to point out I didn't mean life becomes boring.  I was just talking about lack of those major separators we had as children like summer vacation, new school, your first kiss, etc. Due to those major separators missing I don't recall if I did something a year ago or 3 years ago. It's a little blurry if something happened 2 weeks ago or 4 months ago.  This is because once you have a career and a home you're doing a lot of similar things most days(work, chores, cooking,  hobbies, etc).  This is why the days start to blend into one another, at least in your memory.",
                "labl": 16220,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I used the up coming video game release schedules of the years i would lose. Not even the announced releases but the ones in the future that I wouldn't even get to know about.   Pretty lame but it was enough.",
                "labl": 242,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Something is going on with Bryan Singer. He’s been accused of sexual assault multiple times in the past few decades but nothing ever came of it. Guy was hosting parties with young men (potentially underaged boys) and people like Kevin Spacey, and has been accused of molesting children. I’m not one for conspiracies but he clearly has friends in high places that went to these parties and keep giving him work and burying the allegations when they come up, or he has dirt on them. Seems like more people are finally talking about how shitty he is but I never understood why these stories didn’t get more attention.",
                "labl": 3462,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Just a casual fan of this one but that Christopher Walken knows whether Natalie Wood's death was an accident or not.",
                "labl": 9147,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Maybe not Tupac. But at least one celebrity has faked their death and is still out there.",
                "labl": 33164,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The US military is a huge lobbyist behind not adopting socialized healthcare and college because those are the two main reasons that people join the military. With socialized healthcare and college, recruit numbers would plummet, and we would no longer be the military powerhouse that we currently are.",
                "labl": 10081,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I don't think 9/11 was caused by the US government, but I wouldn't be shocked if it was allowed to happen.\n\nJFK was probably assassinated because he refused to go through with [Operation Northwoods](https://en.wikipedia.org/wiki/Operation_Northwoods).",
                "labl": 3174,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I go out to eat alone, I mean, I'm married and that's great. We go out together but now and again, I just like my own company, a good meal and a good book......no fucks given.",
                "labl": 242,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not living my life to other peoples opinions/expectations. I go around barefoot, grow veggies and finally have chickens. Life is so good not being stressed out all the time. Let go of toxic people (and get a kettle, it'll change your life!)",
                "labl": 583,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not my current partner but my ex-boyfriend sometimes talks in his sleep and the funniest story was this one time i was still up reading a book and i hadn't noticed that he was already asleep next to me. \nSuddenly he bursts out \" Will you just give me the fucking yogurt already, Shannon!?\" in a flawless british accent and scares the shit out of me.\n\nWe're both german and none of our first languages include English.\nWe didn't know a Shannon.\nHe's lactose-intolerant.",
                "labl": 959,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "No gems, just horrors. I sleepwalk once in a while but apparently when I was a toddler I used to sleepwalk, cry and say 'she's following me' or just try to leave the house by myself.\nNowadays if it happens, I wake up looking at my reflection in the mirror in the dark. When that happens it fucking creeps me out so I won't sleep the rest of the night.\n\nEdit 1: Why don't I move or cover the mirror? The first time it happened, I covered the mirror but with my morning rushes to work, I pull the cloth down to get ready, and then cover it when I reach home. I've had and still have peaceful nights of sleep (with dimmed lights on) so eventually I'd skip on covering mirror and focussed more not being afraid of the dark. When I least expect it, I then I catch myself waking up to the mirror with a gentle head bump/nod. Get spooked at the incident, rinse and repeat with a blanket cover. I generally have good nights of sleep, these sleepwalks are very rare so I'm really I'm more concerned about my fear of sleeping in the dark. I can't do it. I need a dimmed light for bedtime.\n\nEdit 2: Is it this particular mirror in my room? Yes, it's always this mirror but maybe I haven't had enough sleepovers to have another sleepwalking state elsewhere. I think it's just my subconscious self remembering how I like the mirror during the daytime to get ready, do my hair, makeup, try clothes, etc. I live in a shared flat so I can only leave it in my room. It's a cheap full length mirror and anyway, these sleep walks are so rare. Recent 'episodes' HAS made me want to leave the mirror outside my room but then again I don't want to weird out my flatmates by describing them this particular sleeping habit.",
                "labl": 6218,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "When I was in high school I worked at popular warehouse club selling computers on the weekends. I was hired by the store manager via referral of a friend. I loved computers and they thought I'd make a good salesman, so my job was to stay in the computer department and sell computers; nothing else.\n\nWell, one of the shift managers didn't like that, and started insisted that I needed to go fold clothes for a while. As in, half my damn shift. I told him that the store manager had instructed me never to leave the technology department, but he insisted. This went on for several weeks.\n\nThe store manager showed up one weekend when both the power trippin shift manager and I were working. The store manager walks up with the shift manager close behind. Store manager slaps a stack of [greenbar paper](https://www.google.com/search?client=safari&rls=en&ei=iiBuX4PQEoqc5gL8gJLQCg&q=greenbar+paper&oq=greenbar+paper&gs_lcp=CgZwc3ktYWIQAzICCAAyBggAEBYQHjIGCAAQFhAeMgYIABAWEB4yBggAEBYQHjIGCAAQFhAeOgQIABBHOgsILhDHARCjAhCTAjoECAAQQzoECAAQCjoECC4QCjoICAAQFhAKEB5Q5g9Y2xRg2RVoAHACeACAAWyIAe8DkgEDNC4ymAEAoAEBqgEHZ3dzLXdpesgBCMABAQ&sclient=psy-ab&ved=0ahUKEwiDvZnA4oTsAhUKjlkKHXyABKoQ4dUDCAw&uact=5) (this was a while ago) down onto a shelf and points to some highlighted numbers.\n\nHe looks at the shift manager and says, \"Do you see this? This is our average technology sales numbers for the weeks you are on shift. See this number over here? This is our average technology sales numbers for weeks you are not. At this point, it would be more cost effective for me to simply fire you. What do you think of that solution?\"\n\nThe guy stammers and stutters like a toddler caught bullying another kid on the playground. Fortunately, the dude wasn't fired, but the store manager made it clear that when I was on shift, I was not to leave the technology department unless I was on break or there was a fire in the store. That shift manager never said another word to me.",
                "labl": 20074,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "If you don't have a passion, learn new skills. You might find your passion or something you're good at.",
                "labl": 48247,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Interest either crushes you when you owe, or creates wealth when you lend - Save 10% of your money in an investment account and don't touch it until you're ready to retire. Do not rack up debt.\n\nOnly buy used cars. Get something reliable but something you don't mind getting dings and scratches on, has decent gas mileage, and is easily affordable and has insurance rates that are reasonable.\n\nYour friends today will not be that fucking important someday soon, so don't ever tolerate people who don't lift you up and make you feel better about yourself - cut toxic people out unapologetically.\n\nIf your parents are pleading with you about something, consider the fact that they might have been through what you're going through and their advice could actually be rock solid because they are actually thinking \"I wish I would have told myself this.\"  I try to tell this to my kids and only hope it sinks in because I didn't listen to anyone as a teen myself.\n\nBelieve in nothing, question everything.",
                "labl": 17,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Abbey Road - the Beatles",
                "labl": 2429,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Disintegration by The Cure",
                "labl": 123,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "I would be converted\n\n\nEdit: thanks for the upvotes and awards guys!=D",
                "labl": 6577,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Pretty brutal really. My dad was attacked by an emu once. He is bald and his head is a little shiny. he was sitting on a bench at a wildlife park and The emu must have been attracted to the shiny reflection, snuck up behind him and bit his head. I have never seen someone jump so far in one leap before or since. As a child this traumatised me a little and now I am pretty uneasy around all kind of birds.",
                "labl": 27325,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I worked in management at a theatre for a while. If the concession counter was slammed and I was able, I’d leave my post and help them sling popcorn. \n\nOne night while helping out, a particularly belligerent man started cussing out a 16year old girl on a cash register for being too slow, even suggesting she quit since she clearly couldn’t handle pushing buttons or scooping popcorn. It was pretty disgusting and I felt so bad for the girl, I stepped in and told the guy that our employees have the right to refuse service to customers who harass them as part of our anti-harassment/discrimination policy, empathized that the lines were longer than usual, and  suggested he should apologize and move on. He was PISSED. Left half his order on the counter and started fuming off.\n\nAnticipating his next move, I went back to my original post that night - as manager of the customer service kiosk. Oh boy, the look on his face when he saw me. (Didn’t want a refund of his tickets though so I assume he watched the movie, without popcorn).",
                "labl": 9859,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "At my university, it was always fun to watch the people who had been High School Popular People think that this sort of popularity would just naturally carry over and that on this campus of thousands, they'd be a big shot or something.  Was always fun to see just how many people could not care less about their attention-whoring.",
                "labl": 2325,
                "true_bin": 2,
                "pred_bin": 3
            },
            {
                "sent": "My mother trying to force me to do stuff when she came and visited my dad's house.",
                "labl": 3303,
                "true_bin": 2,
                "pred_bin": 3
            },
            {
                "sent": "Grays. Sports. Almanac.",
                "labl": 798,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Bold of you to assume we’ll make it another 5 years",
                "labl": 1965,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Pornhubs most viewed videos of the last year, duh.",
                "labl": 103,
                "true_bin": 2,
                "pred_bin": 3
            },
            {
                "sent": "Mrs. Doubtfire but relating more with Miranda than Daniel. As a kid I didn’t understand why she lost her shit when she came home to the petting zoo.",
                "labl": 3129,
                "true_bin": 2,
                "pred_bin": 3
            },
            {
                "sent": "My So Called Life. I shipped Angela/Jordan so hard; as an adult I can see why he sucks and why her parents acted the way they did. I still love those kids though.",
                "labl": 1070,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Obligatory \"not a movie but...\"\n\nWhen I was younger, hank Hill seemed like the most boring buzzkill stick in the mud. He didn't get teen slang and would get grumpy in his confusion. He didn't put up with antics and was always telling his friends to knock it off.\n\nWhen you get older, you realize hank hill is exactly the kind of guy you want to be. He always keeps his word. He's always responsible. He has faith in people. He's a good friend, always there to help his pals out when they need it. He doesn't understand his son but he does his best to support him. \n\nAnd he doesn't put up with bullshit. It's not zany antics he's stamping out, it's bullshit.",
                "labl": 1252,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "- if you don’t brush your teeth: big regrets.\n- don’t talk too much about yourself and your private life and ideas: it will be used against you.\n- emotionally you are going to feel better and survive the struggles you are into.\n- don’t breed anger, it will consume your time and energies.\n\nTime flies: I’m 38 years old, it seems yesterday I was in my twenties... enjoy the ride, take care of your body, don’t listen too much to the wired stuff coming from your mind.",
                "labl": 3887,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "With the high cost of medical and dental, that's even better than sex.",
                "labl": 15896,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "How do you feel about a friend with benefits, but instead of sexual benefits, they just make a reddit thread with the top comment of that day's top threads?",
                "labl": 1233,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Pest control tech here, Snakes had gotten into the pit and were climbing up and dropping down on people as they rode the elevator. Good times",
                "labl": 257,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "London Calling",
                "labl": 4514,
                "true_bin": 2,
                "pred_bin": 4
            },
            {
                "sent": "Talking Heads, *Remain in Light*",
                "labl": 6697,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Link to the Past",
                "labl": 335,
                "true_bin": 2,
                "pred_bin": 3
            },
            {
                "sent": "Alexander Graham Bell! \n\nThis man did not invent the telephone. Several people were working on similar technology at the same time. Antonio Meucci invented it first, but there was a court case over who got the patent rights. Meucci died before the case was settled, and Graham Bell won the glory he didn't deserve.",
                "labl": 9935,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Napoleon. I'm French and I don't get why people like him so freaking much here. He re established slavery and tried to conquer a huge part of Europe, leaving literal bloodbaths behind him\nGosh, even the painting of his coronation reeks of narcissism, he's putting the crown on his own head for f*ck sake",
                "labl": 1811,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Hitler. He’s remembered for his oil paintings, but most people don’t know he actually killed six million Jews.",
                "labl": 894,
                "true_bin": 2,
                "pred_bin": 4
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "Non Americans must think this was written in another language.",
                "labl": 118,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Elvis Presley.\nHe never wrote a song in his life, but his record label made any song writers hand over half of their writing fees, before Elvis would record their songs.\nHe's credited as a co-writer on the majority of his songs.",
                "labl": 6372,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "The Lion King.\n\nOh I thought Zazu was just an old fun-killer. What do you mean, Simba can't be king? Why would you prevent the kids from going where they want?\n\nAs an adult and father, I'm 100% Team Zazu.\n\n&#x200B;\n\nEdit: Wow, thanks for the awards and answers. Some folks pointed out Lion King ain't a teen movie and you're right, I guess I got carried by the replies and wanted to share the revelation I had about Zazu when revisiting the movie 25 years later with my daughter. Sorry for having drifted away from main topic.\n\n&#x200B;\n\nThanks for your answers, always nice so share with people from across the world!",
                "labl": 18865,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "SMB3 is amazing.",
                "labl": 115,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "\"It's my estimation that every man ever got a statue made of 'im was one kinda som'bitch or another.\" - Cap'n Tightpants",
                "labl": 193,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Fort Knox has no gold in it...",
                "labl": 4322,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "This actually happened last night, my fiance started talking to me like we had never met before and after a minute I realized that she was dreaming about our first date. It was really wholesome and I was surprised at how much detail she remembers.",
                "labl": 10298,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "I had a sleepover at my friends house and her brother was in her room with us because he's young and that's what he does. He had the bed and we were on the floor. So eventually he fell asleep and we were reading her old messages like the pair of weird children we are when he sits up, stares at us and says \"Light out!\" and drops back down. It was horrifying and is too this day. We never told him.",
                "labl": 371,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Brother aged 17, deeply asleep: \"who turned off the puppet show?\"\nMe, wide awake, yelling back: \"you did!\"\nBrother: \"oh no, it was just getting good...can you turn it back on?\"",
                "labl": 133,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "*What if Jod was one of us?*",
                "labl": 429,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Was in the scouts whittling a stick for funsies. Except I was pushing the blade in the wrong direction and whittled my index finger instead",
                "labl": 606,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "My wife sleep talks.\n\nThe night after we first watched insidious she just sat up in bed bolt upright eyes closed. Turned her head towards me and said “Why’s there a girl in the corner?”\n\nShe rolled back over and went sound to sleep.\n\nNeedless to say the bed side lamp went on and I went back to reading for a little while...",
                "labl": 559,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Lady at a convenience store threw a fit because the POS terminal asked for her ID when she was buying cigarettes. As in, it needs to be scanned to go any further. She started screaming how she didn't need one, and she was clearly was old enough to buy. She refused to give them her ID. So the clerk just looked at her and with a deadpan look said \"alright, have a nice day then. I can help the next customer over here!\" and then, with a smile on the clerks face told the lady \"ma'am you're going to have to scooch over a bit so I can help these customers. Thanks!\" Lady threw a bigger fit and started screaming some more. Clerk kept ignoring her and the manager came out to see what was going on. Tried to calm the screaming lady down but she wasn't stopping. Manager said \"Sorry, but we don't serve children unless accompanied by an adult. You need to leave my store before I call the cops.\" Screaming lady said \"I am a cop you idiot.\", manager replied \"yeah, cops get arrested all the time, you're not a special case.\" Lady just stared at her for 10 seconds, as if she was ready to fight before just deflating and finally leaving.\n\nAll this shit over a pack of cigarettes.",
                "labl": 288,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Coffee is less of a cool drink and more of a necessity",
                "labl": 131,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "So I broke my right arm when I was a kid then decided to put a cast on me. My skin under my cast is so itchy, its like my skin is alive. When 2 months have passed, I decided to scratch my skin under the cast using a pen since my fingers couldn't reach further areas. While doing so, I accidentally put the pen further away inside that I can't remove it under my cast since I can't reach it then I just ignored it after that thinking that it will be just fine and I didn't tell that to my parents since they would be mad. After 2 months, they decided to remove my cast since its already due but the night before removing my cast, my mom noticed that my arm smells rotten. So fast forward, they removed the cast in my arm in the hospital then they noticed that the pen was penetrating my skin for months and the hole is about a size of a penny full of pus. I didn't even feel a thing. After that, the hole eventually became a penny-sized scar in my skin.",
                "labl": 7462,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Was a kid, only around 10 or 11. Thought my iguanas were fighting so I went to take the boy off the girl.\n\n\nSpoiler alert: they weren't fighting, and I don't blame him one bit for biting me when I tried to break up him getting laid.",
                "labl": 258,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "I quit giving a shit. I'm not well liked now. But i am liked. And that's better then before",
                "labl": 1241,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "My girlfriend was sleep working one night.\n\nHer: \"Can we get that done this week?\"\n\nMe: \"Huh?\"\n\nHer: \"Can we get that done this week?\"\n\nMe: \"Sorry?\"\n\nHer: \"Can we get that done this week please?\"\n\nMe: \"Ok\"\n\nHer: \"Thanks\"",
                "labl": 17804,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "In this thread: a lot of people who were never considered good guys.",
                "labl": 21383,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "All that held me back was the feeling of guilt for how my family would feel.\n\nI couldn't do it to them.",
                "labl": 26110,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "I quit giving a shit. I'm not well liked now. But i am liked. And that's better then before",
                "labl": 1241,
                "true_bin": 3,
                "pred_bin": 3
            }
        ],
        "incorrect": [
            {
                "sent": "For those who aren’t aware, tonight is the start of the jewish new year. There is an old, old tradition that at this time of year God “opens his book”. During the days between the new year and Yom Kippur, Jews pray for atonement and pledge to do better in the following year, and on Yom Kippur God enters the names of those who have truly atoned in the  book, and seals it for a year. Those whose names are sealed will live for at least another year. So for someone to die on the very last day of the year means that God judged that person very highly. It’s an old story/tradition from the Middle Ages and I doubt anyone literally believes this now, but it seems like the perfect ending to her life.",
                "labl": 1059,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "I was in Aussie at Christmas. Holy fuck everything was on fire and now I hear people in Melbourne can't even leave their houses.",
                "labl": 860,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "happened not to me, but around me.\n\nI have a coworker/friend in a hospitality company that was pretty huuuuge. My coworker brought a lot of experience and skills to the table so many executives and bosses want him working on their projects in their departments in their umbrella of the company. When it was time for him to ask for a raise, our manager, director, and executive director turned him down and low balled him with a counter offer so insultingly low he started looking for jobs outside of the company.\n\nCFO, and other senior VPs heard about said move and reached out to him to get him to stay, and they worked it out amongst each other so they can share him in their special projects along with a hefty compensation package.\n\nCoworker being respectful puts in a request to transfer that has to be approved by the current manager, director, and executive director which they promptly turned down. To make matters worse, they go ahead and write him up for \"attendance\" problems from a couple of months ago... We're all salary, and for the most part project based.\n\nThroughout all of this, I am a fly on the wall since we shared an office, here I am laughing with him while he was in phone calls with the literal people who ran the company. He was told to ignore all that, they apologized to him, they got VP of Human Relations in on the meeting explained the situation which then launched an internal investigation unbeknownst to the 3 clowns.\n\nthe ensuing shit storm that came down onto the 3 clowns is more than enough to make this story awesome, but the cherry on top, is that he is now their boss...\n\n&#x200B;\n\n**tldr: \"management\" team tries to screw over an employee who ends up being their boss.**\n\n&#x200B;\n\n**UPDATE**: thank you for the award, and as a thank you, I will share the rest of the tea, sorry for the delay. \n\nthe way it would've worked before all this went down, is that, said executive director was gonna be promoted into a VP position and move into the big player's lounge in our main office, director which is clown#2 would've taken EXECdir spot, and clown#3 which was manager would've taken director job. \n\nThe powers that may be, CFO, senior VPs that were working behind the scenes took this opportunity to let the clowns dig a hole for themselves.  and to everybody's delight, they did. \n\nI'm going to start with the matter at hand, CFO and senior VPs told my coworker to sit tight, and they will make sure that he is taken care of, and that he from then on will be only taking instructions from them, with the VP of HR on the phone, the process of re-routing him up the chain of command went super fast. I mean why wouldn't it, the bosses who would've reviewed and approved all this have been working behind the scenes to make it happen and they are all on the phone now. My coworker was told that by the next business day he just had to fill in the proper paperwork and to send it straight to VP of HR, and formal announcements will be made to the rest of the company by the end of the week. My coworker then asked the bosses to use some of his newly granted compensation for a vacation week, just to avoid the drama.  \n\nTHIS WEEK was glorious. The clowns were busy calling my coworker, blowing up his phone. LOVING the drama that was going on, I was texting him updates. Since clown #1,2, and 3 always relied on us salaried grunts to take care of everything for them, their incompetence kept showing in their \"BIG\" projects. Projects that have to be submitted to the same CFO and senior VPs that caused all this for them. Every one of our internal clients (other departments, execs, and bosses within the company) was looking for my coworker, the incompetency of the clowns have spread across at the management level, they are all now bypassing them and going straight to us to get things done. \n\nHR was prompted by the VP of HR to start investigations in the background and we were all interviewed and sworn to secrecy. \n\nThe end of the week comes, and my coworker comes in, brand new suit, sits on his desk, and we start our usual banter.  This is supposed to be the day of the big announcement. Clown #3 calls my coworker into the office to write him up for as many things as clown #3 can. \\*\\*\\*\\*THIS I CANNOT CONFIRM because I'm only hearing this from my coworker\\*\\*\\*\\* but apparently clown#3 was putting the book down on him, and threatened termination due to the number of offenses (they wouldn't have fired him, they needed him that much)\n\nMy coworker has a habit of giving a deadpan face and just shrugging through everything that is not interesting to him, so apparently that's what he did. \n\nWhat I can confirm is that after this meeting, he showed me an email of said clown#3 scheduling a meeting with him and clown #2, and #1. WHICHHHH HE DECLINES IN FRONT OF ME...he laughs, looks at me, says watch this,  he walks out, and after some time comes back into the building with the Senior VP straight to clown#1's office Exec Dir.\n\nsome time passes and it was fun to watch Clown #2 Director, and Clown #3 Manager rush to the same office. \n\nThey were all passed over for the promotions, were not granted their raises, and now all their projects go to my coworker for approval. \n\nI no longer work for the company, after some more drama I have moved on as well. I'm still in touch with my coworker, the last update I have heard is that clown #1 and #2 exec director and director would be retiring this year after so long with the company. \n\nI heard that #3 burnt the team to the ground due to sheer incompetence, and is on the way out as well. #3 started the team with a total of 9 direct reports now down to 2.",
                "labl": 1946,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I found out my parents wanted to send me to a different secondary school from all my friends, for several reasons that made sense to them, but little lonely me who didn't have many friends was not happy AT ALL to be losing those I had. And then, I found out that not only would I have to start all over again, but this school had lessons...on SATURDAYS.\n\nWell, fuck that. I hated school at that age, weekends were my refuge, and now I was even losing some of  that? Nope. I cried, I begged, pleaded...but their minds were set.\n\nAnd then...and then someone let slip that this school had an entrance exam. It wasn't difficult, I was pretty sure I could pass it, but my parents clearly assumed it was a given, clearly having forgotten that I had free will, or assuming that I was so used to doing what I was told that I'd just do it.\n\nWRONG.\n\nIn my very first act of childhood rebellion (aged 11), I went and told them that if they made me do it, I would fail the entrance exam on purpose.\n\nYou could see that it had not even occurred to them that this could happen. I still remember the moment of pure, unadulterated surprised Pikachu face before the sputtering, shouting, threatening (not violence, just grounding, loss of privileges etc) began. My favourite exchange involved my Mum telling me that I WOULD pass that exam and me responding, \"No I won't. You can't MAKE me,\" and rendering her, for one of the first times in our relationship, speechless.\n\nThe whole thing was as revelatory for them, especially my Mum, as it was for me. I learned to stand up for myself, and that I had free will, and they learned that I wasn't some obedient little girl who would participate without question and was not just always going to meekly fall in line. \n\nThe change of school thing was dropped. I didn't really even get punished too much, because I hadn't actually done anything wrong and my parents (who may have come off sounding terrible but were in fact wonderful, just unaware of the stubbornness they'd gifted their daughter) felt uneasy about teaching me that exercising free will was wrong, particularly as my mum was a teacher. I wasn't allowed a riding lesson that week, and that was it. \n\nFunnily enough, I now think I probably would have been better off changing schools. The reason I didn't have many friends was that I was bullied at school - quiet, academic, wore THE MOST ridiculous glasses (adult-sized, on a 7yo's face, because my sight was so shit that they didn't make lenses the strength I needed in child sizes in the 80s 🙄) - so a new start in a new school where no one knew me would have been an opportunity to start over. But the fact that I'd been bullied made that seem like a horror instead of a good thing and I didn't have many friends but those friendships were hard won and close because we were all the outcasts for various reasons (kids SUCK). That school (despite the Saturday lessons) catered for more of my interests and favourite subjects too.\n\nThing is, if my parents had sat me down and talked to me about it, pointing out the positives of a new start and that the school had a curriculum that I'd love, and reassuring me they probably could have talked me into it. The mistake they made was simply trying to steamroller me and ignore my feelings and thoughts. So there's a parenting tip for you.\n\nIf this story ever comes up, my parents deny it, or say I'm misremembering or embellishing it, but I'm honestly not. It was such a moment of revelation to me, such a formative experience that it's imprinted on my memory, the day I learned that I had free will even if it contradicted my parents.",
                "labl": 193,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Rugrats. The parents were so young and just doing their best. I like it was a group of neighbors that were best friends too. I get really stressed out on their behalf now. Especially the one where didi just wants to make it home before her banana tree she bought died in the car but no one could get their shit together",
                "labl": 22458,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "JUNO. 100%",
                "labl": 3103,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Rush - Moving Pictures.",
                "labl": 126,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Factorio!",
                "labl": 16518,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "\"It's my estimation that every man ever got a statue made of 'im was one kinda som'bitch or another.\" - Cap'n Tightpants",
                "labl": 193,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Alfred Hitchcock was an asshole/sexual predator. [Tippi Hedren wrote about it in her memoir](https://www.usatoday.com/story/life/books/2016/10/31/tippi-hedren-alfred-hitchcock-the-birds-marnie-tippi/93064436/).\n\nShe did say he was a brilliant film marker, so you can be both.",
                "labl": 29295,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Henry Ford was so anti-Semitic that Hitler considered him a hero.",
                "labl": 41340,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Basically all of them. You couldn't get way up in politics without being a bad guy in certain way.",
                "labl": 1246,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "i was headbanging my hair dry in the bathroom, I hit the counter.  I was 8.",
                "labl": 9822,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "When I was 5, I was spinning around in the living room and then fell face first into the coffee table. I have a scar on my forehead from that lmao",
                "labl": 1757,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "I didn’t want to go to work one day when I was about 18. So I cut across the top of my foot with a sharp knife in such a way I needed 14 stitches. I told them I dropped it on my foot peeling an apple. What a fool am I !!",
                "labl": 232,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Getting my bulldog jealous because of some random doll laying on the ground, making her think that I would try to snatch it from her, and get bite in the left ear by yawning. Legit.",
                "labl": 258,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "I called someone I barely knew a couple of days before I planned it to basically unload what I couldn't say to those closest to me. It sound backwards I know but I wasn't really thinking straight back than. I don't think they understood the reason to the call becusse we shifted to talking about roommates and I had a good laugh for the first time in a while. I decided after we hung up that if a stranger could make me smile that I wanted to try to meet those who could make me happier and hopefully be that person for someone else. A year later and I can happily say I'm better and enjoying life, I found that the only real person though that can make me happy was myself. I just needed to give him a chance. \n\nThat person that I originally called, I am still in contact with them but haven't told them how much they helped me that day yet mostly out of being nervous lol. I hope to repay them though with never leaving their side because they came to mine without even realizing it and I am forever grateful. \n\nMy advice to anyone making this far I'm my response lol is it doesn't cost you anything to listen and be nice, someday you may help someone more than you will ever realize!",
                "labl": 4704,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Found my father's pistol, but couldn't find the bullets.",
                "labl": 283,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Normally I would use my alt account to post this, but I have been more and more open about my mental illness recently, so I'll post it on here. First of all, the stigma around this topic sucks so much and I want people to be able to openly talk about mental illness without others judging them. I really hope anyone who will read this will take a moment to check on their friends, so many people don't and even if they want you to or not, it will make them feel more loved in the long run.\n\nPotential trigger warnings below, so just be warned. PS I love you, even if you don't love you.\n\n>!I have been suicidal for 12 years. The last 2-3 years I have been doing much much better and I don't really consider myself suicidal anymore, but for the sake of this I will include this year in the tally because I had a bad month a few months back.!<\n\n>!There have been 3 very distinct times in my life where I almost killed myself. First was when I was in high school, I started drinking every day and blacking out all the time, I did drugs and drank every day. I hated life and just wanted to feel something else. One night I was extremely wasted and decided to go walk around town. I was standing next to the road and was waiting to just jump in front of a bust or large truck. While waiting I was thinking about the reasons I didn't want to be alive. After an hour of thinking all the bad things, I started thinking about reasons I might want to be alive... This first time was because I promised myself that I wouldn't make my mom bury another child (my sister died before I was born).!<\n\n>!The second time I was 8 months out of HS, same scenario as above with all the drugs and all. This time I had a gun to my head, I was going to pull the trigger, but when I did my finger wouldn't move.  I put the gun down and cried. This time I remembered that I wanted to move away some day and see new places, I couldn't die before I left my hometown and had new experiences.!<\n\n>!The third time was my closest time. I was in college and my entire life fell apart. GF left me, lost my job, had to drop out of school, one of my pets died, I lost a good friend, my life literally collapsed around me. I took an entire bottle of pain killers, mixed an entire bottle of vodka with it and then went to sleep. I woke up 30 minutes later with the worst pain of my life. I could have just took the pain, but once I felt that, once I felt something that made me actually feel alive I called my friend. He knew I was suicidal and knew that I would probably try something soon. He was on call for me 24/7. He picked me up, forced me to throw up and then rushed me to the ER to get my stomach pumped. I decided to fight it because I actually realized that I WANT TO BE ALIVE, I JUST DON'T KNOW HOW TO LIVE.!<\n\n&#x200B;\n\n>!From that day on, I have tried my best to be happy, its been 3 years now, and I have only been in a slump where I was slightly suicidal for 6 days out of 3 years. My depression tried killing me, I didn't try to kill me. That is how I think about it. So now I fight my depression, instead of being my depression.!<\n\nEdit: I got so emotional writing this I forgot to mention my cat really helped me with my depression. She never leaves my side, it's like she knows I need a guardian of some sort.",
                "labl": 139,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "It sounds crazy, but I'm getting a sneaking suspicion that the earth just might be spherical after all",
                "labl": 19163,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I was gonna say rim jobs then I saw all the thoughtful answers....\n\nEdit.  Thanks for the awards folks,  I'll pay it forward.  With rim jobs of course.",
                "labl": 1340,
                "true_bin": 3,
                "pred_bin": 1
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "That Flight 93 was shot down by the US military on 9/11. If you know that two hijacked planes were flown into the WTC and one into the Pentagon, and that a 4th hijacked plane is headed for the White House....you take it down. Period. If you can take it down over a rural area, all the more better (which it was). I think they took the best option in a worst case scenario and made the passengers out to be heroes, and rightfully so, because the people on that plane were already heroes to somebody in their lives.",
                "labl": 740,
                "true_bin": 4,
                "pred_bin": 4
            },
            {
                "sent": "At a place where my wife used to work: a body.\n\nThere was a crash from the elevator area. The boss went to see what it was, came back white as a sheet, and said \"*Do not go out there*.\" Two maintenance guys had been working on the elevator, one was in the bottom of the shaft, and the other one made one small error...\n\nBut I'm guessing the single most unusual item ever found at the bottom of an elevator shaft was a Wright R-2600 aircraft engine, on July 28, 1945 in the Empire State Building.",
                "labl": 2324,
                "true_bin": 4,
                "pred_bin": 4
            }
        ],
        "incorrect": [
            {
                "sent": "\"Oh jod\"",
                "labl": 589,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "I had an elderly lady come into the pharmacy I work at when I was roughly 17. It’s a community pharmacy and all the patients and people in the community have been going there awhile, they know the owner and he knows them. She was acting really suspicious and terse with the employees, walking around shrinking away from people and shit. I saw her grab something and put it into her purse, a couple things of robutussin.\n\nI walk up to her and say “ma’am I need you to put that back or pay for it, and if you were wanting to sell that or use it to make something, it doesn’t even have the right ingredients” (I should clarify that this is in Clarksdale, MS one of the biggest meth and drug abuse places in the country)\n\nShe acts accosted and starts screaming that I need to unhand her and stop trying to abuse her and then “IM GOOD FRIENDS WITH THE OWNER AND I WHEN HE HEARS HOW RACIST AND ABUSIVE YOU ARE I HOPE YOU LEARN TO BE A PROPER MAN WHILE FINDING A NEW JOB!” \n\nSo I stayed in front of the door and calmly said “ma’am I’m sorry I’ve offended you. The owner is here today, actually.”\n\nShe walks back and starts hollering “where is Eric?! This young man is abusing me!” The owner rushed out, looked at me and said “what happened?” “She said “he accused me of taking medicine” and I looked at the bag. The owner and pharmacist looks at me then asks her “Did you take any?” She said “Mr. Eric I’ve known you since I moved here four years ago and I don’t like this little boy you have working for you. His mama didn’t teach him how to treat a lady!” To which he said “I think she did a fine job, she’s my wife. Let me see in your bag.”",
                "labl": 181,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Ghislaine Maxwell suicide date",
                "labl": 4494,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Retired 40 years in the trade the best I ever found was a $20.00 bill but know a man that found a $7000.00 diamond ring kept it for six months no one ever asked about it and he gave it to his wife.",
                "labl": 666,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "So I broke my right arm when I was a kid then decided to put a cast on me. My skin under my cast is so itchy, its like my skin is alive. When 2 months have passed, I decided to scratch my skin under the cast using a pen since my fingers couldn't reach further areas. While doing so, I accidentally put the pen further away inside that I can't remove it under my cast since I can't reach it then I just ignored it after that thinking that it will be just fine and I didn't tell that to my parents since they would be mad. After 2 months, they decided to remove my cast since its already due but the night before removing my cast, my mom noticed that my arm smells rotten. So fast forward, they removed the cast in my arm in the hospital then they noticed that the pen was penetrating my skin for months and the hole is about a size of a penny full of pus. I didn't even feel a thing. After that, the hole eventually became a penny-sized scar in my skin.",
                "labl": 7462,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "When I deliberately cut myself. Not seriously, I just wanted the word \"Ninja\" on my hand. Don't ask me why...",
                "labl": 7648,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "I got drunk on 4th of July and fell in a utility hole thing in my friends yard and then got sunburned so the scar never healed properly",
                "labl": 876,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "parents and also video-games. I wish I could make a love letter explaining to every developer personally how they saved me through those dark times by creating media which started from simple arcade games to breathing worlds that also are cinematic masterpieces. Sometimes the gameplay makes up for it instead of the story while sometimes you need a bit of story with that gameplay. I'll just point out the main one.\n\nValve, thank you for making media which helped me through dark times. I've played most of the games that you've made from l4d to cs 1.6...I can't thank you enough for bringing memories and a distraction to keep me away from that noose, even if you're a business I want you to succeed further since you've earned it. I loved the left 4 dead series and replayed portal & half-life multiple times over, not to mention the mods too. You deserved the break up until half-life alex and the fact that you even made hl:a gives me hope for the gaming industry. I love valve and I hope you do too!",
                "labl": 144,
                "true_bin": 4,
                "pred_bin": 3
            },
            {
                "sent": "This one pertains to my university, but some people may have the same experiences with theirs.\n\nSo students who choose my university send applications in by December. The entire COVID shutdown happens in March, around the same time university acceptances are starting to be sent out. Each first year student has guaranteed residence. \n\nEveryone is wondering what the new teaching model will be, and it’s announced that it’s mixed. 30% in person, 70% online. \n\nAt this point, if you’re in first year, and all your courses are online, why pay for residence? You can do class online. But the university sees these discussions, and know they’ll lose A LOT of money if they don’t have students in residence. \n\nSo what is announced? Almost EVERY first year has at least 1 person class. Meaning? They have to be on campus. MEANING, they have to live in residence. \n\nIdk if this makes sense to anyone but I thought it was interesting.",
                "labl": 4287,
                "true_bin": 4,
                "pred_bin": 3
            },
            {
                "sent": "When I was in my teens, that Tupac was alive and would come back for an album (I want to say it was the “Theory of 7s or something).\n\nI’m a bit more critical of what I read now.",
                "labl": 409,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Carol Baskin didn't kill her husband \n\nI believe he was heavily involved with drugs and thats the reason why everything he touched turned to 'gold'. I think he he flew drugs over to Mexico and it all went wrong and never made it back",
                "labl": 1556,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "My boyfriend woke me up the other day by gently putting his fingers in my mouth and I kept moving my head out of the way until eventually I was like “can you stop that!!!”\n\nHe then sounded genuinely upset and asked why I woke him up as he was having a really nice dream about feeding a deer. Brilliant.",
                "labl": 5040,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "A large chunk of my taking the lord's name in vain would go away.",
                "labl": 41259,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Jesus is actually pronounced Yeshua. I doubt he would care.",
                "labl": 541,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "She’s earned her rest. I wish she could have held on a little longer but this woman fought hard for our rights and endured much on a personal level. RIP.\n\nEdit: thank you for the silver",
                "labl": 754,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "In this thread: a lot of people who were never considered good guys.",
                "labl": 21383,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "You come home from work and you're tired and if you don't feel like making dinner, then you're not eating dinner.",
                "labl": 25879,
                "true_bin": 4,
                "pred_bin": 3
            },
            {
                "sent": "Constantly cleaning the kitchen.\n\nYou wanna cook? -- you gotta clean up first\n\nYou just finished dinner and wanna watch netflix before bed? -- you gotta clean up dinner or you'll get ants\n\nyou wanna order takeout to avoid cooking? -- still gotta clean the kitchen after you eat!\n\n&#x200B;\n\nthe kitchen will never be clean for an entire day. its exhausting",
                "labl": 189,
                "true_bin": 4,
                "pred_bin": 3
            },
            {
                "sent": "I tried cutting open a lemon with a fork\n\n\nEdit: the fork slipped and entered my hand, but I guess the sharp lemon theory will do! thanks for the award kind stranger!",
                "labl": 5650,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "Was about 4 broke a glass jar and sat on it",
                "labl": 2181,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "Cat.",
                "labl": 236,
                "true_bin": 4,
                "pred_bin": 1
            }
        ]
    }
]