[
    {
        "correct": [
            {
                "sent": "What if Satan came down one day and said ''It's pronounced 'Zlatan' then left?",
                "labl": 5263,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Does that mean Jesus would be pronounced Geezus?",
                "labl": 22978,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "God isn't really a name though.",
                "labl": 117,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well I'd have to think he's just trolling because God actually isn't even his name. His name is YHWH, God is just what people called him when they didn't want to use his actually name and after a while it just became the only thing people called him. Christians, Jews, and Muslims only believe in one god so calling their god \"God\" never had the problem of becoming confusing. Though I know certain sect of Christians call him Jehovah, which seems to be an anglicized version of YHWH. And also Allah is just Arabic for God, it's not another name for him. It's like the equivalent of Christians saying Deus, the only difference is Latin has lost it's value as the Christian/Western world's lingua franca.",
                "labl": 105,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Since there's no question, I'll offer one: why didn't she retire when Obama was president and Democrats controlled the Senate?",
                "labl": 224,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "We've kind of reached a balance of mutually assured destruction. We don't bring in the tanks and nukes, they don't bring in the cassowarys and drop bears.",
                "labl": 22761,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "As a resident of Western Australia, where the majority of the battles have taken place, I am constantly reminded of this ongoing conflict. Every day I see emu's, every day emu's see me. We see each other as enemies, yet we are the same. Two species grown to fight amongst each other, based on the mistakes of our forefathers. Our emotions, our feelings, our hatred, all defined by our history and surroundings. It has defined our past, it defines our present. However, when I see these flightless aviarians, I see not a faulted species, but a mirror of ourselves. We have only known this conflict, but we shall not be defined by it. Neither of our species can fly. But with peace as a possibility, perhaps we can both soar...",
                "labl": 1493,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "People dont really think about it. We are all preoccupied, watching in horror as our rebel kangaroos conquer Uruguay.",
                "labl": 442,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "You laugh but having run into these fuckers in the wild I tell you, they would kill you and everyone you love.",
                "labl": 340,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Every day I live in constant fear of the emus' inevitable swift and bloody reprisal, I wouldn't wish for anyone to have to live this way but all we can do is take each day as it comes. My great uncle Bazza has it worse, he fought in the war and it still hurts him to this very day, he can't even see a chicken without having a complete meltdown now. For me by far the hardest thing about living under the shadow of the emu is th- hold on, I think something just breached the birdseed perimeter outside my bunker, I hope they don't make it past the line of hanging CDs. I'm gonna go check it ou-",
                "labl": 179,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I was in Aussie at Christmas. Holy fuck everything was on fire and now I hear people in Melbourne can't even leave their houses.",
                "labl": 860,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I used to work for a super cunty manager when I worked at McDonalds. This guy was horrible to us. He was constantly bullying us, shit talking us TO CUSTOMERS, and doing everything in his power to make us miserable. Well, so many people complained about him that he ended up getting fired. \n\nNew manager was great. He was super chill and understanding with us all. A couple weeks after he took over, the old douchebag comes in and starts talking about how terrible the store looks, how our service is shittier than ever, and how much this store needs him. The new manager looked at him and said \"If you don't leave, then the cops are gonna make you\"\n\nWhen the douchebag didn't move, new awesome manager stuck to his guns and called the cops. The douchebag is no longer allowed on ANY McDonalds property in the city and has a restraining order against him.",
                "labl": 1328,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, this might be a long one.\n\nI grew up around a mother with dissociative disorder as well as narcissism. She was addicted to opiates as far back as I can remember, and would do anything to get them, and I mean anything.\n\nGrowing up, it wasn't rare for her to have a tantrum during one of her highs and beat the shit out of me, break me down by picking apart every little thing she knew I was afraid or self-conscious of, and actively sabotage my relationship with my father and siblings.\n\nShe would be up for days at a time, pass out standing up with her eyes glassed over and back hunched, and when she festered once again start moving and otherwise destroying everything in the house.\n\nThere were times where I'd leave and the house would be clean, and come home and it would look as though a pissed off tornado had run through the house i.e. broken glass, animal feces, dirty clothes, roaches, empty pill bottles, ground-up pill residue, and other miscellaneous things littering the house. On particularly bad nights she would hallucinate, and during those times it wouldn't be uncommon to find pools of her blood on the ground from running through glass.\n\nI remember being up for days at a time because her and my father would scream at each other for days at a time without stopping; actively trying to get me to pick one side or the other even if it meant barging into my room at 4 am to begin their screaming match where I could watch.\n\nShe manipulated me, abandoned me at times in the middle of nowhere when she'd meet up with her various sugar daddies (she was still with my dad during this), and never once apologized during her brief moments of mental clarity. If anything, she would blame everything but herself. In her mind she was infallible.\n\nMoney was always a big issue since she couldn't work in such a state. She sold some of her pills, yes, but ultimately those funds were used to buy more drugs anyway. Because of this, we were homeless frequently, without power and water for literally years at a time, and barely ever had any food. It was almost every night I went to sleep with the only thing I'd have eaten that day being a school lunch. On weekends, sometimes I didn't eat at all.\n\nThe rest of my family had no clue this was happening. During the summer when I was 16, my aunt whom I hadn't talked much with since I was a lot younger got in touch. She asked if I'd like to come to stay with them in Texas for a few weeks during the summer.\n\nOf course I said yes, and I was absolutely ecstatic. I didn't bother asking my parents since I'd be very much surprised if they even noticed I was gone so they were unaware. My aunt drove up all the way to Iowa and stayed the afternoon with us.\n\nMy parents seemed to lack the cognition to recognize she was even there out of the blue so they didn't come out of their room. As I stated before would happen frequently, when she arrived our house was fairly clean. We left for a bit to go get food, and when we returned the tornado had already passed.\n\nAs she told me when we were on our way to Texas: the thing that bothered her the most wasn't that our house had suddenly gone to hell, it was that I didn't even react to it. Instead, I tiptoed around the debris and started packing my things without a word.\n\nThis deeply unsettled her, and ultimately she asked me if I was safe where I lived. I said yes, as it was all I had ever known. She told me that what she saw frightened her, and she wanted me to come live with her in Texas. Thinking that she was joking, I brushed it off. After a few days down there though, I knew I had to do it. They showed me love, compassion, and care that I'd never even known existed prior to this and it shook me to my core.\n\nSo we decided, I was going to get emancipated from my parents and move in with them. Ultimately, this involved sitting in a courthouse across from my parents and their lawyer.\n\nThe judge asked why I wanted to leave, and I explained the above. I expressed the love and compassion I'd experienced for the first time in my life, and that I wanted to, for once, live in peace.\n\nTheir lawyer rebutted, \"To me, it seems as though you have no respect for your parents. Is it because of their financial situation? It looks as though you're attached to the perks of living in a family that makes a reasonable amount of money, and not that you want to leave because they're unfit parents.\"\n\nMy mother and father joined in, hooting and hollering actively trying to break me down as they have so many times before.\n\nI let him speak, I let them speak, and I held my tongue until it was my turn. They tried to goad me on, tried to break me as they had so many times before, but I wouldn't let them.\n\nFinally, the judge asked me to speak.\n\nWith as level a stare as I could muster, I looked at mother, my father, and their lawyer across from me and said \"If you're asking me if I have no respect for my parents, then you are correct. However, to say it's simply financially motivated is incorrect. I no longer have respect for them because they have-\"\n\nAs I was nearly finished, my mother, as she had so many times in the past began to squirm and scream at me from across the table. \"HE'S LYING THE LITTLE BASTARD IS JUS-\"\n\nUntil the Judge slammed his gavel down and cut the room; my mother staring up at him in complete and utter disbelief.\n\nI looked at her, keeping the tears I knew were right behind the corner at bay and said, \"For once in your life; for once in my life, behave as an adult. You can't stop me by simply yelling over me anymore, you have nothing to hold over me now. You can do nothing.\"\n\nAs I spoke, the judge motioned to his officer who moved towards my mother. Her expression still frozen in complete bewilderment as the officer aggressively told her to get up out of her chair and escorted her out of the room.\n\nThe judge looked to me, my aunt, my father, and his lawyer with one sweeping glance and then spoke.\n\n\"I am sorry that you have had to deal with this for so long young man. There's nothing more that you or anyone else needs to say. You deserve to live a normal life as a normal kid and it's obvious to me now that your parents are unfit to produce that kind of environment. You will go back to Texas with your Aunt, and we will regularly have our social workers in touch to check in on how you are doing. Make the most of this second chance, good luck young man. Adjourned.\"\n\nThough the bang of his gavel was the only noise that permeated the room, all I could hear was the ringing in my ears. My father and his lawyer were escorted out of the room and the tears I had held back all this time came gushing out like a tidal wave.\n\nIt's been 7 years since that day and I am happy to say that I've managed to grow up and become a well-adjusted adult. I have a great career, great friends, and an amazing girlfriend. I've been in therapy ever since we got back to Texas, and I no longer have trouble sleeping or terrible bouts of anxiety and depression as I used to.\n\nLife is good.\n\nTl;dr:\n\nMother is a narcissist with dissociative personality disorder addicted to opiates. Father kind of just went with the flow and didn't really do much. Aunt came down to take me to Texas, saw how shit everything was and asked me if I wanted to live with them. After some time I said yes, went to court against my parents under the pretense of emancipation, and got to stare them down and layout all the trauma, pain, and fear they've caused me. My mother was escorted out of the room when she tried to cut over me, and the judge sided with us and I was emancipated. Now I'm doing really well.",
                "labl": 631,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A while back, I got a job as a popcorn monkey in the local cinema, as a temporary thing while I figured out what the fuck I was doing with my life.\n\nThere was a supervisor that had worked there since the site opened (around 5 years) who was a total bitch and had had numerous complaints about her from countless staff.\n\nIn the first week, I nearly quit because of her attitude - as an example one night I was on a close, and basically cleaned the entirety of the front of house on my own. I stopped to take a drink of water and she marched up to me going \"WE DON'T PAY YOU TO STAND AROUND DRINKING YOU KNOW!\" to which I calmly responded that I was thirsty, and needed a drink of water, and if she wanted to tell me I wasn't allowed to have a glass of water then good luck, but I'm pretty sure health and safety would have something to say about that. She huffed about not having had a break all day, which I ignored cos not my fucking problem, but internally I was put out about it, because it was totally fucking pointless to be such a twat about things.\n\nAbout 2 weeks in I get promoted to Supervisor as I was clearly extremely competent by their usual standards (I could walk and fart at the same time) but she also gets promoted to Floor Manager, so she continues to work her little power trips and try and lord it over me (and everyone else)\n\n4 weeks after that, I get another promotion to Floor Manager, and at this point we're equals, so she can't boss me around anymore. So instead, she tries a different tack, which is to try and lord it over me with her superior knowledge of processes, where to find stuff etc.\n\nMy response is to go (saccharine sweet) \"Oh thanks! That's so helpful, I mean you know how things work so much better than me, because you've been here 5 years, and I've only been here 6 weeks...\"\n\nShe had a face like a smacked arse. It was delightful :)",
                "labl": 1144,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "ex and i were moving out after a breakup. cleaning out garage. she was being critical of my post-breakup plan of moving in with a coworker until i could find a better place to live, as most options weren't great.\n\ni took a deep breath and laughed. this puzzled her. why are you laughing, she asked? i collected myself and said \"because this is the last time i have to listen to this. you don't get to be critical of anything i ever do, ever again!\"\n\nit was a really great feeling, because i literally thought of the \"you have no power here\" as i laughed.",
                "labl": 934,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Some secretary of some branch of a state agency would go on a power trip and stamp, \"Do not copy\" on things that she sent to local agencies. Well, I work for an oversight agency and I needed a copy. Locals were terrified so I rolled my eyes and called to explain that the locals and I were basically the same entity. Woman started to have a conniption fit, but she got real quiet when I cut her off and said, \"Fine, I'll issue a subpoena. What's your name and job title?\" She answered, and the sheriff served her a subpoena for what I wanted. Guess she wasn't used to that.",
                "labl": 4795,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Worked in a cellphone store, both selling devices and service contracts in the UK. Some kid (19-ish maybe) came in with a much shorter man who I later learned was his dad - for whatever reason (I forget what now) he wanted to cancel out of a contract he was partway through. Now I could already tell from the way the kid explained it in exasperated terms that he knew he couldn't cancel out of it, but his Dad wasn't taking his word for it and had dragged him in to try and 'sort it out' for him.\n\nThe contracts clearly state you can't cancel prematurely without paying off the rest of your dues, which I explained, and his father just went full Boomer Rage mode on me. Spitting, frothing, hurling vitriol - this guy clearly thought this was how you got things done. I stared him down, waited for him to finish, and repeated the contractual terms as stated. He hit me back with 'I'll report you for violating the Sale of Goods act!'\n\nSucks to be him because I had that bitch memorized. I made a point of it, infact, after the first few customers in my early days tried to bring it up to get their own way (*some chode on the internet had made posts about how you could sling the term around and usually scare retailers into doing what you want because 'they don't know it either' so it happened a lot even when there was absolutely no call for it*).\n\nI just looked at him and said 'Sure. Go ahead. You can even use our phone.' and pointed at the store phone right next to him. I knew he didn't have a leg to stand on and any trade commissioner listening to his claim would laugh him off the line.\n\nHe clearly had absolutely no idea how to proceed. After a moment of blank staring he just turned and stormed out with his son rolling his eyes so far back into his head he could probably see his own brain in embarrassment at his Dad's tantrum.",
                "labl": 1340,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I worked at a Walmart as a cashier, and the assistant manager there was a dick, he would insult everybody working there and forced us sometimes to do work above our pay grade.  6 months later me and him got transferred to another Walmart that was just built and they needed to pick a manager and assistant manager some random got manager but I got assistant manager (I guess all the complaints on the assistant manager basically gave him a demotion) so one day he was ordering the other cashiers around then i pulled him to the side and told him that if he kept pulling the same shit around he would be out of here.  I haven't heard anything from him since.",
                "labl": 24364,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "ooh!!!  I have a story for this!\n\nI got married two years ago overseas, because my wife is from Europe, and they have cool castles and shit.  My (Canadian) family and friends all came over because most had never been.  We're a little older, and well off, so we splurged.\n\nWedding was awesome, dinner amazing, reception is in full swing, and quite frankly, its a little warm.  Warm for us Canadians... It was around 10 C, in Early November.  When you mix in wool suits, drinking, and lots of dancing, some of us Colonists were working up a bit of a sweat.    Thankfully, the venue had a balcony, with huge doors.    \n\n\nI kept going over and opening them, as some folks were inside, some were outside, and there was a nice breeze... but... I had to keep going over, because they were shut whenever I looked back.  \n\n\nFinally, after the 5th or 6th time, this guy followed me, and demanded I keep the doors shut because it was cold inside.  I didn't know who he was, so he must have been a +1 of someone on my wife's side, so I was mighty confused when he said, and I quote \"Who the hell do you think you are keeping these doors open, and the temperature so low inside.\"\n\n&#x200B;\n\n\"I'm the guy who bought you dinner.\"  \n\n\nI watched him go over to my now cousin-in-law and grab his coat and almost pull her out the front door.  \n\n\nI thought one of my Groomsmen was going to burst he laughed so hard.",
                "labl": 169,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Not sure if it fits but during an insanely busy weekend before Christmas, a Karen was complaining to every associate about how messy our store was. The manager had relieved the girl at the fitting room and was helping to hang stuff. Karen pulled her crap and was trying to make a point that we were messy and a horrible place to shop.\n\nAt the this manager told her roughly, \"Ma'am we're messy at the moment because we're a popular store. And the biggest reason we're messy is because of woman like you who can't be bothered to pick up after themselves. It's not the associates making the mess. It's people like you. Your type have us outnumbered.\"\n\nFirst time I actually witnessed someone deflate.",
                "labl": 8441,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A cop pulled me over at 2am on my way home from work.  He was visibly agitated that I wasn't the drunk driver he was fishing for.  I asked him why he pulled me over and he gave me some nonsense about swerving.  I told him no I wasn't.  He walked away, did a 180 and came back with \"Well, if I searched your car right now, what might I find...\"  I laughed at him and told him that there was no way I would ever consent to a search.  He walked away fuming.",
                "labl": 331,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": []
    },
    {
        "correct": [
            {
                "sent": "That Britney Spears is either being held hostage or otherwise in a very compromised situation.",
                "labl": 5748,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I’m in the navy and we change uniforms a lot compared to other branches. There’s a conspiracy theory that there’s a rear admiral who’s wife has stocks in the company that makes our uniform. I just randomly heard someone talking about it. I have zero evidence that it’s true, but I 100% believe it\n\nEdit: told this to my coworker who added to the conspiracy cause he said the people who sell our uniforms is run by a rear admiral. The plot thickens\n\nEdit 2: apparently there’s more people saying theres more to the conspiracy so if you see this be sure to head into the replies and give them some upvotes. This kinda blew up and you guys rock",
                "labl": 15288,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Britney is the highest profile disney rape victim we might probably ever know about.  Her mental breaks were the result of sexual and physical abuse from her handlers, her parents, and people she worked with at disney.  The conservatorship she's been trying to get lifted is one designed to keep her silent, because the momentum of the #meToo movement as well as the high profile cases against hollywood folks will result in a huge financial hit to disney.\n\nIf we hear that Britney \"couldn't take it any more\" and killed herself, its most likely the result of everyone in her life trying to control and manipulate her, and they will likely kill her under guise of suicide.",
                "labl": 10179,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "A lot of entertainment companies are money-laundering fronts.",
                "labl": 41922,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I still to this day believe that for every sock that goes missing in your dryer it turns into a tupperware lid in you cabinent that fits nothing.  I have seen no evidence to disprove this.",
                "labl": 11376,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Computer virus protection companies create computer viruses.",
                "labl": 1422,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "While Lee Harvey Oswald did shoot and hit JFK twice, the final, killing shot came from the Secret Service vehicle directly behind the president's vehicle, by accident. The agent carrying the Secret Service's one and only AR-15 at the time stood up when JFK was shot the first two times, and was thrown back in his seat when the car lurched forward, causing him to accidentally shoot the president in the back of the head.",
                "labl": 210,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "When I was in my teens, that Tupac was alive and would come back for an album (I want to say it was the “Theory of 7s or something).\n\nI’m a bit more critical of what I read now.",
                "labl": 409,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Carol Baskin didn't kill her husband \n\nI believe he was heavily involved with drugs and thats the reason why everything he touched turned to 'gold'. I think he he flew drugs over to Mexico and it all went wrong and never made it back",
                "labl": 1556,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Snapchat is partnered with Apple to make Android cameras looks shitty",
                "labl": 512,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Stay calm around women I find attractive.\n\nI use to get anxious and even avoid",
                "labl": 13971,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Tell people to fuck off\n\nFun fact: FUCK OFF!!",
                "labl": 273,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I used to be embarassed by my dad picking up rubbish from the floor to bin when we were out as a family. I now actively go out with a litter picker in happiness and confidence that I am doing something good. Sorry dad!!",
                "labl": 24,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "He farted very loudly and proceeded to say, “you got the wrong guy”",
                "labl": 6021,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My wife was mumbling a lot and suddenly shouted \"**DONKEY KICK!**\" as she kicked me in my shin, so that was fun.",
                "labl": 13311,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My girlfriend once yelled in her sleep \"no No NO you SPUNKY LESBIAN\"\n\nI'm a dude\n\nstill tease her about it",
                "labl": 1467,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "After watching the Lego movie I really got into the Batman franchise - the comics, the movies, everything. This rather peeved my boyfriend.\n\nIt peeved him so much in fact that one night, while he was sleeping with his back to me, in a split second he sat bolt upright, turned to me and yelled \"FUCK BATMAN!\" right in my face. He them immediately slumped back down and continued snoring.",
                "labl": 2938,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "No gems, just horrors. I sleepwalk once in a while but apparently when I was a toddler I used to sleepwalk, cry and say 'she's following me' or just try to leave the house by myself.\nNowadays if it happens, I wake up looking at my reflection in the mirror in the dark. When that happens it fucking creeps me out so I won't sleep the rest of the night.\n\nEdit 1: Why don't I move or cover the mirror? The first time it happened, I covered the mirror but with my morning rushes to work, I pull the cloth down to get ready, and then cover it when I reach home. I've had and still have peaceful nights of sleep (with dimmed lights on) so eventually I'd skip on covering mirror and focussed more not being afraid of the dark. When I least expect it, I then I catch myself waking up to the mirror with a gentle head bump/nod. Get spooked at the incident, rinse and repeat with a blanket cover. I generally have good nights of sleep, these sleepwalks are very rare so I'm really I'm more concerned about my fear of sleeping in the dark. I can't do it. I need a dimmed light for bedtime.\n\nEdit 2: Is it this particular mirror in my room? Yes, it's always this mirror but maybe I haven't had enough sleepovers to have another sleepwalking state elsewhere. I think it's just my subconscious self remembering how I like the mirror during the daytime to get ready, do my hair, makeup, try clothes, etc. I live in a shared flat so I can only leave it in my room. It's a cheap full length mirror and anyway, these sleep walks are so rare. Recent 'episodes' HAS made me want to leave the mirror outside my room but then again I don't want to weird out my flatmates by describing them this particular sleeping habit.",
                "labl": 6218,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My boyfriend laughs in his sleep, it’s fucking terrifying to be woken up in the middle of the night hearing someone snickering next to you. He didn’t know he did it, so he never had to tell me but the first time it happened I thought someone had broken into my house and fuck with us. He still does the same laugh now, and it still creeps me out. \n\nHe also talks in his sleep, always goes on about “my blanket needs trimming,” or “the toes are in the bean jar” like dude I don’t know what you’re dreaming about but sounds awesome",
                "labl": 729,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I once asked my boyfriend if he could make some coffee way before wake up time. He happily did so, only to have me (now awake) tell him that it's way to early for coffee and ask him why he would do that.\nHe was a bit annoyed at first but after we found out what happened, we had a good laugh about it.\nSometimes we have whole conversations that I have no memory of. ^^",
                "labl": 411,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My 6'11 brother came running down the stairs having a full on panick attack about spiders. His eyes were shut the entire time and he fell asleep on the chair afterwards.",
                "labl": 751,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "... Fuck.",
                "labl": 12039,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Had a client at an animal hospital get upset when the veterinarian was a female. This lady legitimately threw a fit and refused to let the arguabley much more qualified doctor see her pet for no other reason than that the vet was female. So, the doctor told her to get out. The lady wouldn't leave and started yelling at and berating the doctor, threatening to call the owner of the clinic. She even whipped out her phone and acted like she was going to dial.\n\nNow someone saying they know the owner is something that is very very common, as the owner is still a practicing vet well over 60 hours a week, and has been for 20+ years. Probably thousands of people have this guy's number. Most of them on the older side that try to flex it, though. \n\nSo our female vet said go right ahead, I'm calling the cops if you don't leave. And that's exactly what happened. The client quickly left once the vet started speaking with the dispatcher. The police still came and took a report.\n\nLater when the owner caught wind, he left a note on her account that she was no longer welcome in our clinic :)",
                "labl": 174,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Oooo I have a good one! I was responding to a call with our volunteer fire dept a couple years ago. I was west of town and a vehicle rolled halfway between where I was and the fire hall. So I called the responding people and said I’ll meet you there. \n\nIt was a single vehicle that rolled and they were all immigrants from the Pakistan/Afghanistan region. Before I got there, a doctor from the same region had stopped to lend a hand. She was from the similar region as those involved in the crash and I had assumed she was the eighth person in the van. She started to try to order me around and tell me I only needed to know certain information about the patient she was with. It went something like this. Dr: “She has midline neck pain and sore ribs.” Me: “Okay, and crepitus or deformity to the.....” Dr: “That’s all you need to know!” Me: “Uhhh wha?” Dr: “I am a doctor and that’s all you need to know!” That’s when I figured maybe I should ask what kind of doctor, in case this is some whackadoo who just claims to be a doctor like we’ve had happen before. \n\nShe tells me she’s a podiatrist. I gave her my best look of trying to be nice but their feet are fine right now. When doctors or nurses show up on scene, they ultimately can trump EMS. But they have to actually do the work and sign off as having taken patient control. As soon as I asked her to sign the paperwork and ride with us to the hospital she realized she was out of her knowledge area and disappeared.",
                "labl": 6532,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My dad had just finished his 4 years in the army when a higher up saw him out and about with his bdu pants and a rock Tee on. The higher up started to yell at him about why he wasn't dressed up and my did flipped him off and said he had been out for weeks. Must be refreshing",
                "labl": 232,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Biggest crisis in the last 5 years.",
                "labl": 49182,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "GTA VI release date",
                "labl": 7517,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My name + obituary. \n\nIf I get more searches? 2020, 2024 election results. COVID vaccine FDA approval parent company. TSLA, GOOG, APPL, FB prices.",
                "labl": 4726,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Goob, Meet the Robinsons",
                "labl": 4889,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Maybe it's because I'm not American, but what's the whole point of gender reveal parties?! It's such a waste of money.",
                "labl": 379,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "This isn’t an ask reddit, it’s just a bit",
                "labl": 24,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "\"being Infront of that damn computer won't get you a job\"",
                "labl": 518,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I'm 39.\n\n&nbsp;\n\n#1. Life is work. \n\nEverything requires perpetual maintenance. All elements of your life, be they self-care, friendships, relationships, work-life balance, health, your house, your car, bank accounts, etc. require **constant** repair. This is our attempt at slowing down entropy. We'll never stop it, as the [energy of the universe](https://www.youtube.com/watch?v=w2iTCm0xpDc) is constantly trying to seek perfect equilibrium, and our efforts only last a lifetime. If you wish to be even *remotely* successful in life, you will recognize how much work you will need to put into every little thing. Otherwise, you'll end up like me: alone, unloved, unhealthy, and ready to die at a moment's notice.\n\n&nbsp;\n\n#2. \"Know thyself.\"\n\nIf you don't know who you are, you're gonna have a bad time. You need to understand that your life is HEAVILY impacted by various forms of luck: where you live; how much money your family has; how abusive your family is; the school system's resources; the literal air that you are breathing. These all have an impact on your life, and the possibility of your future life. The opportunities or obstacles of your life are LARGELY dictated by simple factors of luck. Not all, but I'll get to that.\n\n&nbsp;\n\n#3. \"Be yourself\"...is horseshit.\n\nIf you don't know who you are, *how the hell can you be yourself‽* How do you overcome this catch-22? \n\nA better variant, IMO, is ***\"be the person you wish to become\"***. Not a living or dead person that you hope to magically morph into. But the person that you, in your mind, wish to be in the future. \n\nDo you want to [be kind](https://www.youtube.com/watch?v=sicUhD1n-es), or ruthless? Do you want to be respected, or feared? To you want to help, or hurt? Those are broad and vague, and there are many many more, but they're starting points for how to approach your future. If you've decided to be ruthless, then you'll begin to adapt behaviors that go that route. If you're a meek and timid person who can't even say their name clearly (been there, done that, relevant username now), you're not likely to command any kind of respect.\n\nIf who you are right now is not what you want to be, then \"being yourself\" is the worst advice you'll receive. You must change yourself, because whether you like it or not, change occurs, and you can't control the majority of those changes. So change the ones you *can*.\n\n&nbsp;\n\n#4. Friends come and go.\n\nThe reason you have friends *right now* is because of geographic (and, to a not-to-be-dismissed degree, socioeconomic) reasons. Once you stop going to the same schools, and movie theaters, and book stores, and restaurants, etc. the friendships will begin to diminish. You will more likely grow apart over time, not together. It's possible, sure. But don't make any heavy bets, because you'll lose money on those bets more often than not.\n\nYou'll need to find new ways of making friends. College is yet another school-related location that can help. Clubs help. Hobby-related activities help. \n\nRight before COVID lockdowns here in LA, I made a friend with my tattoo artist, barely knew him otherwise. He mentioned he and his friends were gonna start watching crappy 80's horror movies on the weekend. I was down. Then the lockdowns hit, and we couldn't do it. And I'm bad at making friends with new people I've barely met, so I've made no attempts to reconnect. Maybe when I get back to the tattoo shop. Goes back to point #1.\n\nMaking friends will be hard. But if you're lucky, and make enough connections, it won't be *as hard*.\n\n&nbsp;\n\n#5. \"Expect the best, prepare for the worst.\"\n\nHaving a positive outlook is healthy. If you're perpetually despondent, hopeless, and listless, you probably have depression, and that needs tending to. But ONLY having a positive outlook will lead you to trouble. You must prepare for the times when life throws a wrench into your car tire. Saving money is necessary. Blowing it all and wondering how you're gonna eat next week is pointless drama you've placed upon yourself. Get a checking account, a savings account, and a retirement account. Even if you only put $10 / week into the thing, AND LEAVE IT THE HELL ALONE, you'll likely have a nice rainy day fund when the shit hits the fan. \n\nLiving in a fire-prone region? make sure you have proper equipment in case wildfires become too dangerous. Earthquake kits, first aid kits, bottled water, blankets, etc. \n\nIf you don't live in a place with reliable mass transit, best make sure you have a car that's in good working order. In that car, ensure you have a fresh spare tire (replace tires every 5 years, unless otherwise indicated by professionals). Know how to change a tire: loosen those lugnuts FIRST, then jack up the car, remove tire, replace tire, tighten lug nuts with wrench, lower the car SLOWLY AND SAFELY, finish tightening lugnuts, etc. Know how to bleed brakes (get a friend to help). Replace wipers and fluid before the rainy season as needed. SO much car care is necessary, going back to point #1.\n\n&nbsp;\n\n#6. Kissing ass and networking are IMPORTANT.\n\nIf you think you're going to have a *remotely* successful life, you're going to be kissing a LOT of ass. It doesn't mean completely shoving your nose up someone's ass, but sometimes it might. If you are regularly on someone's radar in a good way, especially someone with an inkling of power, you're going to be one of the first people they think of for a promotion or raise or relocation to an exotic land. You're going to have to wear a lot of \"masks\" when you're around various people. Or you could just become like me and avoid that, keep your \"self respect\", and be poor and ignored. \n\nI was \"discovered\" last year. Like, legit. I was on a podcast with a coworker (I was the interviewee), and **an executive producer of one of the nation's largest morning shows** heard the podcast. He found me a month later, talked to me, and helped me get started. He gave me a lot of advice that I never used (regarding kissing ass, etc.), because I'm a fuck up. After a month, he dropped me, told me I needed to \"be my own cheerleader\". Coulda been a host on the radio in Los Angeles, but I'm not.\n\n&nbsp;\n\n#7. Hard Work & Luck.\n\nLuck starts your journey, hard work continues it. Anyone successful who doesn't say they are lucky (or outright refuses to acknowledge it) are not people to look up to. [Survivorship Bias](https://xkcd.com/1827/) is a huge factor. If you look at all the people who've worked hard and were successful, and then found everyone else who did similar, but aren't successful, you can factor in luck for the successful. Every. Single. Time. This [Veritasium video](https://www.youtube.com/watch?v=3LopI4YeC4I&vl) better explains everything.\n\n&nbsp;\n\n#8. \"No man is an island.\"\n\nYou can't do this alone. Everyone who gets anywhere in life is doing it with the help of others. They could be supportive parents. Friends who love them for who they are. Teachers that see the possibilities. Employers who see growth. Coworkers that empower their workday. Baristas at the coffee shop with a smile. Strangers on the train who hold the door for 1 extra second (don't go nuts on this one, people, there's a threshold). If you are surrounded by supportive and loving people, life, in all its difficulties and flaws and foibles, will become much less work. \n\n&nbsp;\n\n#9. Life is a game.\n\nIf you don't play, you lose. If you don't play by the rules, you lose. If you don't play well with others, you lose. No matter how much you want it or not, you're in the game. You have no choice. And your only opponent is you. Goes back to #6, and ties in with #8. And despite how shitty the game is, again, if you choose not to play, you will reap zero rewards. You might get a ball to the face, too.\n\n&nbsp;\n\n#10. Iroh\n\n[\"While it is always best to believe in oneself, a little help from others can be a great blessing.\"](https://www.youtube.com/watch?v=jZZXAvHySQ4)\n\n&nbsp;\n___\n\n#I have failed at all 10 of these points. Don't be like me.\n\n&nbsp;\n___\n\ntl;dr - read it anyway. I just gave you multiple summaries of life. I'm not summarizing my summaries, dammit! Now go out there, try to have fun, and try to find some meaning.",
                "labl": 44,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Spelling matters.",
                "labl": 120,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Boston- Boston",
                "labl": 5452,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Gorillaz: Demon dayz. Outkast: Aquemini.\n\nEdit: Apologies if I did this wrong.(I'm bad at the internet.) But thanks for all of the votes and awards!\nMusic is an art form and subjective so none of these posts are wrong and I found some good ones on here! \n\nIf I had to round out my top 5: Beck: morning phase(anything he does is amazing.) Daft punk:Homework and R.E.M: Automatic for the people.\n\nI have to show my fellow gamers some love as well.\n\n Mega man 2&3, borderlands 2&3(could sit in the main menu just for the music.)Hollow Knight,Metroid Prime, and Zelda: A link to the past.\n\nMuch love to the internet and have a good day!!!",
                "labl": 4198,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Van Morrison - Moondance",
                "labl": 875,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Incubus-mornibg view",
                "labl": 198,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Pure Heroin - Lorde",
                "labl": 973,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Soundgarden- Superunknown\n\nBlue Album Weezer\n\nTOOL-Lateralus, Aenima\n\nThe Miseducation of Lauryn Hill\n\nHerbie Hancock Thrust\n\nCrystal Method- Vegas\n\nBeck- Odelay, Guero, Colors\n\nNIN- Pretty Hate Machine, The Fragile\n\nA Perfect Circle Mer de Noms\n\nNirvana- Unplugged, Nevermind, In Utero\n\nNeon Indian Psychic Chasms, Vega International\n\nQueens of the Stone Age Songs for the Deaf\n\nTame Impala-Lonerism, Innerspeaker, Currents\n\nSpencer Brown Illusion of Perfection\n\nBeatles - Revolver, Abbey Road, White\n\nEDIT:\nNightmares on Wax: Carboot Soul\n\nEasy Star All Stars-Dubber Side of the Moon\n\nBonobo-Black Sands, Dial M for Monkey\n\nBoards of Canada: Dayvan Cowboy\n\nScientist- Scientist Rids the World of the Curse of the Evil Vampires\n\nVisit Venus- Music for Space Tourism vol 1\n\nThievery Corporation-Mirror Conspiracy",
                "labl": 407,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Riot! by Paramore",
                "labl": 607,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Super Hexagon\n\nPapers please",
                "labl": 1376,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    }
]