[
    {
        "correct": [
            {
                "sent": "We’d be like, “No way!” and he’d be like, “Yahweh.”\n\nedit: holy shit, y’all are making my day",
                "labl": 20046,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I would be converted\n\n\nEdit: thanks for the upvotes and awards guys!=D",
                "labl": 6577,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "You'd have different religious factions arguing that they're right and the other is wrong\n\nOh wait",
                "labl": 15158,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "For those who aren’t aware, tonight is the start of the jewish new year. There is an old, old tradition that at this time of year God “opens his book”. During the days between the new year and Yom Kippur, Jews pray for atonement and pledge to do better in the following year, and on Yom Kippur God enters the names of those who have truly atoned in the  book, and seals it for a year. Those whose names are sealed will live for at least another year. So for someone to die on the very last day of the year means that God judged that person very highly. It’s an old story/tradition from the Middle Ages and I doubt anyone literally believes this now, but it seems like the perfect ending to her life.",
                "labl": 1059,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "she seemed like she lived a fulfilling life. R.I.P.",
                "labl": 105,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "With the Republican's having the Senate majority required to seat a new supreme court justice,  what things could prevent Trump from picking the next justice?",
                "labl": 273,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "We took back the cities, but it's in our minds that any day could be the day that we need to pick up our whacking sticks to defend our bbq retreats from another invasion.",
                "labl": 7832,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "After months of negotiations the Koalas and Kangaroos are now our allies.  We had to give the Kangaroos half of Sydney as part of the terms.  The large emus left in Sydney are ostrichsized.  Some of them are emuvable.",
                "labl": 18090,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Eastasia has always been at war with Emunation.",
                "labl": 805,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Currently in the \"Green zone\", otherwise known as Tasmania. Everything is back to normal life now. Things got scary for a little while but our premier looked after us. Got our boarders shut down early and its paid off.\n\nEveryone knows that emus cant fly over the Bass Strait so we knew that would be advantageous in our victory against the feathered folks. But the rest of Australia, known to us Tasmanians as, The Mainland has never fully recovered. Recent reports are showing they have some form a plague there at the moment. Horrid stuff. Onwards and upwards. The fight against the feather never ends!",
                "labl": 690,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I used to work for a super cunty manager when I worked at McDonalds. This guy was horrible to us. He was constantly bullying us, shit talking us TO CUSTOMERS, and doing everything in his power to make us miserable. Well, so many people complained about him that he ended up getting fired. \n\nNew manager was great. He was super chill and understanding with us all. A couple weeks after he took over, the old douchebag comes in and starts talking about how terrible the store looks, how our service is shittier than ever, and how much this store needs him. The new manager looked at him and said \"If you don't leave, then the cops are gonna make you\"\n\nWhen the douchebag didn't move, new awesome manager stuck to his guns and called the cops. The douchebag is no longer allowed on ANY McDonalds property in the city and has a restraining order against him.",
                "labl": 1328,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, this might be a long one.\n\nI grew up around a mother with dissociative disorder as well as narcissism. She was addicted to opiates as far back as I can remember, and would do anything to get them, and I mean anything.\n\nGrowing up, it wasn't rare for her to have a tantrum during one of her highs and beat the shit out of me, break me down by picking apart every little thing she knew I was afraid or self-conscious of, and actively sabotage my relationship with my father and siblings.\n\nShe would be up for days at a time, pass out standing up with her eyes glassed over and back hunched, and when she festered once again start moving and otherwise destroying everything in the house.\n\nThere were times where I'd leave and the house would be clean, and come home and it would look as though a pissed off tornado had run through the house i.e. broken glass, animal feces, dirty clothes, roaches, empty pill bottles, ground-up pill residue, and other miscellaneous things littering the house. On particularly bad nights she would hallucinate, and during those times it wouldn't be uncommon to find pools of her blood on the ground from running through glass.\n\nI remember being up for days at a time because her and my father would scream at each other for days at a time without stopping; actively trying to get me to pick one side or the other even if it meant barging into my room at 4 am to begin their screaming match where I could watch.\n\nShe manipulated me, abandoned me at times in the middle of nowhere when she'd meet up with her various sugar daddies (she was still with my dad during this), and never once apologized during her brief moments of mental clarity. If anything, she would blame everything but herself. In her mind she was infallible.\n\nMoney was always a big issue since she couldn't work in such a state. She sold some of her pills, yes, but ultimately those funds were used to buy more drugs anyway. Because of this, we were homeless frequently, without power and water for literally years at a time, and barely ever had any food. It was almost every night I went to sleep with the only thing I'd have eaten that day being a school lunch. On weekends, sometimes I didn't eat at all.\n\nThe rest of my family had no clue this was happening. During the summer when I was 16, my aunt whom I hadn't talked much with since I was a lot younger got in touch. She asked if I'd like to come to stay with them in Texas for a few weeks during the summer.\n\nOf course I said yes, and I was absolutely ecstatic. I didn't bother asking my parents since I'd be very much surprised if they even noticed I was gone so they were unaware. My aunt drove up all the way to Iowa and stayed the afternoon with us.\n\nMy parents seemed to lack the cognition to recognize she was even there out of the blue so they didn't come out of their room. As I stated before would happen frequently, when she arrived our house was fairly clean. We left for a bit to go get food, and when we returned the tornado had already passed.\n\nAs she told me when we were on our way to Texas: the thing that bothered her the most wasn't that our house had suddenly gone to hell, it was that I didn't even react to it. Instead, I tiptoed around the debris and started packing my things without a word.\n\nThis deeply unsettled her, and ultimately she asked me if I was safe where I lived. I said yes, as it was all I had ever known. She told me that what she saw frightened her, and she wanted me to come live with her in Texas. Thinking that she was joking, I brushed it off. After a few days down there though, I knew I had to do it. They showed me love, compassion, and care that I'd never even known existed prior to this and it shook me to my core.\n\nSo we decided, I was going to get emancipated from my parents and move in with them. Ultimately, this involved sitting in a courthouse across from my parents and their lawyer.\n\nThe judge asked why I wanted to leave, and I explained the above. I expressed the love and compassion I'd experienced for the first time in my life, and that I wanted to, for once, live in peace.\n\nTheir lawyer rebutted, \"To me, it seems as though you have no respect for your parents. Is it because of their financial situation? It looks as though you're attached to the perks of living in a family that makes a reasonable amount of money, and not that you want to leave because they're unfit parents.\"\n\nMy mother and father joined in, hooting and hollering actively trying to break me down as they have so many times before.\n\nI let him speak, I let them speak, and I held my tongue until it was my turn. They tried to goad me on, tried to break me as they had so many times before, but I wouldn't let them.\n\nFinally, the judge asked me to speak.\n\nWith as level a stare as I could muster, I looked at mother, my father, and their lawyer across from me and said \"If you're asking me if I have no respect for my parents, then you are correct. However, to say it's simply financially motivated is incorrect. I no longer have respect for them because they have-\"\n\nAs I was nearly finished, my mother, as she had so many times in the past began to squirm and scream at me from across the table. \"HE'S LYING THE LITTLE BASTARD IS JUS-\"\n\nUntil the Judge slammed his gavel down and cut the room; my mother staring up at him in complete and utter disbelief.\n\nI looked at her, keeping the tears I knew were right behind the corner at bay and said, \"For once in your life; for once in my life, behave as an adult. You can't stop me by simply yelling over me anymore, you have nothing to hold over me now. You can do nothing.\"\n\nAs I spoke, the judge motioned to his officer who moved towards my mother. Her expression still frozen in complete bewilderment as the officer aggressively told her to get up out of her chair and escorted her out of the room.\n\nThe judge looked to me, my aunt, my father, and his lawyer with one sweeping glance and then spoke.\n\n\"I am sorry that you have had to deal with this for so long young man. There's nothing more that you or anyone else needs to say. You deserve to live a normal life as a normal kid and it's obvious to me now that your parents are unfit to produce that kind of environment. You will go back to Texas with your Aunt, and we will regularly have our social workers in touch to check in on how you are doing. Make the most of this second chance, good luck young man. Adjourned.\"\n\nThough the bang of his gavel was the only noise that permeated the room, all I could hear was the ringing in my ears. My father and his lawyer were escorted out of the room and the tears I had held back all this time came gushing out like a tidal wave.\n\nIt's been 7 years since that day and I am happy to say that I've managed to grow up and become a well-adjusted adult. I have a great career, great friends, and an amazing girlfriend. I've been in therapy ever since we got back to Texas, and I no longer have trouble sleeping or terrible bouts of anxiety and depression as I used to.\n\nLife is good.\n\nTl;dr:\n\nMother is a narcissist with dissociative personality disorder addicted to opiates. Father kind of just went with the flow and didn't really do much. Aunt came down to take me to Texas, saw how shit everything was and asked me if I wanted to live with them. After some time I said yes, went to court against my parents under the pretense of emancipation, and got to stare them down and layout all the trauma, pain, and fear they've caused me. My mother was escorted out of the room when she tried to cut over me, and the judge sided with us and I was emancipated. Now I'm doing really well.",
                "labl": 631,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "ex and i were moving out after a breakup. cleaning out garage. she was being critical of my post-breakup plan of moving in with a coworker until i could find a better place to live, as most options weren't great.\n\ni took a deep breath and laughed. this puzzled her. why are you laughing, she asked? i collected myself and said \"because this is the last time i have to listen to this. you don't get to be critical of anything i ever do, ever again!\"\n\nit was a really great feeling, because i literally thought of the \"you have no power here\" as i laughed.",
                "labl": 934,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Pretty much every time my in laws come over. For over twenty years they have attempted to dictate how I should live my life, raise my kids, dress, cook, etc. I always just nod and say,\"I'll consider that\", but not in a genuine way, in a condescending \"fuck you\" way. When they press it, I simply say, \"You may leave my house now\".",
                "labl": 3435,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I had a short stint as private investigator who specialized in providing investigative services to public deffenders.\n\nWe had this one county that was notorious for a sheriff's department that would make BS traffic stops as a pretext to search vehicles. One deputy in particular came up time and time again for this kind of thing.\n\nI was asked to interview this deputy for a defense attorney. Deputy had some of the worse report writing skills I've ever seen. Riddled with grammar and spelling errors. Quite often, deputy wouldn't even include the reason he pulls people over in his reports. \n\nSo I go to interview the guy. As part of the process, there's a senior sheriff's rep there that basically is suppose to protect deputies from people like me and keep them from saying things they shouldn't. \n\nWe sit down and I pull out his report he wrote on the stop he made on my client's defendant.  I've already marked it up, English teacher style with a red pen and start with, \"I had some trouble understanding your report.\" I proceeded to go error by error for the purpose of \"clarifying\" the report. He's getting redder and redder. I then go into trying to determine why he pulled over the defendant because it's unclear in the report. He's not able to give a definitive response.\n\nAll the while, the sherriff's rep, whom I've worked with a lot and who I have seen be very vocal protecting deputies in interviews like this in the past, is silent. Ultimately, charges against client are dropped.\n\nMonths later, I'm driving through the area on the way home from camping, not speeding or breaking any traffic laws. I get pulled over by a deputy. It's the same deputy. He recognizes me immediately, stammers and manages to say, \"Uhhhh, it's almost dusk, turn on your headlights.\" He gets back in his vehicle and takes off before I've even started my engine.",
                "labl": 158,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My ex was a narcissist and I had learned to basically walk on eggshells in our relationship to try to keep the peace. We had two kids and I was a stay-at-home dad who did more than 90% of the parenting. One of the tactics I used with our kids was counting to three when they were behaving badly, and if they hadn't shaped up they would go to time out.\n\nCue forward to our divorce; she had manipulated the courts into granting her educational decision making for our kids and enrolled them in a school far from me and close to her. I began volunteering at the school to help in class to give me more time with our kids. She called to tell me that she had made the executive decision that I couldn't do that anymore. I told her she had no right to make that decision. She pulled out the education decision making card, and I told her that gave her no right to tell me what to do on my own time. She started ranting and wouldn't let it go; she had grown accustomed to me just giving in and I wasn't doing that anymore.\n\nShe started getting really angry and yelling. Without even thinking about it, I just said, \"One...\"\n\nShe paused for a moment and then started into it again. I said, \"Two...\"\n\nBy that point she got what I was doing I think, because she took a breath and started a bit more calmly, but then she got to yelling again and I said, \"Three.\" And I hung up the phone.\n\nShe immediately called me back and I ignored the call. She kept trying and I kept ignoring it. Ten minutes later I called her back and we started talking again. She didn't yell, and of course I kept volunteering at my kids' school because I'm a good dad, dammit.",
                "labl": 423,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I once had a boss try to give me a disciplinary (three months later I may add) for my behaviour as it was noted I was 'rude to her' by several of the Groups CEOs in a Board meeting. \n\nOn the disciplinary forms, you both have to write your version of the events and it goes to HR for an adjudication, she did her part and I casually filled in something to the effect of \"manager continually pressured me into deleting files from our client management system prior to a regulatory audit which is against the ethical code of our profession and not aligned with my moral standards, I accept I was short with her but she was trying to force me into performing an illegal activity.\"\n\nI watched her collect up the paper and the colour drained from her face. I never did hear from HR.  \n\nShe got fired not long after when I casually mentioned to the CEO in a bar if she remembered the encounter and explained why I may have appeared a little frustrated and upset. Bye Felicia.",
                "labl": 131,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Just last week we had another supervisor from a different department come and tell us what he needed(not uncommon in my job) like \"oh I need this by this date\" but we're super swamped right now and my coworker said \"oh we can probably get to that next week because we are working on another project\" and the supervisor said \"this needs to be done now\" and my coworker said \"we'll do it in 3 weeks, sorry!\" And there's really nothing the other supervisor can do.",
                "labl": 654,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "One of the managers at my previous employer was living near me. I was not reporting to her, but my manager was sitting right next to this woman so I had to see her multiple times every day. One day she found out that I lived on the same street as her, and started forcing me to visit her. I kept making excuses, but at one point I couldn't come up with any more excuses. \n\nSo I visited her. She sat me down and asked me why I was renting a house by myself, what caste my room mate was, and told me not to have \"lower caste\" people room with me, all the while subtly trying to find out what caste I was. I hated her. I couldn't really do anything about what she spoke because the HR was not even taking sexual harassment complaints seriously, let alone this one. \n\nAlso it turned out, my apartment's owner was friends with this woman and she had a spare key to my apartment that she stored on behalf of the owner who lived abroad. If she found out that I was in a relationship with someone not from my caste, then she could tell the owner and they could have kicked me out for being sinful in their house.\n\nIn few months, I found a better job and I gave my notice at that workplace. I was also getting married in few weeks, so I was moving out of that house. Although I didn't expect anyone from that office to attend my wedding (my wedding was held in a different state), it's kind of disrespectful in our culture if you don't invite everyone you know. It was my last day in that organization, and I was going around giving wedding invites to everyone. \n\nWhen I went over to my manager's desk, this lady was all smiling and waiting to get the invitation next. I simply invited my manager, then smiled at this woman, and walked away. Also, I invited everyone in my apartment except my house owner who specifically requested that I mail her my invite. My house owner called me after I vacated and asked where the invite was. I told her that I forgot and didn't have any left.\n\nBoth of them didn't hold any power over me anymore and both my employment and my housing situation were not in their control so they could really do nothing about me disrespecting them.\n\nThis might not be much, but it felt so good when I did it.",
                "labl": 351,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I had a guy check my laptop, but it came back to me fixed without my consent, and he was trying to get me to pay 6x the usual rate of what he did.\n\nWe were mediated by a local government official to see if we could resolve this among ourselves. He was spewing lies about me asking him to proceed with fixing it but I saw his face turn pale as I showed everyone there the pictures of our messages indicating otherwise. I even did a little research on the laws he violated and recited it to everyone.\n\nI finished it off by saying I am willing to spend three times more than what he's asking me just to see justice come through and I heard him whimper a bit.\n\nHe ended up returning my laptop and didn't ask for anything. \n\nDefinitely had no power there. I'm still quite proud of myself.",
                "labl": 252,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My first job was at the box office of a movie theatre. The rule was you had to be 18 to see a Rated R movie but you could go see if a parent/guardian was somewhere in the building seeing a different movie. A mom tried to buy tickets for her daughter and friends to go see one. I explained the rules and she was enraged. She demanded to see the manager who explained the rules and refused the sale. Finally, she tried to claim that the sale should happen because her husband is a doctor. I just laughed.",
                "labl": 315,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "What if Satan came down one day and said ''It's pronounced 'Zlatan' then left?",
                "labl": 5263,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "God isn't really a name though.",
                "labl": 117,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "God is just a title to signify his level of power, his proper name is different depending on how you believe. Jehovah, Yahweh, Allah, Zarathustra, etc.",
                "labl": 11,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "There's a lot of disrespect in this thread, and would it be too unreasonable to have more reverence to this comments in this post?\n\nRegardless of what side of the aisle you support, this was an intelligent, resilient, and wise woman. She gave judgments that benefited both sides and fought hard so she could retire peacefully and dignity. \n\n40 years serving from the bench and she battled cancer 5 times, people. There's no reason to fight her spirit now too.\n\nNo matter which party you support you can admire her spirit to show up and deliver sound judgments. Give credit to her will to fight for liberty for all. She was not infallible; she was human. Like you she made mistakes. \n\nIt's been 10 years, she served the US well and I hope she will meet he husband again. RIP.",
                "labl": 2771,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Pretty brutal really. My dad was attacked by an emu once. He is bald and his head is a little shiny. he was sitting on a bench at a wildlife park and The emu must have been attracted to the shiny reflection, snuck up behind him and bit his head. I have never seen someone jump so far in one leap before or since. As a child this traumatised me a little and now I am pretty uneasy around all kind of birds.",
                "labl": 27325,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "You laugh but having run into these fuckers in the wild I tell you, they would kill you and everyone you love.",
                "labl": 340,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I grew up with my parents having screaming arguments over every little thing (they do love each other - over 50 years of marriage so far testifies to that) and it always upset me.\n\n\nA couple of days ago, they popped into my house to visit for a coffee on their way to stay with friends a few miles away. Within minutes, they were yelling at each other.\n\n\nI took great pleasure in telling them that I would not stand for such behaviour in MY house and, if they didn't lower their voices, they could stand outside until they learned some manners.\n\n\nThe meek apologies tasted so sweet. As did the coffee.",
                "labl": 407,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Betty White and Keith Richards. I assume they'll both be alive but I want to know for sure.",
                "labl": 9799,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "My son to make sure he's still alive. He's chronically suicidal and should be on his own by then. I worry about it.",
                "labl": 6654,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "How long does it work for? If it is permanent, lottery numbers once or twice anymore and you would draw attention.then best tech developments and start ups to invest in. Locate the brightest and smartest graduates to come and work for you and enough dirt on politicians to let you get away with what your planning.",
                "labl": 14,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "With the high cost of medical and dental, that's even better than sex.",
                "labl": 15896,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Not exactly answer to the question but still related. When we came to call about \"broken doors\" we was not expecting that someone for some unknown reasons stole one half of elevator's door.",
                "labl": 113,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "OP:  genuine interesting question.\n\nReddit : **P U R P L E .     D I L D O.**",
                "labl": 765,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Rage Against The Machine - Rage Against The Machine",
                "labl": 2165,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "De-Loused in the Comatorium — The Mars Volta\n\nRecorded in a way that there are no pauses in between each song.\n\nEdit: Wow this blew up! I’m so glad there are so many At the drive in / The Mars Volta fans. Hopefully some new fans came out of this as well!!",
                "labl": 2444,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Unplugged in New York- Nirvana",
                "labl": 4973,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Back to Black - Amy Winehouse",
                "labl": 3118,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Jewel - Pieces of You\n\nNo Doubt - Tragic Kingdom\n\nAlanis Morissette - Jagged Little Pill\n\n\nWhen I was eleven these were the first 3 cds I bought.  I thought buying CDs meant that every song was gonna be awesome.  Three weeks later I bought Chumbawumba - Tubthumper.  What a rude awakening",
                "labl": 2035,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Kate Bush - Aerial\n\nMika - Life in Cartoon Motion\n\nVampire Weekend - Contra\n\nTalking Heads - Speaking in Tongues \n\nStromae - Racine Carrée \n\nTaylor Swift - 1989\n\nSufjan Stevens - Carrie and Lowell\n\nThe Avalanches - Since I Left You\n\nLorde - Melodrama \n\nKacey Musgraves - Golden Hour",
                "labl": 363,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "The Simpson's: Hit And Run",
                "labl": 2628,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Dragon Age 💛",
                "labl": 121,
                "true_bin": 1,
                "pred_bin": 2
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "GTA VI release date",
                "labl": 7517,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Like a fax from future me?\n\nDo not drink that coffee!",
                "labl": 871,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not a teen movie, but Father of the Bride.\n\nWatching it as a kid, Steve Martin seemed like an old grump.\n\nRewatching it as an adult, holy shit he is the only sane person in that movie.",
                "labl": 2739,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Learn a second language. It's good for your brain, and it's a lot easier when you're young.\n\nGet active and fit; make it a habit. This is one of the most important ways to stave off cognitive decline as you get older. Plus, it's great for managing mental health during the transition to adulthood.",
                "labl": 885,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "You don't matter. \n\nI don't matter.\n\nNone of us matter.\n\nKill your ego, feed your soul.",
                "labl": 449,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "LUV VS. The World",
                "labl": 134,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "This is a little more niche, but Bill Wilson, the founder of alcoholics anonymous.\n\nThe guy did great things, and created a program of recovery that has saved millions of lives since it's inception 85 years ago.\n\nHe was also an arrogant ass hole that cheated on his wife even in sobriety.\n\nEdit: This isn't here to scare away anyone that's trying to get sober. I've been sober thanks to AA for 5 1/2 years. So don't let this keep you away if you're struggling with your drinking.",
                "labl": 13565,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Being an adult is basically being a teenager, except you're finally in charge of your own life and decisions.\n\n\nI hated being a child / teenager. I love being an adult.",
                "labl": 533,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Bill didn’t cheat on Hilary, they have an “open marriage” where they can do what the want whilst travelling around for work.\n\nReason for the infidelity lie? It’s easier for the American population to accept a president making a “mistake” in fidelity than to accept a swinging President/First Lady.",
                "labl": 316,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Just a casual fan of this one but that Christopher Walken knows whether Natalie Wood's death was an accident or not.",
                "labl": 9147,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The American Government wants to keep us poorly educated and unhealthy.  Just enough to be too busy to stand up for ourselves.",
                "labl": 4356,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Talk like a goofball to my kids. Read in silly voices. \n\nBack when I only had one kid, I wasn't even comfortable doing it when I was home alone with him. Now I can be silly at the store, in front of strangers with my kids.",
                "labl": 171,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My boyfriend woke me up the other day by gently putting his fingers in my mouth and I kept moving my head out of the way until eventually I was like “can you stop that!!!”\n\nHe then sounded genuinely upset and asked why I woke him up as he was having a really nice dream about feeding a deer. Brilliant.",
                "labl": 5040,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My partner was asleep, and I was reading in bed. \n\nHim mumbling: The farters.  \nMe: The farters?  \nHim: The farters are farting. Prepare yourself.\n\nCracks me up every time I think about it.",
                "labl": 569,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My sister talks in her sleep.\n\nOne time she \"woke up\", looked at me and asked me in a really hurt tone \"Why did you do that? That was so mean of you. How could you?!\" \n\nI was super confused and worried that I've actually hurt her somehow and wanted to get details out of her. \"What do you mean? What have I done?!\" \n\nShe just ignored me and showed me the cold shoulder...and fell back asleep again. \n\nI worried the whole night what she meant. Have I really done something?! \n\nI asked her the next morning and she couldn't remember at all.",
                "labl": 476,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I once asked my boyfriend if he could make some coffee way before wake up time. He happily did so, only to have me (now awake) tell him that it's way to early for coffee and ask him why he would do that.\nHe was a bit annoyed at first but after we found out what happened, we had a good laugh about it.\nSometimes we have whole conversations that I have no memory of. ^^",
                "labl": 411,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My old ex rolled over one night after she'd fallen asleep and just giggled and said \"I just made like a PILE of bodies.\" And then rolled back over and went to sleep. I was concerned.",
                "labl": 264,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Pretty late to the party so I guess nobody reads this. But I have got something! \n\n\nWhen working at a beach house years ago, I shared a room with a collegue. He was a sleepwalker, mostly after a couple of beers. \n\nFirst time this happened, he just stood up, openend and closed the water tap a couple of times and went back to bed. He didnt know he did that.\n\nSecond time, it was longer. He walked around, did the water tap thing again, then went outside to take a piss on the porch, dick facing every other person on the camping around 8:00 in the morning. \n\nThird time we both didn't wake up. However, we woke up to the floor being wet. We looked at each other, tried to smell if it would be water or piss, but assumed it was water as we could not smell anything. \n\nFourth time I woke up to a very heavy weight atop of me. After his sleepy stroll he went into my bed, that I was sleeping in. I woke him up and saw him VERY confused: \"Justice171, WHAT THE FUCK am I doing in your BED?!\"\n\nHe had slepwalked a couple of times when I was out of the house, times which he more often concluded by ending up in the wrong bed (they were right next to eachother)\nGood times though, thought it was hell of funny.",
                "labl": 122,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I'm the sleep talker. \n\nIn college I shared a dorm. Two beds. \n\nOne night while my roommate was reading. I apparently got half out of bed, took my shirt off, made a stance like I was about to do pushups under the covers and asked him \n\n\"Would you like to buy some hot dogs\" \n\nThen I went back to sleep lol",
                "labl": 107,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Talking Heads, *Remain in Light*",
                "labl": 6697,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The firsts pokemon mystery dungeons (The 2 is my favourite) and the olds pokemons games",
                "labl": 8349,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "He would also say, “my name isn’t God” then he would pronounce his name and everyone’s faces would melt.",
                "labl": 6449,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "A co-worker friend of mine was flying back from a sales conference in Vegas and he was able to upgrade to a first class seat.  We had this bitch sales VP that was on the same flight - she was the snobby, entitled type with a full time nanny and giant McMansion in the suburbs, and she generally treated people who worked for her like servants.\n\nShe sees him in a first class seat as she is making her way to coach and asks him how he got that seat (he used points to upgrade).  As people are getting settled in, she makes her way back up to the first class cabin and asks to speak with the lead flight attendant.  She tells him that one of her underlings is sitting in first class, and that she needs to switch with him since she's higher on the corporate ladder.  \n\nThe guy can't believe what he's hearing, but she won't take no for an answer.  Finally he tells her she has to go back to her seat, or she will be escorted from the plane.  She made a complete ass of herself in front of the whole first class cabin.",
                "labl": 42116,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I'd try to be like Bill Murrays character by the end of Ground Hog day. Find out if there's any needless deaths from preventable accidents that I may be able to change. Obviously I'd have won the lotto too, this would give me plenty of resources and free time to become a local superhero\n\nEdit: based on the show Early Edition from the 90s.",
                "labl": 14173,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Minecraft cave update",
                "labl": 7643,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I search porn to see if the industry has gotten over its step-family obsession",
                "labl": 12533,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Ez. Stock market. And not tell any-fucking-one.",
                "labl": 1553,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I want to fuck a ghost",
                "labl": 8952,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Not a movie but Hank from King of the Hill.\n\nI find myself saying “that’s asinine” more and more with each passing year.",
                "labl": 13913,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Twilight. Charlie was trying so hard to keep Bella comfortable, all while having to deal with A LOT of weird stuff happening around the city with little to no real information",
                "labl": 3404,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "\"being Infront of that damn computer won't get you a job\"",
                "labl": 518,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "When you get to driving you need to realize that the laws of physics apply to you.  They aren't out to get you, they're just indifferent.  Slow the fuck down and don't horse around, you're driving a very heavy machine at speeds we did not evolve to deal with.  Be safe.",
                "labl": 12106,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Arcade Fire - Funeral",
                "labl": 1922,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "The Downward Spiral: Nine Inch Nails",
                "labl": 4508,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Boston- Boston",
                "labl": 5452,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Gorillaz: Demon dayz. Outkast: Aquemini.\n\nEdit: Apologies if I did this wrong.(I'm bad at the internet.) But thanks for all of the votes and awards!\nMusic is an art form and subjective so none of these posts are wrong and I found some good ones on here! \n\nIf I had to round out my top 5: Beck: morning phase(anything he does is amazing.) Daft punk:Homework and R.E.M: Automatic for the people.\n\nI have to show my fellow gamers some love as well.\n\n Mega man 2&3, borderlands 2&3(could sit in the main menu just for the music.)Hollow Knight,Metroid Prime, and Zelda: A link to the past.\n\nMuch love to the internet and have a good day!!!",
                "labl": 4198,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Songs for the Deaf -Queens of the Stone Age\n\nRed Headed Stranger -Willie Nelson\n\nIdk if it counts cause it’s a sort of greatest hits but Alice in Chains Unplugged is the greatest unplugged set ever recorded and the best greatest hits album ever put together, fight me.",
                "labl": 6688,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Incubus-mornibg view",
                "labl": 198,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Oregon Trail comes to mind...",
                "labl": 13280,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Super Hexagon\n\nPapers please",
                "labl": 1376,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Not necessarily a \"good guy\", but got lots of positive attention from the release of the Greatest Showman- apparently PT Barnum was a terrible person in real life",
                "labl": 52721,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Alexander Graham Bell! \n\nThis man did not invent the telephone. Several people were working on similar technology at the same time. Antonio Meucci invented it first, but there was a court case over who got the patent rights. Meucci died before the case was settled, and Graham Bell won the glory he didn't deserve.",
                "labl": 9935,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    }
]