[
    {
        "correct": [
            {
                "sent": "We’d be like, “No way!” and he’d be like, “Yahweh.”\n\nedit: holy shit, y’all are making my day",
                "labl": 20046,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I would be converted\n\n\nEdit: thanks for the upvotes and awards guys!=D",
                "labl": 6577,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "“They are illusions Michael! A trick is something a whore does for money”",
                "labl": 691,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Then we can be divisive on a whole slew of new things!\n\n\nWas that really God?\n\nIt's a hoax!\n\nWho made God leave again?\n\nI bet it was the liberals! They drove god away!\n\nJod was talking to me in particular!  Only I may refer to him as such!\n\nWe have to Murder anyone who dare says it with a hard \"G\"! Its Jods will!",
                "labl": 2210,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "As someone not in the US, can someone explain the implications of this and why this is such a big deal? Thanks in advance",
                "labl": 179,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "With the Republican's having the Senate majority required to seat a new supreme court justice,  what things could prevent Trump from picking the next justice?",
                "labl": 273,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Rip",
                "labl": 9,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "We took back the cities, but it's in our minds that any day could be the day that we need to pick up our whacking sticks to defend our bbq retreats from another invasion.",
                "labl": 7832,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, for starters, my area was stolen from the emus when we drove them off the land, we've built a fine community in its place. The emus have yet to take this land back, until then, I have yet to see a wild emu anywhere near here.\n\nIf it were not for the war, I wouldn't be where I am today.",
                "labl": 1575,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "People dont really think about it. We are all preoccupied, watching in horror as our rebel kangaroos conquer Uruguay.",
                "labl": 442,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Eastasia has always been at war with Emunation.",
                "labl": 805,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "You laugh but having run into these fuckers in the wild I tell you, they would kill you and everyone you love.",
                "labl": 340,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Australia has bigger problems surely? they’ve been at war with the sun for almost ever.",
                "labl": 160,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I was in Aussie at Christmas. Holy fuck everything was on fire and now I hear people in Melbourne can't even leave their houses.",
                "labl": 860,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The first time I had dinner at my parents house after I got my own apartment. My dad was giving me grief as usual. Finally, I stood up and said, “ I don’t live here anymore. I don’t have to put up with you this way any longer. I’m going home.” \n\nAnd walked out. \n\nMost liberating moment of my life.",
                "labl": 1264,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A while back, I got a job as a popcorn monkey in the local cinema, as a temporary thing while I figured out what the fuck I was doing with my life.\n\nThere was a supervisor that had worked there since the site opened (around 5 years) who was a total bitch and had had numerous complaints about her from countless staff.\n\nIn the first week, I nearly quit because of her attitude - as an example one night I was on a close, and basically cleaned the entirety of the front of house on my own. I stopped to take a drink of water and she marched up to me going \"WE DON'T PAY YOU TO STAND AROUND DRINKING YOU KNOW!\" to which I calmly responded that I was thirsty, and needed a drink of water, and if she wanted to tell me I wasn't allowed to have a glass of water then good luck, but I'm pretty sure health and safety would have something to say about that. She huffed about not having had a break all day, which I ignored cos not my fucking problem, but internally I was put out about it, because it was totally fucking pointless to be such a twat about things.\n\nAbout 2 weeks in I get promoted to Supervisor as I was clearly extremely competent by their usual standards (I could walk and fart at the same time) but she also gets promoted to Floor Manager, so she continues to work her little power trips and try and lord it over me (and everyone else)\n\n4 weeks after that, I get another promotion to Floor Manager, and at this point we're equals, so she can't boss me around anymore. So instead, she tries a different tack, which is to try and lord it over me with her superior knowledge of processes, where to find stuff etc.\n\nMy response is to go (saccharine sweet) \"Oh thanks! That's so helpful, I mean you know how things work so much better than me, because you've been here 5 years, and I've only been here 6 weeks...\"\n\nShe had a face like a smacked arse. It was delightful :)",
                "labl": 1144,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The guy that i'd gone on a few dates with introduced me to his parents, things went well, or so i thought. \n\nhe drives me home, we end up talking and drinking a few beers, i didn't want him on the road with any alcohol in his system, and i enjoyed his company, so we end up hanging out until 3am. His mom starts blowing up his phone, demanding that he comes home, so he drives himself home to find that he's been locked out of his house. His mom said that he can sleep outside, he shouldn't be spending time with someone like me (still don't know what she meant by that), and that i'm \"just another stop on the pussy train\". He tells her not to talk about me like that, to which she says \"when you're under my roof, i'll say whatever i want about whoever i want!\"  so he picks up his phone, calls me, asks if he can stay at my place for a little while. \n\nIt's been seven years, we're engaged, have a dog, a cat, and a happy life. \n\ni also plan on throwing some subtle train themes into the wedding/celebration after the end of the plague.",
                "labl": 6846,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Some secretary of some branch of a state agency would go on a power trip and stamp, \"Do not copy\" on things that she sent to local agencies. Well, I work for an oversight agency and I needed a copy. Locals were terrified so I rolled my eyes and called to explain that the locals and I were basically the same entity. Woman started to have a conniption fit, but she got real quiet when I cut her off and said, \"Fine, I'll issue a subpoena. What's your name and job title?\" She answered, and the sheriff served her a subpoena for what I wanted. Guess she wasn't used to that.",
                "labl": 4795,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "ooh!!!  I have a story for this!\n\nI got married two years ago overseas, because my wife is from Europe, and they have cool castles and shit.  My (Canadian) family and friends all came over because most had never been.  We're a little older, and well off, so we splurged.\n\nWedding was awesome, dinner amazing, reception is in full swing, and quite frankly, its a little warm.  Warm for us Canadians... It was around 10 C, in Early November.  When you mix in wool suits, drinking, and lots of dancing, some of us Colonists were working up a bit of a sweat.    Thankfully, the venue had a balcony, with huge doors.    \n\n\nI kept going over and opening them, as some folks were inside, some were outside, and there was a nice breeze... but... I had to keep going over, because they were shut whenever I looked back.  \n\n\nFinally, after the 5th or 6th time, this guy followed me, and demanded I keep the doors shut because it was cold inside.  I didn't know who he was, so he must have been a +1 of someone on my wife's side, so I was mighty confused when he said, and I quote \"Who the hell do you think you are keeping these doors open, and the temperature so low inside.\"\n\n&#x200B;\n\n\"I'm the guy who bought you dinner.\"  \n\n\nI watched him go over to my now cousin-in-law and grab his coat and almost pull her out the front door.  \n\n\nI thought one of my Groomsmen was going to burst he laughed so hard.",
                "labl": 169,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I was a registration supervisor in an emergency department. Our manager was out for heart surgery so the manager of a different facility was filling in. She was a righteous cunt who needed everyone to bow to her authority. \n\nDuring a staff meeting she tried to implement a policy that the president of our hospital has specifically rejected. Nothing major, just a process change in how we checked in patients arriving by EMS. This policy worked at her facility but we weren't equipped to implement it. She knew this but thought she was going to force us to do it as a way of showing how it was \"the better way\". After she gave the instructions she said, \"any questions?\"\n\nMy staff all turned and looked at me for a moment, then one of them said, \"is this true, uh-okay?\"\n\n\"No. As you know, we've been told not to do this. Please continue arriving those patients as we have been.\"\n\nThe manager flipped out and tried to write me up for insubordination. Took it to the director who knew we weren't allowed to make this change. He shot her down and dismissed my write-up. It was super validating. It also helped me with my staff because they saw that I wouldn't let them or myself be pushed around.",
                "labl": 369,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A cop pulled me over at 2am on my way home from work.  He was visibly agitated that I wasn't the drunk driver he was fishing for.  I asked him why he pulled me over and he gave me some nonsense about swerving.  I told him no I wasn't.  He walked away, did a 180 and came back with \"Well, if I searched your car right now, what might I find...\"  I laughed at him and told him that there was no way I would ever consent to a search.  He walked away fuming.",
                "labl": 331,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "Yeah, a megathread is probably best for this. RIP to her.",
                "labl": 3795,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Damn. Cancer needed five tries to take her down. It gave her hell but she spat it right back.",
                "labl": 155,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Pretty brutal really. My dad was attacked by an emu once. He is bald and his head is a little shiny. he was sitting on a bench at a wildlife park and The emu must have been attracted to the shiny reflection, snuck up behind him and bit his head. I have never seen someone jump so far in one leap before or since. As a child this traumatised me a little and now I am pretty uneasy around all kind of birds.",
                "labl": 27325,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "My parents were yelling at me and then my grandpa walks over and tells them both to sit the fuck down. They both shut the fuck up and sit their ass down on the couch. It was by far the most powerful thing I've ever seen him do lmao.",
                "labl": 14433,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Is Betty White still alive?",
                "labl": 130,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I never watched it as a teenager, only as an adult but Red Foreman from that 70s show is quite relatable.",
                "labl": 258,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "\"There's plenty more fish in the sea\" won't make any sense.\n\nEdit. This comment doesn't really answer OP's question. I'd delete it but some of the responses are pretty good.",
                "labl": 18008,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Life moves very quickly after leaving school - years go by so quickly\n\n\nEdit: just wanted to say, holy crap, 20k upvotes! I've never had more than 100 before so thank you! \n\nA lot of people have been saying this scares them. Please don't be scared, adult life is great but you just have to keep yourself active and doing different things. Just make sure to appreciate everything you have and try not to have regrets.",
                "labl": 28348,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "The elevator guys in my dad's office complex found pieces of a dog's skeleton. Not the whole skeleton, just random parts.",
                "labl": 12986,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Grace by Jeff Buckley\n\n&#x200B;\n\nThe single most beautiful album I've ever heard. Seriously a masterpiece",
                "labl": 3431,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Yoshimi Battles The Pink Robots- The Flaming Lips\n\nEdit: thanks for all the awards!",
                "labl": 1742,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Cake - Fashion Nugget",
                "labl": 2826,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Baba is You",
                "labl": 8480,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Most of them.\n\nI don't know about other countries, but in America schools tend to put historical figures on high pedestals. It would be better to be up front about how people do good things and terrible things.",
                "labl": 6849,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "The thought that any of my students might look at my desicion and choose to follow in my footsteps. I could accept my own death, but I couldn't stand the idea of theirs.",
                "labl": 26963,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "The thought that anyone I cared about would think it was their fault and they would have to live with guilt. Didn’t want that for them.",
                "labl": 161,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "“They are illusions Michael! A trick is something a whore does for money”",
                "labl": 691,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "People's names are their own, and the owner of the name is the exclusive authority on its pronunciation. Anyone who doesn't listen to someone when they inform how to pronounce their name is an asshole.",
                "labl": 154,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Rewatching Scrubs, I realize I’m no longer a JD. I’ve become a Cox.",
                "labl": 375,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Sadly, The Wonder Years.\nI always couldn’t believe the dad was real, with his pissed off attitude from work.\nNow I understand",
                "labl": 6608,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Yeah, dude, I saw the funny cartoon going around also. Don’t steal jokes.",
                "labl": 23,
                "true_bin": 1,
                "pred_bin": 2
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "I'm unsubscribing",
                "labl": 147,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "FFS is this what people upvote on AskReddit nowadays?",
                "labl": 142,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Pure Heroin - Lorde",
                "labl": 973,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Oregon Trail comes to mind...",
                "labl": 13280,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "This is a little more niche, but Bill Wilson, the founder of alcoholics anonymous.\n\nThe guy did great things, and created a program of recovery that has saved millions of lives since it's inception 85 years ago.\n\nHe was also an arrogant ass hole that cheated on his wife even in sobriety.\n\nEdit: This isn't here to scare away anyone that's trying to get sober. I've been sober thanks to AA for 5 1/2 years. So don't let this keep you away if you're struggling with your drinking.",
                "labl": 13565,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Um ok game of thrones. Really. Not season 8, of course. Some time around season 4 or 5 (whichever came out in spring) I made a really half-assed suicide attempt and was going to try again, I just wanted to wait a week until the first episode of the new season. It came and I wanted to watch the next one. By mid-season my meds finally kicked in and the weather got really nice, so I got through.",
                "labl": 282,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Shelly Miscavige is either dead or being held prisoner by the Church of Scientology.",
                "labl": 21943,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "A lot of entertainment companies are money-laundering fronts.",
                "labl": 41922,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The American Government wants to keep us poorly educated and unhealthy.  Just enough to be too busy to stand up for ourselves.",
                "labl": 4356,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "That J.R.R Tolkien actually wrote Beowulf in Old English and then translated it into modern English just for shits and giggles; can't remember where I heard this, but I've 100% believed it since I did\n\nBefore you say that it's impossible, and too crazy, let me remind you: Tolkien wrote a language, created a fictional universe for this language with dozens of wars and kingdoms, 8 more languages, several unique species and gods, and hundreds of developed characters, then wrote a children's book within this fictional universe. If anyone was crazy enough to do it, it was him",
                "labl": 1361,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Paint/draw and then share it with strangers. I did not grow up with art and had absolutely no confidence in attempting it. During our quarantine this spring, I taught myself how to watercolor and draw birds and am now selling prints and stickers and donating 100% of the profits to bird conservation groups. \n\nI just love birds.",
                "labl": 2950,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Most things. Being young is awkward. I love the liberation of getting older and giving less (fewer?) fucks.",
                "labl": 32,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My brother did that in the middle of the night. He would get up, go into the living room, say some nonsense shit to our parents and go back to bed. It was actually pretty creepy the first times, because he was like: “They ARE in the walls. THEY ARE!”",
                "labl": 16155,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My girlfriend said in her sleep \"it's small, but it's ok\". I haven't shared this with another soul apart from her.",
                "labl": 662,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My old ex rolled over one night after she'd fallen asleep and just giggled and said \"I just made like a PILE of bodies.\" And then rolled back over and went to sleep. I was concerned.",
                "labl": 264,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I’ve said this before but it’s important. \nWhen someone says you can’t do something in life, it means they can’t do it, not that you can’t.",
                "labl": 3371,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Tried and survived, pills with alcohol doesn't work like on TV, I vomited and wake up a day or two later in my own vomit and piss so I don't want to be find like that. Anyway things got better and now I'm over it.",
                "labl": 101,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "United 93 was shot down.",
                "labl": 2057,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The girlfriend doesn't usually talk / sleepwalk but one night she came out of the bedroom and started talking about the \"apples of data\" on the table while gesturing at something that wasn't there. I would ask her what she meant and she kept talking about the apples of data, to the point I was like \"What the fuck are you on about i don't know what that means?\" And she was getting increasingly frustrated that I was completely oblivious to the apples of data.\n\nFinally she said something about the data on the bedroom doors in a tone that suggested I was going to regret not seeing her data apples and went back to bed.",
                "labl": 2065,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My little sister got up at 1am once and started getting ready for school. When she came out of the bathroom I asked her what she was doing. She mumbled something about getting ready for school and being late. I told her it was the middle of the night on Saturday. She said “oh” and walked back into her room. She’s pretty famous for getting up and doing shit around the house too. It’s starting to stop tho.",
                "labl": 347,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "A story my parents never let me forget is, i was younger, about 6 years old, and i sleep walked my way to the refrigerator and opened it, pulled my pants down, and before i could piss, my father grabbed me and rushed me to the toilet.",
                "labl": 126,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "FIVE battles with cancer during her term. Rest in peace!\n\n&#x200B;\n\nEDIT: lol the dozens of you commenting/messaging me saying how her passing is somehow a victory for the Republicans or Trump should take a long, hard look at yourselves.",
                "labl": 22928,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "... Fuck.",
                "labl": 12039,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I'll sum it up in two words\n\"fucking scary\"",
                "labl": 5,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Probably watching a few Texas DPS Officers realize they couldn't shut down a whole airport.\n\nI was working as a flight instructor at small airport on a Saturday afternoon.  We had one plane that had an issue on takeoff and veered off the runway, it cartwheeled and totaled the airplane but fortunately the pilot was not serious injured.  I had a student who was next in line for takeoff when it happened, he called me from his phone as it happened.  I hopped in the airport car with one of the rampers and drove out to the plane with a radio to inform inbound planes to use the other runway (we had no control tower).  On the way to the runway I called the airport manager who drove to the airport and on his way he made a phone call to officially closed that runway.\n\nAbout 30 minutes later a metric fuckton of DPS officers showed up and immediately tried to close the whole airport, treating it like a giant crime scene.  They were carelessley driving around the airport like they owned the place, ignoring the planes that were moving around, and crossing our only open runway without regard to inbound traffic.  A mechanic and I tried to tell them to be careful and they got mad at us.  One of them told me they were \"locking it down\" a couple times, meaning the whole airport.  Now I was a broke ass flight instructor and I had a flight that afternoon that was ultimately going to help pay for me to eat that week.\n\nThe airport manager was a short stereotypical country guy, also former Navy.  He was not intimidated at all by the cops trying to close his airport.  When he showed up I was about to go out with a student who was preflighting for a cross-country.  There were about 5 cops in the lobby, me with my flight bag, the airport manager, and a mechanic.  One of the cops saw my flight bag and said \"I don't know why you have that or why he's out a the plane, you aren't going anywhere\", the moment he finished his sentence the airport manager said \"it's one runway that's closed, the airport is still open.  This pissed off the cops.\n\nI was about to head out the door, and one of the officers said he was driving out to the disabled plane.  Idky, the pilot had been gone for about an hour.  The mechanic said \"you need to be careful\" and the cop quickly retorted \"AND WHY THE HELL IS THAT?\" and he said \"because this is still an airport, and the first thing that hits you is going to be a propeller\" a few seconds later a plane took off as one of the cars was approaching the runway intersection ironing in that point.\n\nI walked out, and as I was hopping in the plane with my student the same cop came up to me and said \"you aren't going anywhere, we're locking this down!\"  I looked at the airport manager who followed all of us out to the ramp, he said \"have a nice flight AjaxBU!\" \n\nYou could see these cops just fuming that they didn't have the authority to close down an entire airport because one plane went off the runway.   The airport had two runways, where the disabled plane was located was probably a mile or so away from the open runway.  Why they were making a big fuss, I don't know.  The occupant was relatively uninjured, his wife was the worst thing he had to deal with that day, he told her he wasn't going to fly.\n\nWe had a good flight, and I got to eat dinner that week.",
                "labl": 7674,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "2020 election results lol",
                "labl": 2914,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "\"being Infront of that damn computer won't get you a job\"",
                "labl": 518,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Learn a second language. It's good for your brain, and it's a lot easier when you're young.\n\nGet active and fit; make it a habit. This is one of the most important ways to stave off cognitive decline as you get older. Plus, it's great for managing mental health during the transition to adulthood.",
                "labl": 885,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "When you get to driving you need to realize that the laws of physics apply to you.  They aren't out to get you, they're just indifferent.  Slow the fuck down and don't horse around, you're driving a very heavy machine at speeds we did not evolve to deal with.  Be safe.",
                "labl": 12106,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "You don't matter. \n\nI don't matter.\n\nNone of us matter.\n\nKill your ego, feed your soul.",
                "labl": 449,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "So a sugar daddy lol",
                "labl": 32,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Mostly unnecessary here in Canadaland.",
                "labl": 4,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Riot! by Paramore",
                "labl": 607,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Alfred Hitchcock was an asshole/sexual predator. [Tippi Hedren wrote about it in her memoir](https://www.usatoday.com/story/life/books/2016/10/31/tippi-hedren-alfred-hitchcock-the-birds-marnie-tippi/93064436/).\n\nShe did say he was a brilliant film marker, so you can be both.",
                "labl": 29295,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "¸John Lennon.\n\nViolent wifebeater, vicious and hateful little shitbag. He used to scream at his baby boy when he was crying because \"it distracted him\". Wrote \"Imagine\" speaking about dreaming of no possessions, from his multi-million dollar condo overlooking Central fucking Park in NYC. Didn't speak to George Harrison for months after he published his autobiography because it didn't praise Lennon quite enough for his taste.\n\nAbsolute piece of shit.\n\n**Edit 1**; hot damn, this blew up like the 4th of July at Chernobyl. Thank you all for your comments and opinions. For those who don't believe me, please do not take my word for it. Read his Wikipedia page, all of it. Check out Julian Lennon's interview about his father and how he was treated.\n\nBe safe out there everyone.\n\n&#x200B;\n\n**Edit 2**;  On a more serious note, I want to address a specific defense that I’ve read a few times and that absolutely infuriates me. I don’t mind that you call me names or insult me because you don’t like what I wrote about John Lennon, and that’s fine. But this shit right here is unacceptable.\n\n“He wasn’t a violent wife-beater.\n\nHe only slapped his first wife once and apologized for it.”\n\n&#x200B;\n\n...Are you guys fucking serious?\n\nThe man physically assaulted his significant other (SO). This is domestic abuse, PERIOD. If you knew someone that was slapped by their SO, what would you say? Would you actually tell this person “Oh well it’s not abuse, it was only a slap. And they apologized for it.” What the fuck is wrong with you domestic violence apologists?\n\nThose of you who are saying that he wasn’t a violent wifebeater because he only slapped her once? You are reprobates. John Lennon was a garbage human being and an unfaithful, abusive husband to all of women who were unfortunate enough to marry him.\n\nIn the name of every single victim of domestic abuse, I refuse and denounce your bullshit “It was only a slap” defense of this domestic abuser.",
                "labl": 22325,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "The repetition makes you lose time.   Having the same job, workout regimen, schedule in general makes days blend into one another\n\n\nEdit: autocorrect.  Should have said workout instead of without. Bland to blend. Regime to regiment...to regime. My GAWD, did I spell anything correctly?!? \n\n\nEdit.  Thanks for all the replies.  I just want to point out I didn't mean life becomes boring.  I was just talking about lack of those major separators we had as children like summer vacation, new school, your first kiss, etc. Due to those major separators missing I don't recall if I did something a year ago or 3 years ago. It's a little blurry if something happened 2 weeks ago or 4 months ago.  This is because once you have a career and a home you're doing a lot of similar things most days(work, chores, cooking,  hobbies, etc).  This is why the days start to blend into one another, at least in your memory.",
                "labl": 16220,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "i was headbanging my hair dry in the bathroom, I hit the counter.  I was 8.",
                "labl": 9822,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My mother and brother were arguing about ice cream cone sizes, so my brother stormed off, I followed him back to a villa thing we were staying at. He didn't have a key and we didn't want to wait so I just punched through the glass in the sliding door to make an entrance. There were probably a thousand other safer ways to do it but it just seemed the quickest. Fucking ice cream cone sizes, man.",
                "labl": 1702,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Teacher: \"Go to lunch, but do not run! I'll be watching you all.\"\n\n8 year old me proceeds to walk to lunch facing backwards, checking to see if the teacher is still watching - she is. Eventually I accept defeat, turn to walk forwards, and collide head first with a piano.",
                "labl": 257,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "It’s not necessarily dumb (Ali though I regret it deeply) its more depressive if anything. I have self harm scars from a few years ago all over the top of my forearm and I’ve been thinking of one getting a tattoo over it, but it would definitely have to be meaningful.",
                "labl": 95,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My cat\n\neta: thank you for the gold :3 my cat is indeed my little reason for being.",
                "labl": 187,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "That Britney Spears is either being held hostage or otherwise in a very compromised situation.",
                "labl": 5748,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    }
]