[
    {
        "correct": [
            {
                "sent": "You'd have different religious factions arguing that they're right and the other is wrong\n\nOh wait",
                "labl": 15158,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "... Fuck.",
                "labl": 12039,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "There's a lot of disrespect in this thread, and would it be too unreasonable to have more reverence to this comments in this post?\n\nRegardless of what side of the aisle you support, this was an intelligent, resilient, and wise woman. She gave judgments that benefited both sides and fought hard so she could retire peacefully and dignity. \n\n40 years serving from the bench and she battled cancer 5 times, people. There's no reason to fight her spirit now too.\n\nNo matter which party you support you can admire her spirit to show up and deliver sound judgments. Give credit to her will to fight for liberty for all. She was not infallible; she was human. Like you she made mistakes. \n\nIt's been 10 years, she served the US well and I hope she will meet he husband again. RIP.",
                "labl": 2771,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Eastasia has always been at war with Emunation.",
                "labl": 805,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, this might be a long one.\n\nI grew up around a mother with dissociative disorder as well as narcissism. She was addicted to opiates as far back as I can remember, and would do anything to get them, and I mean anything.\n\nGrowing up, it wasn't rare for her to have a tantrum during one of her highs and beat the shit out of me, break me down by picking apart every little thing she knew I was afraid or self-conscious of, and actively sabotage my relationship with my father and siblings.\n\nShe would be up for days at a time, pass out standing up with her eyes glassed over and back hunched, and when she festered once again start moving and otherwise destroying everything in the house.\n\nThere were times where I'd leave and the house would be clean, and come home and it would look as though a pissed off tornado had run through the house i.e. broken glass, animal feces, dirty clothes, roaches, empty pill bottles, ground-up pill residue, and other miscellaneous things littering the house. On particularly bad nights she would hallucinate, and during those times it wouldn't be uncommon to find pools of her blood on the ground from running through glass.\n\nI remember being up for days at a time because her and my father would scream at each other for days at a time without stopping; actively trying to get me to pick one side or the other even if it meant barging into my room at 4 am to begin their screaming match where I could watch.\n\nShe manipulated me, abandoned me at times in the middle of nowhere when she'd meet up with her various sugar daddies (she was still with my dad during this), and never once apologized during her brief moments of mental clarity. If anything, she would blame everything but herself. In her mind she was infallible.\n\nMoney was always a big issue since she couldn't work in such a state. She sold some of her pills, yes, but ultimately those funds were used to buy more drugs anyway. Because of this, we were homeless frequently, without power and water for literally years at a time, and barely ever had any food. It was almost every night I went to sleep with the only thing I'd have eaten that day being a school lunch. On weekends, sometimes I didn't eat at all.\n\nThe rest of my family had no clue this was happening. During the summer when I was 16, my aunt whom I hadn't talked much with since I was a lot younger got in touch. She asked if I'd like to come to stay with them in Texas for a few weeks during the summer.\n\nOf course I said yes, and I was absolutely ecstatic. I didn't bother asking my parents since I'd be very much surprised if they even noticed I was gone so they were unaware. My aunt drove up all the way to Iowa and stayed the afternoon with us.\n\nMy parents seemed to lack the cognition to recognize she was even there out of the blue so they didn't come out of their room. As I stated before would happen frequently, when she arrived our house was fairly clean. We left for a bit to go get food, and when we returned the tornado had already passed.\n\nAs she told me when we were on our way to Texas: the thing that bothered her the most wasn't that our house had suddenly gone to hell, it was that I didn't even react to it. Instead, I tiptoed around the debris and started packing my things without a word.\n\nThis deeply unsettled her, and ultimately she asked me if I was safe where I lived. I said yes, as it was all I had ever known. She told me that what she saw frightened her, and she wanted me to come live with her in Texas. Thinking that she was joking, I brushed it off. After a few days down there though, I knew I had to do it. They showed me love, compassion, and care that I'd never even known existed prior to this and it shook me to my core.\n\nSo we decided, I was going to get emancipated from my parents and move in with them. Ultimately, this involved sitting in a courthouse across from my parents and their lawyer.\n\nThe judge asked why I wanted to leave, and I explained the above. I expressed the love and compassion I'd experienced for the first time in my life, and that I wanted to, for once, live in peace.\n\nTheir lawyer rebutted, \"To me, it seems as though you have no respect for your parents. Is it because of their financial situation? It looks as though you're attached to the perks of living in a family that makes a reasonable amount of money, and not that you want to leave because they're unfit parents.\"\n\nMy mother and father joined in, hooting and hollering actively trying to break me down as they have so many times before.\n\nI let him speak, I let them speak, and I held my tongue until it was my turn. They tried to goad me on, tried to break me as they had so many times before, but I wouldn't let them.\n\nFinally, the judge asked me to speak.\n\nWith as level a stare as I could muster, I looked at mother, my father, and their lawyer across from me and said \"If you're asking me if I have no respect for my parents, then you are correct. However, to say it's simply financially motivated is incorrect. I no longer have respect for them because they have-\"\n\nAs I was nearly finished, my mother, as she had so many times in the past began to squirm and scream at me from across the table. \"HE'S LYING THE LITTLE BASTARD IS JUS-\"\n\nUntil the Judge slammed his gavel down and cut the room; my mother staring up at him in complete and utter disbelief.\n\nI looked at her, keeping the tears I knew were right behind the corner at bay and said, \"For once in your life; for once in my life, behave as an adult. You can't stop me by simply yelling over me anymore, you have nothing to hold over me now. You can do nothing.\"\n\nAs I spoke, the judge motioned to his officer who moved towards my mother. Her expression still frozen in complete bewilderment as the officer aggressively told her to get up out of her chair and escorted her out of the room.\n\nThe judge looked to me, my aunt, my father, and his lawyer with one sweeping glance and then spoke.\n\n\"I am sorry that you have had to deal with this for so long young man. There's nothing more that you or anyone else needs to say. You deserve to live a normal life as a normal kid and it's obvious to me now that your parents are unfit to produce that kind of environment. You will go back to Texas with your Aunt, and we will regularly have our social workers in touch to check in on how you are doing. Make the most of this second chance, good luck young man. Adjourned.\"\n\nThough the bang of his gavel was the only noise that permeated the room, all I could hear was the ringing in my ears. My father and his lawyer were escorted out of the room and the tears I had held back all this time came gushing out like a tidal wave.\n\nIt's been 7 years since that day and I am happy to say that I've managed to grow up and become a well-adjusted adult. I have a great career, great friends, and an amazing girlfriend. I've been in therapy ever since we got back to Texas, and I no longer have trouble sleeping or terrible bouts of anxiety and depression as I used to.\n\nLife is good.\n\nTl;dr:\n\nMother is a narcissist with dissociative personality disorder addicted to opiates. Father kind of just went with the flow and didn't really do much. Aunt came down to take me to Texas, saw how shit everything was and asked me if I wanted to live with them. After some time I said yes, went to court against my parents under the pretense of emancipation, and got to stare them down and layout all the trauma, pain, and fear they've caused me. My mother was escorted out of the room when she tried to cut over me, and the judge sided with us and I was emancipated. Now I'm doing really well.",
                "labl": 631,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I was waiting for a friend to finish work - she worked at a restaurant so fancy they had someone vetting guests at a podium *outside*. \n\nThe place was glitzy and the folks were glam so the great and good would descend in droves.  Those with a reservation were sent in; prosepective walk-ins had to queue. \n\nA car sweeps up, the driver jumps out and holds the door open to unleash a hat and dress. The woman accompanying said finery - a C-list actress from a regional daytime TV show - looked through everyone present and moved to enter. She froze, appalled, when the guest-vetter intercepted, asking \"Do you have a reservation?\"\n\nShe mustn't have heard the question because she didn't respond. Instead she drew herself up to the full height of her couture and demanded \"Do you *know* who I *am*?\"  \n\n\"Yes\" said the maitre d', \"Back of the queue.\" \n\nOof",
                "labl": 1531,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Worked in a cellphone store, both selling devices and service contracts in the UK. Some kid (19-ish maybe) came in with a much shorter man who I later learned was his dad - for whatever reason (I forget what now) he wanted to cancel out of a contract he was partway through. Now I could already tell from the way the kid explained it in exasperated terms that he knew he couldn't cancel out of it, but his Dad wasn't taking his word for it and had dragged him in to try and 'sort it out' for him.\n\nThe contracts clearly state you can't cancel prematurely without paying off the rest of your dues, which I explained, and his father just went full Boomer Rage mode on me. Spitting, frothing, hurling vitriol - this guy clearly thought this was how you got things done. I stared him down, waited for him to finish, and repeated the contractual terms as stated. He hit me back with 'I'll report you for violating the Sale of Goods act!'\n\nSucks to be him because I had that bitch memorized. I made a point of it, infact, after the first few customers in my early days tried to bring it up to get their own way (*some chode on the internet had made posts about how you could sling the term around and usually scare retailers into doing what you want because 'they don't know it either' so it happened a lot even when there was absolutely no call for it*).\n\nI just looked at him and said 'Sure. Go ahead. You can even use our phone.' and pointed at the store phone right next to him. I knew he didn't have a leg to stand on and any trade commissioner listening to his claim would laugh him off the line.\n\nHe clearly had absolutely no idea how to proceed. After a moment of blank staring he just turned and stormed out with his son rolling his eyes so far back into his head he could probably see his own brain in embarrassment at his Dad's tantrum.",
                "labl": 1340,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I once had a boss try to give me a disciplinary (three months later I may add) for my behaviour as it was noted I was 'rude to her' by several of the Groups CEOs in a Board meeting. \n\nOn the disciplinary forms, you both have to write your version of the events and it goes to HR for an adjudication, she did her part and I casually filled in something to the effect of \"manager continually pressured me into deleting files from our client management system prior to a regulatory audit which is against the ethical code of our profession and not aligned with my moral standards, I accept I was short with her but she was trying to force me into performing an illegal activity.\"\n\nI watched her collect up the paper and the colour drained from her face. I never did hear from HR.  \n\nShe got fired not long after when I casually mentioned to the CEO in a bar if she remembered the encounter and explained why I may have appeared a little frustrated and upset. Bye Felicia.",
                "labl": 131,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "One of the managers at my previous employer was living near me. I was not reporting to her, but my manager was sitting right next to this woman so I had to see her multiple times every day. One day she found out that I lived on the same street as her, and started forcing me to visit her. I kept making excuses, but at one point I couldn't come up with any more excuses. \n\nSo I visited her. She sat me down and asked me why I was renting a house by myself, what caste my room mate was, and told me not to have \"lower caste\" people room with me, all the while subtly trying to find out what caste I was. I hated her. I couldn't really do anything about what she spoke because the HR was not even taking sexual harassment complaints seriously, let alone this one. \n\nAlso it turned out, my apartment's owner was friends with this woman and she had a spare key to my apartment that she stored on behalf of the owner who lived abroad. If she found out that I was in a relationship with someone not from my caste, then she could tell the owner and they could have kicked me out for being sinful in their house.\n\nIn few months, I found a better job and I gave my notice at that workplace. I was also getting married in few weeks, so I was moving out of that house. Although I didn't expect anyone from that office to attend my wedding (my wedding was held in a different state), it's kind of disrespectful in our culture if you don't invite everyone you know. It was my last day in that organization, and I was going around giving wedding invites to everyone. \n\nWhen I went over to my manager's desk, this lady was all smiling and waiting to get the invitation next. I simply invited my manager, then smiled at this woman, and walked away. Also, I invited everyone in my apartment except my house owner who specifically requested that I mail her my invite. My house owner called me after I vacated and asked where the invite was. I told her that I forgot and didn't have any left.\n\nBoth of them didn't hold any power over me anymore and both my employment and my housing situation were not in their control so they could really do nothing about me disrespecting them.\n\nThis might not be much, but it felt so good when I did it.",
                "labl": 351,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A few years ago I was helping my parents move to a new house locally. My father is fairly particular and told me he has reserved a U-Haul truck for specifically 24 hours as we are going to need to make a few trips across a large metro.\n\nI go in to pick the truck up for him, and look at the sheet stating the truck needed to be back in just over 3 hours (we were about 35 minutes late, but that would be okay with 24 hours). I tell the fellow behind the desk that this should be for 24 hours, and he says it is not in the system and it is spoken for already after we return it for another rental. I ask if there is anything we can do at which time the owner comes over to see what the issue is.\n\nI explain it to him and he proceeds to chastise me, saying we must not have ordered it correctly, if we need it so long why are we 35 minutes late, and a bunch of other down talk. By this time my father comes in to see why I have not come out, and also gets talked down to which upsets me internally. I tell the owner that we need to move at least the big things, so if we only have 3 hours we will make it work the best we can (then rent another truck elsewhere during the week) but he keeps chewing up more time arguing then says the kicker. He will look up the call recording to see who is right. I have absolute trust in my father when he says he did something, so I agree and wait.\n\nTurns out the owner was the one that took the call and he gets smug. \"I have done this for 20 some years and I don't make mistakes.\" Five minutes later, sounding defeated, he is asking us to bring it back early so we don't mess up another person's move (guilting us for his mistake that he never makes). On the call you clearly hear my father asking for the 24 hour rental with multiple confirmations from the owner throughout the call. Guy was a real jerk, never even apologized for anything. Also left a lengthy detailed review on multiple sites and emailed U-Haul corporate. It is now my most \"helpful\" review on just about every platform.",
                "labl": 171,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I'd search to see if The Winds of Winter has been published yet.",
                "labl": 24052,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Lottery numbers the last five years ? Easy peasy",
                "labl": 32935,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Is Betty White still alive?",
                "labl": 130,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My family member's names, i Want to know who to call and go see every chance i get if they don't have that much time left.",
                "labl": 368,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "COVID vaccine",
                "labl": 918,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Hentai",
                "labl": 1039,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I'm immune to the sexy ghosts so I'll just piss them off.",
                "labl": 127,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Sadly, The Wonder Years.\nI always couldn’t believe the dad was real, with his pissed off attitude from work.\nNow I understand",
                "labl": 6608,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Goob, Meet the Robinsons",
                "labl": 4889,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Rugrats. The parents were so young and just doing their best. I like it was a group of neighbors that were best friends too. I get really stressed out on their behalf now. Especially the one where didi just wants to make it home before her banana tree she bought died in the car but no one could get their shit together",
                "labl": 22458,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Frozen. Elsa (21) only had 3 years on Anna (18), and yet still knew that marrying someone you just met is a bad idea.",
                "labl": 1103,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "Well, for starters, my area was stolen from the emus when we drove them off the land, we've built a fine community in its place. The emus have yet to take this land back, until then, I have yet to see a wild emu anywhere near here.\n\nIf it were not for the war, I wouldn't be where I am today.",
                "labl": 1575,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I was working as a consultant for a company, there was a bit of a competition between me and this guy, company starts to have some financial issues so I leave and start working for a client of theirs. Shortly after joining they bring in this guy I was competing with at my old job, he was technically my equal except now I was employed by the client and he was just a consultant. He was trying to one-up me during meetings and my boss told him that decisions are made by the company not the consultants. It felt good.",
                "labl": 28726,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Grays. Sports. Almanac.",
                "labl": 798,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "My name + obituary. \n\nIf I get more searches? 2020, 2024 election results. COVID vaccine FDA approval parent company. TSLA, GOOG, APPL, FB prices.",
                "labl": 4726,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "Like a fax from future me?\n\nDo not drink that coffee!",
                "labl": 871,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "FFS is this what people upvote on AskReddit nowadays?",
                "labl": 142,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "He/she is probably not the love of your life\n\nEdit: to all of you that find the one when you were still babies : that’s awesome, and I wish you a lifetime of happiness!",
                "labl": 336,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I worked as a phlebotomist in a hospital and had just drawn an elderly male patient. As I pushed my little cart into the elevator to go back down to the lab, his blood vials rolled off and both went right down the gap into the shaft. I felt so bad and went immediately back to tell him I had to redraw him. He was thrilled! Said he was excited his blood would be down the shaft for eternity. Such a funny guy.",
                "labl": 134,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Not exactly answer to the question but still related. When we came to call about \"broken doors\" we was not expecting that someone for some unknown reasons stole one half of elevator's door.",
                "labl": 113,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "TL;DR of every comment so far: Purple dildos left for the next guy.",
                "labl": 306,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I’m just going to sort by controversial to find some new music.\n\nEdit: Yeah, this doesn’t work as I thought it would. I see a lot of great suggestions in the replies here, though.\n\nReddit both loves and hates Imagine Dragons, I get it.",
                "labl": 17451,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "London Calling",
                "labl": 4514,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Elton John - Yellow Brick Road",
                "labl": 2076,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "cowboy bebop (original motion picture soundtrack) - seatbelts",
                "labl": 764,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "A Fever You Can't Sweat Out by Panic At The Disco",
                "labl": 785,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Super Hexagon\n\nPapers please",
                "labl": 1376,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Mother Teresa.",
                "labl": 9709,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Rip",
                "labl": 9,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "Them long necked fuckers are just waiting for the opportune moment! Considering our country is weakened, and divided by Covid they are more than likely about to make a move in the coming weeks",
                "labl": 10096,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "This is a bit silly, but gave me a great feeling of satisfaction. Due to the bad economy and poor money management, my parents have moved into the spare room of the house my husband and I bought a year ago. Things are mostly smooth, tho I’m not the closest to them for several reasons I won’t go into here. \n\nThe other evening I was out gardening (because it’s hot during the day and we have the luck of having a streetlight right next to our front yard, keeping it pretty well illuminated even after sundown, I mostly garden at night), and I thought I had gotten the hose twisted, as it kept getting stuck. This went on for a bit, when I realized that it wasn’t stuck, but being pulled. I looked into the dim area just past the illumination of the street light and spied my father, crouched over and tugging the hose. Well I did the only reasonable thing to do, and I sprayed him. He yelled and ran inside with me chasing. \n\nOnce he got inside he made a face and goes “You can’t get me now! I’m inside!!” In that father-to-daughter-don’t-you-make-a-mess tone of voice.\n\nI readied my hose, looked him in the eye and said, “It’s my house.” And just fucking let loose with the hose. He was soaked. Worth cleaning up the mess for that moment of true fear in his eyes.\n\nEdit: thanks for all the appreciation! I’m glad my silly story made your day better!!",
                "labl": 5819,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I was waiting for a friend to finish work - she worked at a restaurant so fancy they had someone vetting guests at a podium *outside*. \n\nThe place was glitzy and the folks were glam so the great and good would descend in droves.  Those with a reservation were sent in; prosepective walk-ins had to queue. \n\nA car sweeps up, the driver jumps out and holds the door open to unleash a hat and dress. The woman accompanying said finery - a C-list actress from a regional daytime TV show - looked through everyone present and moved to enter. She froze, appalled, when the guest-vetter intercepted, asking \"Do you have a reservation?\"\n\nShe mustn't have heard the question because she didn't respond. Instead she drew herself up to the full height of her couture and demanded \"Do you *know* who I *am*?\"  \n\n\"Yes\" said the maitre d', \"Back of the queue.\" \n\nOof",
                "labl": 1531,
                "true_bin": 1,
                "pred_bin": 2
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "It's too bad all we can see in the Supreme Court is the D or R when it shouldn't matter.  Justice is no longer blind.",
                "labl": 5332,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Twilight, poor Charlie Swan.",
                "labl": 11434,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Mrs. Doubtfire but relating more with Miranda than Daniel. As a kid I didn’t understand why she lost her shit when she came home to the petting zoo.",
                "labl": 3129,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Roller Coaster Tycoon",
                "labl": 35912,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Paul Walker was known by peers to date underage girls as young as 16. Very weird stuff. Several articles and accounts if you google it. His girlfriend when he died was 17 years younger. She mentions how they met when she was 16 and there relationship started shortly after.\n\n\nhttps://goat.com.au/pop-culture/paul-walkers-history-of-dating-teenage-girls-should-never-be-forgotten/",
                "labl": 151,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The adult part.\n\nThe moment you need to pay for everything and the realization that fresh food spoils faster than you ever noticed before was eye opening.",
                "labl": 5421,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Knowing that I would put my family through the same hell my father put us under.",
                "labl": 651,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My kids.\n\nEdit: Stay strong friends, our kids need us now more than ever. Reach out if you need someone to listen, I start work at 11pm CST, Saturday to Tuesday.",
                "labl": 560,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My cat\n\neta: thank you for the gold :3 my cat is indeed my little reason for being.",
                "labl": 187,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "a lot of rich people help terrorism and movements to destabilise a nation or a region to make money from its resources or people",
                "labl": 508,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Maybe not Tupac. But at least one celebrity has faked their death and is still out there.",
                "labl": 33164,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The \"UFO\" footage that just got released recently was a purposeful distraction from current events.",
                "labl": 3437,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Mattress stores are just money laundering fronts.",
                "labl": 5207,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "the official story in the deaths of JFK princess diana and Jeffrey Epstein are lies",
                "labl": 1656,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Tell my friends that I love them\n\nETA: my first award on Reddit. Thanks!",
                "labl": 118,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I was about 14 years old, me and my bestfriend went to sleep (we were sleeping in his basement) after watching an horror movie. I realized that I was sleepwalking when I regain consciousness while I was swinging on his rocking chair on the first floor (in his living room), at 3 or 4am. Had no idea how I got there, how long I was on the chair, just swinging and staring at the tv (wich was obviously turned off) and what I did before. It freaked me out since I couldn’t think about anything else but that movie.\n\nI used to sleepwalk a lot when I was younger. The weird thing is that, sometimes I was kind of conscious during the whole thing. But for some reason, it felt like everything I was doing made perfect sense, even tho it clearly did not. But that particular time was the one that freaked me out the most.\n\nEDIT: Wow, that’s my first ever comment to blow up, It’s nice tho to see that other people have  experienced similar things. I thought I was the only one.",
                "labl": 1924,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Went to a private school for a couple years, and boarded (stayed overnight) a few times. Woke up one morning to everyone looking tired af and pissed at me. Apparently I'd commentated a full football match in my sleep, with replays and full hype over the goals. Don't remember it at all",
                "labl": 356,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "What the fuck happened with Emus in Australia?",
                "labl": 5,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The guy that i'd gone on a few dates with introduced me to his parents, things went well, or so i thought. \n\nhe drives me home, we end up talking and drinking a few beers, i didn't want him on the road with any alcohol in his system, and i enjoyed his company, so we end up hanging out until 3am. His mom starts blowing up his phone, demanding that he comes home, so he drives himself home to find that he's been locked out of his house. His mom said that he can sleep outside, he shouldn't be spending time with someone like me (still don't know what she meant by that), and that i'm \"just another stop on the pussy train\". He tells her not to talk about me like that, to which she says \"when you're under my roof, i'll say whatever i want about whoever i want!\"  so he picks up his phone, calls me, asks if he can stay at my place for a little while. \n\nIt's been seven years, we're engaged, have a dog, a cat, and a happy life. \n\ni also plan on throwing some subtle train themes into the wedding/celebration after the end of the plague.",
                "labl": 6846,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "A cop accused me of going 87mph in the right lane in traffic behind a truck, ticket and everything. In court I pointed out that the ticket said he lasered me at 297 yards. I told him in court at the podium that if he could hit a target moving through traffic at 87mph across 3 football fields that I would sponsor him for the Olympic shooting team. The judge pointed out that they are only legally reliable at 200 yards and then she asked him if there was ay other evidence that I was speeding.\n\nThe best is that I had been speeding earlier on the trip but a mile ahead of my exit I moved into the right lane behind a truck and that's where he lasered me.",
                "labl": 1370,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "At a place where my wife used to work: a body.\n\nThere was a crash from the elevator area. The boss went to see what it was, came back white as a sheet, and said \"*Do not go out there*.\" Two maintenance guys had been working on the elevator, one was in the bottom of the shaft, and the other one made one small error...\n\nBut I'm guessing the single most unusual item ever found at the bottom of an elevator shaft was a Wright R-2600 aircraft engine, on July 28, 1945 in the Empire State Building.",
                "labl": 2324,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "Do you want a Holy War? Because that's how you get a Holy War.",
                "labl": 26069,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "He would also say, “my name isn’t God” then he would pronounce his name and everyone’s faces would melt.",
                "labl": 6449,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "What if Satan came down one day and said ''It's pronounced 'Zlatan' then left?",
                "labl": 5263,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "“They are illusions Michael! A trick is something a whore does for money”",
                "labl": 691,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I worked at a prison for 10 years. A lot of the captains were notorious for giving into newer employees demands for training usually reserved for senior officers, or at the very least, easier jobs away from inmates. \n\nOne night I was talking with one of the captains in his office and a new officer came in, he’d been there about 3 months or so. He started asking the captain for some particular training. The captain kept telling him no because there were senior officers ahead of him.\n\nNaturally, this 20 something year old kid started whining about so and so getting trained and he wasn’t and  they felt like they have proven their worth.\nThe captain got up and start walking circles around the officer as if he was looking for something. Checked his shirt collar, pockets, and even made him give him his wallet, and he looked through it. He finally sat down and looked at his own collar and touched his captains pin and said, “holy shit! You almost had me convinced that I wasn’t the decision maker. Get the fuck out of my office!”\n\nHe was my favorite supervisor of all time, still is.",
                "labl": 222,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "At the old courthouse I worked at, the stairs leading to the courtroom were often crowded. As I was trying to squeeze by everyone after stopping downstairs, some guy towards the top of the staircase intentionally stepped in my way and refused to move. After asking him to politely move twice, he made a comment under his breath (but purposefully loud enough so I heard it) that I should essentially go screw myself and that lawyers are entitled assholes and should wait in line like everyone else (which they actually do). He didn’t move so I said sorry and quietly waited behind him for a few minutes. \n\n20 minutes later, I call him out of the courtroom to plea bargain and got the satisfaction of seeing his face when he realized I was the prosecutor",
                "labl": 166,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I almost went with B, but I think a lot of Hermione ghosts correcting me around be so annoying and I am girl, no problem on getting  horny in public... So Sexy inconvenient ghosts it is!",
                "labl": 311,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I never watched it as a teenager, only as an adult but Red Foreman from that 70s show is quite relatable.",
                "labl": 258,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "ITT: people misunderstanding the premise of the question and talking about brain computers and stuff. It's supposed to be something that people *actually say today* which might turn out to completely wrong. The cell phone service one is a good example. The ten different \"mind computer\" ones are not.",
                "labl": 1781,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Learn a second language. It's good for your brain, and it's a lot easier when you're young.\n\nGet active and fit; make it a habit. This is one of the most important ways to stave off cognitive decline as you get older. Plus, it's great for managing mental health during the transition to adulthood.",
                "labl": 885,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Most of your friends are the product of geographic convenience. Just because you grew up being friends with a neighbour or a fellow student, doesn't mean you owe them your undying loyalty when they start treating you like shit.",
                "labl": 44546,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "CONSENT",
                "labl": 205,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Been in the game 12 years now. \nFound a full Christmas tree last month\n\nOther finds\n5k in £20 notes \nBig ass bag of drugs. Roughly 5kg\nBrand new shoes by the box load.\nSevered finger\n\nEdit. Holy shit this has blown up. My most commented and upvoted on reddit.\n\nSo back story.\n\n\nChristmas tree was found this year on a council estate in August. Photos was taken for the office as it was rather amusing. I visit this lift every month.\n\nThe money and drugs was found in the same lift shift around 3 months apart 7 years ago. The money  was spilt between me and my engineer as I was a apprentice at the time the drugs we handed into security. \n\nThe shoes was found on a passenger/staff lift out the back of JD sports. Suspect a staff member was sticking them down there and loading into a car at the end of his shift. Police was involved in this one. \n\nThe finger was found in a very expensive apartment building. We talking 50 floors and million£+ apartments. \nAgain police and emg services involved in this one.",
                "labl": 7377,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Thriller",
                "labl": 259,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Kate Bush - Aerial\n\nMika - Life in Cartoon Motion\n\nVampire Weekend - Contra\n\nTalking Heads - Speaking in Tongues \n\nStromae - Racine Carrée \n\nTaylor Swift - 1989\n\nSufjan Stevens - Carrie and Lowell\n\nThe Avalanches - Since I Left You\n\nLorde - Melodrama \n\nKacey Musgraves - Golden Hour",
                "labl": 363,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Heroes of Might & Magic III and Master of Orion 2. Both very dated graphics but stand the test of time. Still very playable today and best of all; they can run on almost any PC. Also add Civ series to the list.\n\nEdit: I advise you all to check out /r/heroes3 for more HoMM3 discussions!",
                "labl": 7111,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Rimworld. Edit join us at r/RimWorld",
                "labl": 7834,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Hotline Miami.\n\nSo much action and violence into some pixels.\n\nSONIC the Hedgehog (Classic)\n\nAn icon that still is launched nowadays.",
                "labl": 117,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Thomas Edison. Biggest monopolist ever and took credit for other people's work. He didn't invent the lightbulb but bought the rights and advanced it. He monopolized the film-projector + most films at the time and it took a very long lawsuit to get that fixed. He took many creations from his employees and put his name on it. This wasn't illegal because of the contracts employees signed at the time but it's not exactly a sign of good will. I don't hate the guy but his character is often completely exaggerated.",
                "labl": 25886,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Meal prepping and conserving food wheres",
                "labl": 118,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": " I was 7, mum said \"don't use that knife to cut that orange\" I used that knife to cut that orange. Things I learned: orange juice in a wound stings but not as much as the knowledge you can't go crying to your mum.",
                "labl": 19713,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "It'd be weird if I died and still had packages coming in the mail, so I try to keep something coming that I can look forward to.\n\n[EDIT] \nI had a really long day today with no time to look at Reddit, so imagine my shock as opened this thread! I definitely wasn't prepared for this! Oh wow, thank you all so much for the support! I'll try my best to go through and reply to as many people as I can sometime tomorrow. Again, thank you all!",
                "labl": 14364,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Wearing pink and purple as a male. I always felt weird about it until my wife finally convinced me to get shirts for work in those colors. Now they’re basically all I wear. I get a lot of compliments and I feel great in it.",
                "labl": 985,
                "true_bin": 3,
                "pred_bin": 3
            }
        ],
        "incorrect": [
            {
                "sent": "Republicans fought tooth and nail to prevent a supreme court justice being appointed in an election year 4 years ago\n\nTime to see hypocrisy of the highest order from McConnel. \n\nAnd not a single conservative will care. No matter how far the courts are stacked.",
                "labl": 6451,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Obligatory \"not a movie but...\"\n\nWhen I was younger, hank Hill seemed like the most boring buzzkill stick in the mud. He didn't get teen slang and would get grumpy in his confusion. He didn't put up with antics and was always telling his friends to knock it off.\n\nWhen you get older, you realize hank hill is exactly the kind of guy you want to be. He always keeps his word. He's always responsible. He has faith in people. He's a good friend, always there to help his pals out when they need it. He doesn't understand his son but he does his best to support him. \n\nAnd he doesn't put up with bullshit. It's not zany antics he's stamping out, it's bullshit.",
                "labl": 1252,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "\"Well you can't automate everything.\"\n\nTell that to my car that drives itself, house that cleans itself, yard that mows itself, and coffee that makes itself. But, sure, that *one thing you're thinking of* totally can't be automated.",
                "labl": 23310,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Not an elevator technician, but I can tell you some dude, at some point is going to find a kindle at the bottom of a shaft in a Toronto hotel elevator. \n\nRules to remember: \nRule #1: Always check that you zipped your carry-on and didn't leave a gap in the bottom\nRule #2: Kindles fit through small carry-on bag zipper gaps and elevator shaft gaps",
                "labl": 321,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Idk man, when I read about Martin Luther last year, I thought he was kinda cool as he created the protestant branch of Christianity, but I recently read about what he thought of Jews and yikes...\n\n(For those of you who don’t know, he got pissed when the Jews didn’t want to convert to his religion and started being antisemitic as fuck. He wrote a *whole book* on “Jews and their lies” and said that he urged others to burn down synagogues to prove their loyalty to Christianity. He also wanted the Jewish prayer books to be taken away from them)\n\n\n\nEdit: because of misunderstandings, I do **not** mean Martin Luther King Jr. \n\nMartin Luther was a monk during the 16th Century who initially started the reformation for Christianity, and was the founder of Protestantism",
                "labl": 8958,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "I have multiple scars on my thumbs from slicing my thumb open on cans of ravioli and spaghetti-o's",
                "labl": 252,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "I used to thoroughly enjoy sliding down grassy hills as a kid. One fateful luge led to me running over a hidden rock, resulting in a permanent rear tyre puncture (my right butt cheek).",
                "labl": 361,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Cutting a pretzel open to put butter in it. I cut my right Ringfinger.",
                "labl": 301,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I punched a pint glass one night when I was drunk back in college. \n\nIt ended up slicing my finger *really* badly, like there was a flap of skin that came up. Went to the bathroom and ran it under water, but it just kept bleeding. I didn't know what to do and was too drunk to try to deal with it, so I just wrapped my hand in a towel and tried to go to sleep.\n\nWoke up to knocking at my door and it ended up being security. He followed a trail of blood from the bathroom to my room and wanted to make sure I was alright. I showed him my finger and he was like, \"Come on, you gotta go to the hospital.\" Dude was a bro and drove me there even though it was like 3am. Saw a doctor and he had to give me a bunch of stitches. He said I was very lucky because if it was just a tiny bit deeper I would have probably had done permanant damage and lost mobility of the finger.\n\nNow I have [this scar on my finger shaped like a Nike swoosh](https://i.imgur.com/cEhQRG0.jpg) to remind me not to be stupid and try to fight glass.",
                "labl": 1082,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "My government stored 2700 tons of ammonium nitrate alongside fireworks in a warehouse at the port near a residential area for 7 years until they blew up in the biggest non-nuclear explosion ever, shattering the glass window I was sitting by in my house and giving me a nasty scar on the arm.",
                "labl": 461,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "My cat found me in the bush in the back of my house at 3am and wouldn't leave me alone. She headbutted me and rubbed into my legs as I stood there with the knife trying to get her to to away. Had her for 20 years until she passed 2 years ago. Something about her that night broke me out of the crushing darkness momentarily and allowed me to get therapy to deal with the problems. Love you Kiss",
                "labl": 1407,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "My 9yr old daughter.  About 18 mths ago I was in a very bad place but I am a single dad and I would not do anything to hurt my daughter.",
                "labl": 8392,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I finished a suicide note and folded it into my wallet on the bus ride back onto base after a weekend of binge drinking on the beach to avoid every person I could. When I got back to the barracks I looked at my rack mate and told him exactly what I wrote down in that note and instead of making things worse he genuinely helped me, and reminded me that not every Marine is meant to do a full term. Sometimes things just don’t go as planned and it’s okay to take that DD-214 early, even if it will disappoint your family. We still talk around the holidays every year.\n\nEdit: Thank you for the award, I’ve never received one on Reddit to my knowledge. I would also like to add that if anybody reads this, and you feel somewhat lost while in the Military, don’t be afraid to go to medical and talk about it. It happens unfortunately often where speaking directly to your chain of command will not help things and word can travel fast. But there is absolutely nothing wrong in seeking help to allow yourself to be the best Marine/Sailor or whatever title you gave your all to achieve. It’s just harder in some units compared to others.",
                "labl": 6343,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "After my second attempt, I spent 2 weeks in hospital. They fed me coal. For two fucking weeks I shit black and nurses cleaned up my shit. I killed myself but only the part that I hate. I killed everything I hate about me, cleaned the toxic ppl around me. One day, I just said to myself \"No, you won't go anywhere like this. You will have what you deserve and if they don't give it to you, you will fucking take it. You will quit smoking, begin sports, get mental and physical strength. You won't just be nice and wait ppl to give it to you anymore. You will fucking take it.\" So it was my anger, it saved me actually.",
                "labl": 729,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "my gf. she helped me to stay alive 6 years ago and thats how long we have been together now.",
                "labl": 124,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "ENGLISH! I used to be terrible and my accent still sucks sometimes, but after more than 20 years of practice and a bachelor degree from an English university, now I'm quite proud to be bilingual.",
                "labl": 16230,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Wearing pink and purple as a male. I always felt weird about it until my wife finally convinced me to get shirts for work in those colors. Now they’re basically all I wear. I get a lot of compliments and I feel great in it.",
                "labl": 985,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Speaking in public. \n\nI got a job in sales that required me to give presentations in front of people. After my first solo presentation, the customer actually told me how shitty I was and how I would never make a good salesman. I went back to my car and threw up. \n\nNow I give presentations multiple times a day, and I’m so used to it that I can devote most of my attention to gauging audience reaction, allowing me to adjust the pitch and emphasize or deemphasize different topics based on their interest. \n\nThat original customer got demoted about a year ago, which was pretty sweet. Now I deal mostly with his former assistant, who got his old job.",
                "labl": 101,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "My Chinese college roommate (he speaks good English but has a fairly thick accent) once sat up in bed, said in perfect, clear, American accented English, like a 30s radio announcer, “what a beautiful creature,” and went right back to sleep.",
                "labl": 267,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "There's a lot of disrespect in this thread, and would it be too unreasonable to have more reverence to this comments in this post?\n\nRegardless of what side of the aisle you support, this was an intelligent, resilient, and wise woman. She gave judgments that benefited both sides and fought hard so she could retire peacefully and dignity. \n\n40 years serving from the bench and she battled cancer 5 times, people. There's no reason to fight her spirit now too.\n\nNo matter which party you support you can admire her spirit to show up and deliver sound judgments. Give credit to her will to fight for liberty for all. She was not infallible; she was human. Like you she made mistakes. \n\nIt's been 10 years, she served the US well and I hope she will meet he husband again. RIP.",
                "labl": 2771,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "We took back the cities, but it's in our minds that any day could be the day that we need to pick up our whacking sticks to defend our bbq retreats from another invasion.",
                "labl": 7832,
                "true_bin": 3,
                "pred_bin": 1
            }
        ]
    }
]