[
    {
        "correct": [
            {
                "sent": "We’d be like, “No way!” and he’d be like, “Yahweh.”\n\nedit: holy shit, y’all are making my day",
                "labl": 20046,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I would be converted\n\n\nEdit: thanks for the upvotes and awards guys!=D",
                "labl": 6577,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Does that mean Jesus would be pronounced Geezus?",
                "labl": 22978,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "“They are illusions Michael! A trick is something a whore does for money”",
                "labl": 691,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "As someone not in the US, can someone explain the implications of this and why this is such a big deal? Thanks in advance",
                "labl": 179,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "People dont really think about it. We are all preoccupied, watching in horror as our rebel kangaroos conquer Uruguay.",
                "labl": 442,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "As an American there’s so much information on this post that I never even knew existed. Fires? Emu War? No coverage in the States smh",
                "labl": 6,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, this might be a long one.\n\nI grew up around a mother with dissociative disorder as well as narcissism. She was addicted to opiates as far back as I can remember, and would do anything to get them, and I mean anything.\n\nGrowing up, it wasn't rare for her to have a tantrum during one of her highs and beat the shit out of me, break me down by picking apart every little thing she knew I was afraid or self-conscious of, and actively sabotage my relationship with my father and siblings.\n\nShe would be up for days at a time, pass out standing up with her eyes glassed over and back hunched, and when she festered once again start moving and otherwise destroying everything in the house.\n\nThere were times where I'd leave and the house would be clean, and come home and it would look as though a pissed off tornado had run through the house i.e. broken glass, animal feces, dirty clothes, roaches, empty pill bottles, ground-up pill residue, and other miscellaneous things littering the house. On particularly bad nights she would hallucinate, and during those times it wouldn't be uncommon to find pools of her blood on the ground from running through glass.\n\nI remember being up for days at a time because her and my father would scream at each other for days at a time without stopping; actively trying to get me to pick one side or the other even if it meant barging into my room at 4 am to begin their screaming match where I could watch.\n\nShe manipulated me, abandoned me at times in the middle of nowhere when she'd meet up with her various sugar daddies (she was still with my dad during this), and never once apologized during her brief moments of mental clarity. If anything, she would blame everything but herself. In her mind she was infallible.\n\nMoney was always a big issue since she couldn't work in such a state. She sold some of her pills, yes, but ultimately those funds were used to buy more drugs anyway. Because of this, we were homeless frequently, without power and water for literally years at a time, and barely ever had any food. It was almost every night I went to sleep with the only thing I'd have eaten that day being a school lunch. On weekends, sometimes I didn't eat at all.\n\nThe rest of my family had no clue this was happening. During the summer when I was 16, my aunt whom I hadn't talked much with since I was a lot younger got in touch. She asked if I'd like to come to stay with them in Texas for a few weeks during the summer.\n\nOf course I said yes, and I was absolutely ecstatic. I didn't bother asking my parents since I'd be very much surprised if they even noticed I was gone so they were unaware. My aunt drove up all the way to Iowa and stayed the afternoon with us.\n\nMy parents seemed to lack the cognition to recognize she was even there out of the blue so they didn't come out of their room. As I stated before would happen frequently, when she arrived our house was fairly clean. We left for a bit to go get food, and when we returned the tornado had already passed.\n\nAs she told me when we were on our way to Texas: the thing that bothered her the most wasn't that our house had suddenly gone to hell, it was that I didn't even react to it. Instead, I tiptoed around the debris and started packing my things without a word.\n\nThis deeply unsettled her, and ultimately she asked me if I was safe where I lived. I said yes, as it was all I had ever known. She told me that what she saw frightened her, and she wanted me to come live with her in Texas. Thinking that she was joking, I brushed it off. After a few days down there though, I knew I had to do it. They showed me love, compassion, and care that I'd never even known existed prior to this and it shook me to my core.\n\nSo we decided, I was going to get emancipated from my parents and move in with them. Ultimately, this involved sitting in a courthouse across from my parents and their lawyer.\n\nThe judge asked why I wanted to leave, and I explained the above. I expressed the love and compassion I'd experienced for the first time in my life, and that I wanted to, for once, live in peace.\n\nTheir lawyer rebutted, \"To me, it seems as though you have no respect for your parents. Is it because of their financial situation? It looks as though you're attached to the perks of living in a family that makes a reasonable amount of money, and not that you want to leave because they're unfit parents.\"\n\nMy mother and father joined in, hooting and hollering actively trying to break me down as they have so many times before.\n\nI let him speak, I let them speak, and I held my tongue until it was my turn. They tried to goad me on, tried to break me as they had so many times before, but I wouldn't let them.\n\nFinally, the judge asked me to speak.\n\nWith as level a stare as I could muster, I looked at mother, my father, and their lawyer across from me and said \"If you're asking me if I have no respect for my parents, then you are correct. However, to say it's simply financially motivated is incorrect. I no longer have respect for them because they have-\"\n\nAs I was nearly finished, my mother, as she had so many times in the past began to squirm and scream at me from across the table. \"HE'S LYING THE LITTLE BASTARD IS JUS-\"\n\nUntil the Judge slammed his gavel down and cut the room; my mother staring up at him in complete and utter disbelief.\n\nI looked at her, keeping the tears I knew were right behind the corner at bay and said, \"For once in your life; for once in my life, behave as an adult. You can't stop me by simply yelling over me anymore, you have nothing to hold over me now. You can do nothing.\"\n\nAs I spoke, the judge motioned to his officer who moved towards my mother. Her expression still frozen in complete bewilderment as the officer aggressively told her to get up out of her chair and escorted her out of the room.\n\nThe judge looked to me, my aunt, my father, and his lawyer with one sweeping glance and then spoke.\n\n\"I am sorry that you have had to deal with this for so long young man. There's nothing more that you or anyone else needs to say. You deserve to live a normal life as a normal kid and it's obvious to me now that your parents are unfit to produce that kind of environment. You will go back to Texas with your Aunt, and we will regularly have our social workers in touch to check in on how you are doing. Make the most of this second chance, good luck young man. Adjourned.\"\n\nThough the bang of his gavel was the only noise that permeated the room, all I could hear was the ringing in my ears. My father and his lawyer were escorted out of the room and the tears I had held back all this time came gushing out like a tidal wave.\n\nIt's been 7 years since that day and I am happy to say that I've managed to grow up and become a well-adjusted adult. I have a great career, great friends, and an amazing girlfriend. I've been in therapy ever since we got back to Texas, and I no longer have trouble sleeping or terrible bouts of anxiety and depression as I used to.\n\nLife is good.\n\nTl;dr:\n\nMother is a narcissist with dissociative personality disorder addicted to opiates. Father kind of just went with the flow and didn't really do much. Aunt came down to take me to Texas, saw how shit everything was and asked me if I wanted to live with them. After some time I said yes, went to court against my parents under the pretense of emancipation, and got to stare them down and layout all the trauma, pain, and fear they've caused me. My mother was escorted out of the room when she tried to cut over me, and the judge sided with us and I was emancipated. Now I'm doing really well.",
                "labl": 631,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I worked at a Walmart as a cashier, and the assistant manager there was a dick, he would insult everybody working there and forced us sometimes to do work above our pay grade.  6 months later me and him got transferred to another Walmart that was just built and they needed to pick a manager and assistant manager some random got manager but I got assistant manager (I guess all the complaints on the assistant manager basically gave him a demotion) so one day he was ordering the other cashiers around then i pulled him to the side and told him that if he kept pulling the same shit around he would be out of here.  I haven't heard anything from him since.",
                "labl": 24364,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Pretty much every time my in laws come over. For over twenty years they have attempted to dictate how I should live my life, raise my kids, dress, cook, etc. I always just nod and say,\"I'll consider that\", but not in a genuine way, in a condescending \"fuck you\" way. When they press it, I simply say, \"You may leave my house now\".",
                "labl": 3435,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My friend has this awesome story from college:\n\nHe was a school \"president\", he was in charge of things, and had quite some power and responsibility. \n\nThis one time he had to organize a seminar which was pretty important especially because he was hosting. As he was going around making sure everything was running smoothly, he noticed a few students messing around and not rehearsing a speech they had to deliver. He questioned each of them on said speech and, as expected, none of them knew it well enough. So he asked them to start rehearsing but as reckless as freshmen students can get, they ignored the order. \n\nBeing fed up with them, my friend simply took their presentation and told them to leave. That's when one of them snapped back, \"You can't do that! You don't even know me, i know the president of the department!\", showing off illusions of the amount of power a 3rd grader has on a Thursday morning after a bowl of cereal. \n\nNaturally, my friend asked this schmuck to use their wild card and call the president. They took out their phone, started dialing and guess what happened next \n\nHis phone started ringing.\n\nNow I'll let you imagine the sheer horror in this kid's eyes, the shame on their face, the cringe and regret for the rest of their life.I have no idea how my friend kept a straight face.\n\nThis is one of my favorite \"you have no power here\" stories.",
                "labl": 1490,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The day after we signed the papers for our first house, we stopped by to move some things in. We pulled up to the house & saw the previous owner digging up the last 3 three plants in the front yard. She had pulled up everything else in the yard & loaded up the back of her pickup. It was packed. (It was a corner lot so there were multiple beds on two sides of the house.) When we asked her wtf she was doing, she said she had just planted them to make the house look nicer while it was listed for sale & that she really liked them & didn't want to have to but more for her new house. We got to meet the local cops that day. She had the choice of re-planting them all back exactly how they were before or get arrested. She spent the next 5+ hours making that shit right again. The cops said to call them when she was done & looked everything over before they let her go with the warning that if she ever came back she would be arrested. Never saw her again. Also found her weed stash on the top of the kitchen cabinets a few days later.",
                "labl": 187,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I had an elderly lady come into the pharmacy I work at when I was roughly 17. It’s a community pharmacy and all the patients and people in the community have been going there awhile, they know the owner and he knows them. She was acting really suspicious and terse with the employees, walking around shrinking away from people and shit. I saw her grab something and put it into her purse, a couple things of robutussin.\n\nI walk up to her and say “ma’am I need you to put that back or pay for it, and if you were wanting to sell that or use it to make something, it doesn’t even have the right ingredients” (I should clarify that this is in Clarksdale, MS one of the biggest meth and drug abuse places in the country)\n\nShe acts accosted and starts screaming that I need to unhand her and stop trying to abuse her and then “IM GOOD FRIENDS WITH THE OWNER AND I WHEN HE HEARS HOW RACIST AND ABUSIVE YOU ARE I HOPE YOU LEARN TO BE A PROPER MAN WHILE FINDING A NEW JOB!” \n\nSo I stayed in front of the door and calmly said “ma’am I’m sorry I’ve offended you. The owner is here today, actually.”\n\nShe walks back and starts hollering “where is Eric?! This young man is abusing me!” The owner rushed out, looked at me and said “what happened?” “She said “he accused me of taking medicine” and I looked at the bag. The owner and pharmacist looks at me then asks her “Did you take any?” She said “Mr. Eric I’ve known you since I moved here four years ago and I don’t like this little boy you have working for you. His mama didn’t teach him how to treat a lady!” To which he said “I think she did a fine job, she’s my wife. Let me see in your bag.”",
                "labl": 181,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "An old dude asked for my manager as soon as I came out of the back room, while I worked in the men’s shoe Dept at Macy’s. I think he was mad he was waiting for help for a while. We were closing so people were cleaning up and there were only 3 employees for the whole floor. Went ahead and called my manager and let him know she was on her way. He said “SHE?! I want to talk to the MAN in charge!” Well to his dismay... every single manager in our store was a woman up to even the store manager. He just left. Felt awesome. My manager eventually showed up and we laughed about it.\n*edited for clarity.",
                "labl": 326,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The first time I got to say my house, my rules to my dad after a lifetime of him saying it to me. It felt good.",
                "labl": 328,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Was pulled over by AZDPS and they tried to ticket me for speeding... on a highway smack dab in the middle of an Indian reservation. He asked to see my ID, my registration, and to search my car. All no’s. “Ok sir have a great day”",
                "labl": 383,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Worked in a military biological research lab for a while as a civilian contractor. Every time a new military officer rotated in as the department head (~2 year cycles) they'd try to boss around the civilians. We are legally allowed to ignore them. They **had** to filter requests through our civilian supervisors. HR supported us completely as it was a huge liability issue (read: lots of paperwork for them if anyone escalated an issue). Ever tell a power-tripping high-ranking US military officer \"no\"? Great stuff.",
                "labl": 371,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "US college prof here. My favorite “you have no power” moments all have to do with FERPA, a federal regulation that protects the privacy of college-level students. If someone like a parent wants to talk to me about a student’s progress in my class, I’m legally not allowed to do so without a waver (signed by the student), and even then it is mostly optional. \n\n\nI teach, predominantly, freshmen, so I get at least one Karen/Ken parent a year. However, because of FERPA, if they contact me, demanding to talk about their kid’s progress, I just say something akin to “I’m sorry, but according to FERPA regulations, I am legally not allowed to discuss [student name]’s work with you. However, I am more than willing to talk *directly* to them should they have any questions/problems.” \n\n\nI’ve had one or two parents try and go over my head, but it is a legal law, so they can’t work around it without the student’s permission (and that almost never happens). So, these parents come to me, thinking they’ll rage their way to what they want, but it is just completely useless because of FERPA.",
                "labl": 308,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My mother trying to force me to do stuff when she came and visited my dad's house.",
                "labl": 3303,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, I went to Reddit and found this post. Hello from 2015!",
                "labl": 19978,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Free VR interactive porn or ,,... whats the other one again",
                "labl": 12133,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "God isn't really a name though.",
                "labl": 117,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I started working for a welding company as an engineering manager. We were selling an extremely complex weldment (pressure tank that goes under the shitter) for 4.9K, out costs were 9.3K.  The owner took the bid \"to get in with this big company\". The owner legit said \"we'll make it up in volume\"... We weren't.\n\nAnyway the buyer for the larger company was a huge bitch and would regularly yell on phone calls. We sent them a letter that we would honor the last 5 tanks on the current PO at the same price (I didn't even want to do that) but after that they were going up to 10K per.\n\nShe drove down with her boss the next day and demanded an explanation and threatened to pull the business. I replied that we were losing 5K per tank and couldn't do it anymore. She demanded evidence which I already had pulled up and simply turned on the projector. I said, as you can see we cannot continue to make this part at such a huge loss and I don't think anyone can make it for the original price, so if you have to pull the business we understand. \"\n\nHer boss tripped over himself cutting her off and said they weren't pulling out and actually thanked us for honoring the current PO. I didn't have many run ins with her after that.",
                "labl": 2825,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Not sure if it fits but during an insanely busy weekend before Christmas, a Karen was complaining to every associate about how messy our store was. The manager had relieved the girl at the fitting room and was helping to hang stuff. Karen pulled her crap and was trying to make a point that we were messy and a horrible place to shop.\n\nAt the this manager told her roughly, \"Ma'am we're messy at the moment because we're a popular store. And the biggest reason we're messy is because of woman like you who can't be bothered to pick up after themselves. It's not the associates making the mess. It's people like you. Your type have us outnumbered.\"\n\nFirst time I actually witnessed someone deflate.",
                "labl": 8441,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "When I was in my very early twenties, I learned that my BF had cheated on me for months and the other girl was pregnant and keeping the baby. It was 100% certain and I was so traumatized by this that I broke up with him over the phone in about 15 seconds, *without revealing* *what I knew,* and then went hard no contact. I didn't even want to yell at him. I wanteed him to cease to exist. \n\nAbout a year later I ended up with a short-term contract with his company that was too good to pass up, so I did my best to avoid him until one day cornered me and started into me, in front of about six of his co-workers, about how it was shitty it was we couldn't just be friends, how immature I was to avoid him, and how I couldn't even be 'basically civil' to him. \n\nI blurted out \"Congratulations on the birth of your child. Remind me how old the babe is?' and ran from the room. \n\nHis coworkers put 2 and 2 together and I hear he didn't last much longer there.",
                "labl": 450,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Nintendo Directs. Then I'll make \"predictions\" for a lot of things Nintendo will do, but I'll phrase it in an increasingly implausible way. After a few Directs, people will hopefully catch on and start believing everything I say. After five years (assuming I can't look into the future again) I'll start making random shit up and watch the internet argue about my predictions. *Surely this can't be real… but his track record is impeccable!*",
                "labl": 11764,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "How long does it work for? If it is permanent, lottery numbers once or twice anymore and you would draw attention.then best tech developments and start ups to invest in. Locate the brightest and smartest graduates to come and work for you and enough dirt on politicians to let you get away with what your planning.",
                "labl": 14,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Obligatory “not a movie”, but this is one the many reasons Calvin and Hobbes is so great. Read it at 7, you see yourself in Calvin. Read it at 17, you see yourself in Hobbes. Read it at 30, you see yourself in the parents. And it works phenomenally well on all of those levels.",
                "labl": 358,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Not a teen movie, but The Simpsons.  \n\nWhen I was a kid, I identified with Bart: as far as I was concerned it was a show about Bart and everyone else was just a bit part.  But unlike anything else I watched, my Dad LOVED it too.  I didn't really understand, but it meant I got to watch more Simpsons, so great.\n\nI watched some clips recently, at about the same age my dad was and suddenly the person I identified with was Homer.  I mean he's a buffoon, but he's about the same age as me, has young kids like me, and a lot of the things that affect him are comic exaggerations of the real issues in my life.  For me, it's now the Homer show and Bart is just the kid.\n\nSo it took a couple of decades, but I get now what my dad saw in it.",
                "labl": 1712,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Failing is okay.",
                "labl": 8819,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "- if you don’t brush your teeth: big regrets.\n- don’t talk too much about yourself and your private life and ideas: it will be used against you.\n- emotionally you are going to feel better and survive the struggles you are into.\n- don’t breed anger, it will consume your time and energies.\n\nTime flies: I’m 38 years old, it seems yesterday I was in my twenties... enjoy the ride, take care of your body, don’t listen too much to the wired stuff coming from your mind.",
                "labl": 3887,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "TLDR: Turds\n\nObligatory wasn’t an elevator tech but hotel maintenance. \n\nGuest reports waterfall sounds in elevator shaft en route to the lobby. Investigation ensues. Sump pump at bottom of shaft is running constantly. Water is still coming out of the drain it’s connected to after I unplug it. Find out from notes of 3rd shift maintenance that multiple first floor rooms had repeated clogged toilets all night long. Plumber called.  6 inch sewer drain for the entire building is clogged. “Worst clog I’ve seen in 15 years.” Wash cloths and tp. Over 7 inches of clog in the pipe. Apparently it was clogged so bad that it was backing up into the laundry room, the drain for the elevator shaft and the rooms closest to the main pipe out of the building (first floor suites). \n\nSolid turds were left at the bottom of that shaft. I quit about a week later for unrelated circumstances.",
                "labl": 3136,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Yoshimi Battles The Pink Robots- The Flaming Lips\n\nEdit: thanks for all the awards!",
                "labl": 1742,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Morrowind",
                "labl": 406,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "In some aspects to the 60’s and 70’s when the Beatles were icons, (I’m talking about John Lennon) people who use his image and face for “peace” sometimes forget important details. \n\n\n-He abused women\n\n\n-He was a cheater\n\n\n-He abused his children (made one go completely deaf in one ear)\n\n\n-Total hypocrite on the “no possessions” when he lived one of the most lavish lifestyles of his time\n\n\n-compulsive liar\n\n\n\n-had a sexual appetite for his own mother \n\n\n-almost killed a few people (look up Bob Wooler, he was almost punched to death by John. There were others but their stories have either been disputed or unclaimed.)\n\n\n\nSo whenever I see a bunch of people sing *imagine* I just shake my head in shame cause so many people don’t even know how bad he was but act like he was a saint.",
                "labl": 5722,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Your neighbors don’t come knocking on your door to see if you want to come play.  Sometimes it’s days before you actually interact with another human.  It gets lonely fast",
                "labl": 42,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "My cat found me in the bush in the back of my house at 3am and wouldn't leave me alone. She headbutted me and rubbed into my legs as I stood there with the knife trying to get her to to away. Had her for 20 years until she passed 2 years ago. Something about her that night broke me out of the crushing darkness momentarily and allowed me to get therapy to deal with the problems. Love you Kiss",
                "labl": 1407,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I fully planned to kill myself until I wrote a song in G minor.\n\nAnd it was really, really beautiful. And I wanted to see if anything else that beautiful was in me.\n\nIn retrospect it was a really pretentious angsty piece of crap but it saved my life!",
                "labl": 8581,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "\"Oh jod\"",
                "labl": 589,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "God isn't really a name though.",
                "labl": 117,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Would Satan make an announcement that it’s pronounced sah-tin instead of say-tin",
                "labl": 12,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "A while back, I got a job as a popcorn monkey in the local cinema, as a temporary thing while I figured out what the fuck I was doing with my life.\n\nThere was a supervisor that had worked there since the site opened (around 5 years) who was a total bitch and had had numerous complaints about her from countless staff.\n\nIn the first week, I nearly quit because of her attitude - as an example one night I was on a close, and basically cleaned the entirety of the front of house on my own. I stopped to take a drink of water and she marched up to me going \"WE DON'T PAY YOU TO STAND AROUND DRINKING YOU KNOW!\" to which I calmly responded that I was thirsty, and needed a drink of water, and if she wanted to tell me I wasn't allowed to have a glass of water then good luck, but I'm pretty sure health and safety would have something to say about that. She huffed about not having had a break all day, which I ignored cos not my fucking problem, but internally I was put out about it, because it was totally fucking pointless to be such a twat about things.\n\nAbout 2 weeks in I get promoted to Supervisor as I was clearly extremely competent by their usual standards (I could walk and fart at the same time) but she also gets promoted to Floor Manager, so she continues to work her little power trips and try and lord it over me (and everyone else)\n\n4 weeks after that, I get another promotion to Floor Manager, and at this point we're equals, so she can't boss me around anymore. So instead, she tries a different tack, which is to try and lord it over me with her superior knowledge of processes, where to find stuff etc.\n\nMy response is to go (saccharine sweet) \"Oh thanks! That's so helpful, I mean you know how things work so much better than me, because you've been here 5 years, and I've only been here 6 weeks...\"\n\nShe had a face like a smacked arse. It was delightful :)",
                "labl": 1144,
                "true_bin": 1,
                "pred_bin": 2
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "Ghislaine Maxwell suicide date",
                "labl": 4494,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "School of rock. Like wtf an adult impersonating a teacher and taking kids to places where they shouldn’t be and none of their parents knew where they were",
                "labl": 348,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "This is a little more niche, but Bill Wilson, the founder of alcoholics anonymous.\n\nThe guy did great things, and created a program of recovery that has saved millions of lives since it's inception 85 years ago.\n\nHe was also an arrogant ass hole that cheated on his wife even in sobriety.\n\nEdit: This isn't here to scare away anyone that's trying to get sober. I've been sober thanks to AA for 5 1/2 years. So don't let this keep you away if you're struggling with your drinking.",
                "labl": 13565,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My cat\n\neta: thank you for the gold :3 my cat is indeed my little reason for being.",
                "labl": 187,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Just a casual fan of this one but that Christopher Walken knows whether Natalie Wood's death was an accident or not.",
                "labl": 9147,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Britney is the highest profile disney rape victim we might probably ever know about.  Her mental breaks were the result of sexual and physical abuse from her handlers, her parents, and people she worked with at disney.  The conservatorship she's been trying to get lifted is one designed to keep her silent, because the momentum of the #meToo movement as well as the high profile cases against hollywood folks will result in a huge financial hit to disney.\n\nIf we hear that Britney \"couldn't take it any more\" and killed herself, its most likely the result of everyone in her life trying to control and manipulate her, and they will likely kill her under guise of suicide.",
                "labl": 10179,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "ENGLISH! I used to be terrible and my accent still sucks sometimes, but after more than 20 years of practice and a bachelor degree from an English university, now I'm quite proud to be bilingual.",
                "labl": 16230,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Talk to executive level audiences.... always made me feel weird in the past because they were so senior to me. Now, I’m a bit older and a bit wiser. I have more experience and exposure to C-suite level folks. Most of them are really nice, down to earth people.\n\nI also now talk to my dog in public, so take my previous statement how you’d like relative to this statement. IDGAF if you think it’s weird anymore about my talking to my dog like he’s a person. He understands what I’m saying most of the time.",
                "labl": 453,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "In India, you’re looked down upon if you listen to Hindi music, read Hindi books or are a fan of Bollywood. \n\nGrowing up I felt the need to completely westernise myself- listen to English music exclusively, only watch Hollywood movies, the whole shebang. \n\nSince last few years, I’ve been embracing my native language and my culture. It’s taken a lot of rediscovering my past, amazing movies I missed out on because I was too cool to watch them, Hindi music that I was too cool to play on the speaker. \n\nIt’s liberating to embrace your roots.",
                "labl": 144,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "He farted very loudly and proceeded to say, “you got the wrong guy”",
                "labl": 6021,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My boyfriend woke me up the other day by gently putting his fingers in my mouth and I kept moving my head out of the way until eventually I was like “can you stop that!!!”\n\nHe then sounded genuinely upset and asked why I woke him up as he was having a really nice dream about feeding a deer. Brilliant.",
                "labl": 5040,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My ex husband talked in his sleep every night. Our daughter began babbling in her sleep as a baby and still talks in her sleep pretty much every night. Occasionally they yell out. One night when I was still with my ex, I was right on the edge of falling asleep. He yelled out so loudly CHICKEN SANDWICH!!! and scared me half to death.",
                "labl": 881,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My husband one night- said to me very clearly and in a very serious tone... “David Beckham knows the future”",
                "labl": 142,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "As a resident of Western Australia, where the majority of the battles have taken place, I am constantly reminded of this ongoing conflict. Every day I see emu's, every day emu's see me. We see each other as enemies, yet we are the same. Two species grown to fight amongst each other, based on the mistakes of our forefathers. Our emotions, our feelings, our hatred, all defined by our history and surroundings. It has defined our past, it defines our present. However, when I see these flightless aviarians, I see not a faulted species, but a mirror of ourselves. We have only known this conflict, but we shall not be defined by it. Neither of our species can fly. But with peace as a possibility, perhaps we can both soar...",
                "labl": 1493,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "\"being Infront of that damn computer won't get you a job\"",
                "labl": 518,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Talking Heads, *Remain in Light*",
                "labl": 6697,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "While he almost certainly wasn't the first to say it, Lord Acton once observed that \"Great men are almost always bad men.\"  Pluck any great man from history - those rare figures about whom the story of the human race seems to turn - and you find a monster who changed the world, probably without even intending to do so.",
                "labl": 20264,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I remember reading somewhere where someone was suicidal in a forum saying they were going later that day or something and everyone was talking about it and someone replied something along the lines of,\n\n\n“Why don’t you just go? I’ve always wondered this about people who are suicidal. If you’re really done then why don’t you leave everything behind? Start walking in a direction and just go. It doesn’t matter where you end up or if you get killed along the way because that’s what you were trying to do anyway.” \n\n\nSomething about that really resonated with me. Those of us with nothing to lose have everything to gain from this world.",
                "labl": 1765,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "When my gran died I had been suicidal for over a year and when I lost her I just felt so selfish cause life without her was so much worse... and I don’t know it just sent me into a spiral or well what else am I missing. I can live for her it’s what she would have wanted ... and I decided to give it a few years ... I’m now 20 graduating college next year and getting married in two weeks \n\nMy health both psychical and mental has changed so much but I still miss her so much everyday. She was a gift I didn’t recognize until she was gone and for that I’m forever shameful",
                "labl": 131,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Barking at men catcalling me",
                "labl": 1785,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not a partner story but when I was a kid I was in the kitchen late one night getting a drink when suddenly I hear THUD THUD THUD THUD as someone started fucking sprinting down our hallway and my sister bursts into the kitchen and just stands there staring, asleep with her eyes open. Scared the ever living shit out of me.",
                "labl": 131,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "It’s so hard... *sniffs* some days we just cant get our milo because the emus have placed road blocks from Darwin to Cairns. At night we cant sleep with the gun fire going off in the background. We’ve taken to poisoning the emus food supplies with large spoonfuls of vegemite. (If you ever eat vegemite, THINLY spread it over toast or bread, THINLY) just last week we found that the emus had recruited some dingos. *starts to cry* and me younger brother was eaten by ‘em. *starts bawling*.............*suddenly stops crying* but enough about me, how ya goin’?",
                "labl": 9,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Probably watching a few Texas DPS Officers realize they couldn't shut down a whole airport.\n\nI was working as a flight instructor at small airport on a Saturday afternoon.  We had one plane that had an issue on takeoff and veered off the runway, it cartwheeled and totaled the airplane but fortunately the pilot was not serious injured.  I had a student who was next in line for takeoff when it happened, he called me from his phone as it happened.  I hopped in the airport car with one of the rampers and drove out to the plane with a radio to inform inbound planes to use the other runway (we had no control tower).  On the way to the runway I called the airport manager who drove to the airport and on his way he made a phone call to officially closed that runway.\n\nAbout 30 minutes later a metric fuckton of DPS officers showed up and immediately tried to close the whole airport, treating it like a giant crime scene.  They were carelessley driving around the airport like they owned the place, ignoring the planes that were moving around, and crossing our only open runway without regard to inbound traffic.  A mechanic and I tried to tell them to be careful and they got mad at us.  One of them told me they were \"locking it down\" a couple times, meaning the whole airport.  Now I was a broke ass flight instructor and I had a flight that afternoon that was ultimately going to help pay for me to eat that week.\n\nThe airport manager was a short stereotypical country guy, also former Navy.  He was not intimidated at all by the cops trying to close his airport.  When he showed up I was about to go out with a student who was preflighting for a cross-country.  There were about 5 cops in the lobby, me with my flight bag, the airport manager, and a mechanic.  One of the cops saw my flight bag and said \"I don't know why you have that or why he's out a the plane, you aren't going anywhere\", the moment he finished his sentence the airport manager said \"it's one runway that's closed, the airport is still open.  This pissed off the cops.\n\nI was about to head out the door, and one of the officers said he was driving out to the disabled plane.  Idky, the pilot had been gone for about an hour.  The mechanic said \"you need to be careful\" and the cop quickly retorted \"AND WHY THE HELL IS THAT?\" and he said \"because this is still an airport, and the first thing that hits you is going to be a propeller\" a few seconds later a plane took off as one of the cars was approaching the runway intersection ironing in that point.\n\nI walked out, and as I was hopping in the plane with my student the same cop came up to me and said \"you aren't going anywhere, we're locking this down!\"  I looked at the airport manager who followed all of us out to the ramp, he said \"have a nice flight AjaxBU!\" \n\nYou could see these cops just fuming that they didn't have the authority to close down an entire airport because one plane went off the runway.   The airport had two runways, where the disabled plane was located was probably a mile or so away from the open runway.  Why they were making a big fuss, I don't know.  The occupant was relatively uninjured, his wife was the worst thing he had to deal with that day, he told her he wasn't going to fly.\n\nWe had a good flight, and I got to eat dinner that week.",
                "labl": 7674,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I was a salesman at a wire and cable place. I got a call Friday morning from a tow truck driver freaking out. He needed a replacement cable for his truck ASAP because the weekends were the big business days for him, bragging about the big money in people who leave their cars somewhere overnight because they're too drunk to drive home. He was shitty and rude the whole time we were on the phone. He demanded that the cable be cut and shipped immediately, sent next day air, saturday delivery (pretty expensive). I rushed his order, ran back to the warehouse to hand it to the manager myself to make sure it could jump in line and get cut before the next day air guy showed up. But we did it, rushed every part of it and got it shipped out in time. Every person involved prioritized this order to get it out to him on time.\n\n\nTow truck dude calls me back later that afternoon saying he got the truck working and no longer needs the cable. He asks to cancel the order and get a refund. I explain to him that because he had it cut to a specific length, if we were to take it back, there would be a restock fee (because we're not going to be able to resell it until someone needs that exact specific length). I also explain that I can't refund the shipping costs because the order has already been shipped the way he demanded it be sent out.\n\n\nDude loses his mind. Screaming at me telling me he's going to give the company terrible reviews everywhere and tell all his friends how we're all pieces of shit. There was literally nothing I could do for him. No amount of him being an asshole could uncut and unship that order.",
                "labl": 333,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "A co-worker friend of mine was flying back from a sales conference in Vegas and he was able to upgrade to a first class seat.  We had this bitch sales VP that was on the same flight - she was the snobby, entitled type with a full time nanny and giant McMansion in the suburbs, and she generally treated people who worked for her like servants.\n\nShe sees him in a first class seat as she is making her way to coach and asks him how he got that seat (he used points to upgrade).  As people are getting settled in, she makes her way back up to the first class cabin and asks to speak with the lead flight attendant.  She tells him that one of her underlings is sitting in first class, and that she needs to switch with him since she's higher on the corporate ladder.  \n\nThe guy can't believe what he's hearing, but she won't take no for an answer.  Finally he tells her she has to go back to her seat, or she will be escorted from the plane.  She made a complete ass of herself in front of the whole first class cabin.",
                "labl": 42116,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My dad had just finished his 4 years in the army when a higher up saw him out and about with his bdu pants and a rock Tee on. The higher up started to yell at him about why he wasn't dressed up and my did flipped him off and said he had been out for weeks. Must be refreshing",
                "labl": 232,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I'd try to be like Bill Murrays character by the end of Ground Hog day. Find out if there's any needless deaths from preventable accidents that I may be able to change. Obviously I'd have won the lotto too, this would give me plenty of resources and free time to become a local superhero\n\nEdit: based on the show Early Edition from the 90s.",
                "labl": 14173,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I watched Sixteen Candles recently and I now do not approve of Samantha going anywhere near Jake Ryan.",
                "labl": 3519,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Maybe it's because I'm not American, but what's the whole point of gender reveal parties?! It's such a waste of money.",
                "labl": 379,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "This isn’t an ask reddit, it’s just a bit",
                "labl": 24,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "You don't matter. \n\nI don't matter.\n\nNone of us matter.\n\nKill your ego, feed your soul.",
                "labl": 449,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Spelling matters.",
                "labl": 120,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Obviously you haven’t heard of half the relationships in the military",
                "labl": 122,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Mostly unnecessary here in Canadaland.",
                "labl": 4,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I just need a friend to make phone calls for me.... my anxiety wont let me.",
                "labl": 4,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Not an elevator technician, but I can tell you some dude, at some point is going to find a kindle at the bottom of a shaft in a Toronto hotel elevator. \n\nRules to remember: \nRule #1: Always check that you zipped your carry-on and didn't leave a gap in the bottom\nRule #2: Kindles fit through small carry-on bag zipper gaps and elevator shaft gaps",
                "labl": 321,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "a purple dildo, it was kinda weird. so I just left it, so the next guy will also have the joy of finding it\n\nEdit: I did not expect this to blow up like this lol",
                "labl": 2325,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Boston- Boston",
                "labl": 5452,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Pure Heroin - Lorde",
                "labl": 973,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Super Hexagon\n\nPapers please",
                "labl": 1376,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Rimworld. Edit join us at r/RimWorld",
                "labl": 7834,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "FDR. Gets a lot of credit for steering the US through the Great Depression and WW2, but committed one of the greatest violations of people's rights in US history when he interned tons of Japanese-Americans.",
                "labl": 2197,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    }
]