[
    {
        "correct": [
            {
                "sent": "What next?? Haven't we had enough for 1 year already?",
                "labl": 2775,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "As someone not in the US, can someone explain the implications of this and why this is such a big deal? Thanks in advance",
                "labl": 179,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, for starters, my area was stolen from the emus when we drove them off the land, we've built a fine community in its place. The emus have yet to take this land back, until then, I have yet to see a wild emu anywhere near here.\n\nIf it were not for the war, I wouldn't be where I am today.",
                "labl": 1575,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, this might be a long one.\n\nI grew up around a mother with dissociative disorder as well as narcissism. She was addicted to opiates as far back as I can remember, and would do anything to get them, and I mean anything.\n\nGrowing up, it wasn't rare for her to have a tantrum during one of her highs and beat the shit out of me, break me down by picking apart every little thing she knew I was afraid or self-conscious of, and actively sabotage my relationship with my father and siblings.\n\nShe would be up for days at a time, pass out standing up with her eyes glassed over and back hunched, and when she festered once again start moving and otherwise destroying everything in the house.\n\nThere were times where I'd leave and the house would be clean, and come home and it would look as though a pissed off tornado had run through the house i.e. broken glass, animal feces, dirty clothes, roaches, empty pill bottles, ground-up pill residue, and other miscellaneous things littering the house. On particularly bad nights she would hallucinate, and during those times it wouldn't be uncommon to find pools of her blood on the ground from running through glass.\n\nI remember being up for days at a time because her and my father would scream at each other for days at a time without stopping; actively trying to get me to pick one side or the other even if it meant barging into my room at 4 am to begin their screaming match where I could watch.\n\nShe manipulated me, abandoned me at times in the middle of nowhere when she'd meet up with her various sugar daddies (she was still with my dad during this), and never once apologized during her brief moments of mental clarity. If anything, she would blame everything but herself. In her mind she was infallible.\n\nMoney was always a big issue since she couldn't work in such a state. She sold some of her pills, yes, but ultimately those funds were used to buy more drugs anyway. Because of this, we were homeless frequently, without power and water for literally years at a time, and barely ever had any food. It was almost every night I went to sleep with the only thing I'd have eaten that day being a school lunch. On weekends, sometimes I didn't eat at all.\n\nThe rest of my family had no clue this was happening. During the summer when I was 16, my aunt whom I hadn't talked much with since I was a lot younger got in touch. She asked if I'd like to come to stay with them in Texas for a few weeks during the summer.\n\nOf course I said yes, and I was absolutely ecstatic. I didn't bother asking my parents since I'd be very much surprised if they even noticed I was gone so they were unaware. My aunt drove up all the way to Iowa and stayed the afternoon with us.\n\nMy parents seemed to lack the cognition to recognize she was even there out of the blue so they didn't come out of their room. As I stated before would happen frequently, when she arrived our house was fairly clean. We left for a bit to go get food, and when we returned the tornado had already passed.\n\nAs she told me when we were on our way to Texas: the thing that bothered her the most wasn't that our house had suddenly gone to hell, it was that I didn't even react to it. Instead, I tiptoed around the debris and started packing my things without a word.\n\nThis deeply unsettled her, and ultimately she asked me if I was safe where I lived. I said yes, as it was all I had ever known. She told me that what she saw frightened her, and she wanted me to come live with her in Texas. Thinking that she was joking, I brushed it off. After a few days down there though, I knew I had to do it. They showed me love, compassion, and care that I'd never even known existed prior to this and it shook me to my core.\n\nSo we decided, I was going to get emancipated from my parents and move in with them. Ultimately, this involved sitting in a courthouse across from my parents and their lawyer.\n\nThe judge asked why I wanted to leave, and I explained the above. I expressed the love and compassion I'd experienced for the first time in my life, and that I wanted to, for once, live in peace.\n\nTheir lawyer rebutted, \"To me, it seems as though you have no respect for your parents. Is it because of their financial situation? It looks as though you're attached to the perks of living in a family that makes a reasonable amount of money, and not that you want to leave because they're unfit parents.\"\n\nMy mother and father joined in, hooting and hollering actively trying to break me down as they have so many times before.\n\nI let him speak, I let them speak, and I held my tongue until it was my turn. They tried to goad me on, tried to break me as they had so many times before, but I wouldn't let them.\n\nFinally, the judge asked me to speak.\n\nWith as level a stare as I could muster, I looked at mother, my father, and their lawyer across from me and said \"If you're asking me if I have no respect for my parents, then you are correct. However, to say it's simply financially motivated is incorrect. I no longer have respect for them because they have-\"\n\nAs I was nearly finished, my mother, as she had so many times in the past began to squirm and scream at me from across the table. \"HE'S LYING THE LITTLE BASTARD IS JUS-\"\n\nUntil the Judge slammed his gavel down and cut the room; my mother staring up at him in complete and utter disbelief.\n\nI looked at her, keeping the tears I knew were right behind the corner at bay and said, \"For once in your life; for once in my life, behave as an adult. You can't stop me by simply yelling over me anymore, you have nothing to hold over me now. You can do nothing.\"\n\nAs I spoke, the judge motioned to his officer who moved towards my mother. Her expression still frozen in complete bewilderment as the officer aggressively told her to get up out of her chair and escorted her out of the room.\n\nThe judge looked to me, my aunt, my father, and his lawyer with one sweeping glance and then spoke.\n\n\"I am sorry that you have had to deal with this for so long young man. There's nothing more that you or anyone else needs to say. You deserve to live a normal life as a normal kid and it's obvious to me now that your parents are unfit to produce that kind of environment. You will go back to Texas with your Aunt, and we will regularly have our social workers in touch to check in on how you are doing. Make the most of this second chance, good luck young man. Adjourned.\"\n\nThough the bang of his gavel was the only noise that permeated the room, all I could hear was the ringing in my ears. My father and his lawyer were escorted out of the room and the tears I had held back all this time came gushing out like a tidal wave.\n\nIt's been 7 years since that day and I am happy to say that I've managed to grow up and become a well-adjusted adult. I have a great career, great friends, and an amazing girlfriend. I've been in therapy ever since we got back to Texas, and I no longer have trouble sleeping or terrible bouts of anxiety and depression as I used to.\n\nLife is good.\n\nTl;dr:\n\nMother is a narcissist with dissociative personality disorder addicted to opiates. Father kind of just went with the flow and didn't really do much. Aunt came down to take me to Texas, saw how shit everything was and asked me if I wanted to live with them. After some time I said yes, went to court against my parents under the pretense of emancipation, and got to stare them down and layout all the trauma, pain, and fear they've caused me. My mother was escorted out of the room when she tried to cut over me, and the judge sided with us and I was emancipated. Now I'm doing really well.",
                "labl": 631,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Probably watching a few Texas DPS Officers realize they couldn't shut down a whole airport.\n\nI was working as a flight instructor at small airport on a Saturday afternoon.  We had one plane that had an issue on takeoff and veered off the runway, it cartwheeled and totaled the airplane but fortunately the pilot was not serious injured.  I had a student who was next in line for takeoff when it happened, he called me from his phone as it happened.  I hopped in the airport car with one of the rampers and drove out to the plane with a radio to inform inbound planes to use the other runway (we had no control tower).  On the way to the runway I called the airport manager who drove to the airport and on his way he made a phone call to officially closed that runway.\n\nAbout 30 minutes later a metric fuckton of DPS officers showed up and immediately tried to close the whole airport, treating it like a giant crime scene.  They were carelessley driving around the airport like they owned the place, ignoring the planes that were moving around, and crossing our only open runway without regard to inbound traffic.  A mechanic and I tried to tell them to be careful and they got mad at us.  One of them told me they were \"locking it down\" a couple times, meaning the whole airport.  Now I was a broke ass flight instructor and I had a flight that afternoon that was ultimately going to help pay for me to eat that week.\n\nThe airport manager was a short stereotypical country guy, also former Navy.  He was not intimidated at all by the cops trying to close his airport.  When he showed up I was about to go out with a student who was preflighting for a cross-country.  There were about 5 cops in the lobby, me with my flight bag, the airport manager, and a mechanic.  One of the cops saw my flight bag and said \"I don't know why you have that or why he's out a the plane, you aren't going anywhere\", the moment he finished his sentence the airport manager said \"it's one runway that's closed, the airport is still open.  This pissed off the cops.\n\nI was about to head out the door, and one of the officers said he was driving out to the disabled plane.  Idky, the pilot had been gone for about an hour.  The mechanic said \"you need to be careful\" and the cop quickly retorted \"AND WHY THE HELL IS THAT?\" and he said \"because this is still an airport, and the first thing that hits you is going to be a propeller\" a few seconds later a plane took off as one of the cars was approaching the runway intersection ironing in that point.\n\nI walked out, and as I was hopping in the plane with my student the same cop came up to me and said \"you aren't going anywhere, we're locking this down!\"  I looked at the airport manager who followed all of us out to the ramp, he said \"have a nice flight AjaxBU!\" \n\nYou could see these cops just fuming that they didn't have the authority to close down an entire airport because one plane went off the runway.   The airport had two runways, where the disabled plane was located was probably a mile or so away from the open runway.  Why they were making a big fuss, I don't know.  The occupant was relatively uninjured, his wife was the worst thing he had to deal with that day, he told her he wasn't going to fly.\n\nWe had a good flight, and I got to eat dinner that week.",
                "labl": 7674,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "TL;DR a pair of angry moms threatened legal action if I fired their useless kids.\n\nI work for a trampoline park franchise. We opened a sister location that I ran for about a year and a half before moving back to take over the old location.\n\nWhen I got back, a lot needed fixing but in particular there were 2 teenage employees that had been fired/suspended on numerous occasions. They were generally lazy, rude jackasses that shouldn’t have been hired in the first place. Problem was, they both had aggressive helicopter moms that intimidated the manager into rescinding any punishments.\n\nOnce I came back, I took stock of our employees and had a long talk with the entire leadership team. I learned which employees caused which problems, who was unreliable, who had a regular habit of skipping shifts, texting on shift, etc. I fired about a half dozen that first week, including those two I mentioned. That night, both moms called my personal cell to scream at me (our numbers are listed in the online scheduling tool so employees can find shift covers more easily).  They demanded to know why I fired them, threatened to sue, have me arrested, accused me of discrimination (against their white middle-class sons), etc.\n\nI simply asked, “Is your son over 18? Yes? So you’re demanding I illegally release personal information regarding a former adult employee? Bye”",
                "labl": 180,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "So my uncle is a deputy sheriff, and one time he was at an airport talking to my aunt over the phone in spanish. Once he got done with his call some nearby Karen that overheard him went up to him and started demanding to see his green card (uncle has an accent too so you can tell he's wasn't born in the US). Uncle decides to fuck with her and tells her he doesn't know what a green card is and has never heard of one. She gets more pissed and keeps demanding to see it. He messes with her some more then eventually he goes \"Well I don't got a green card but I got this\" then takes out his wallet and shows her his badge. She immediately walked away while my uncle laughed his ass off.",
                "labl": 2598,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A co-worker friend of mine was flying back from a sales conference in Vegas and he was able to upgrade to a first class seat.  We had this bitch sales VP that was on the same flight - she was the snobby, entitled type with a full time nanny and giant McMansion in the suburbs, and she generally treated people who worked for her like servants.\n\nShe sees him in a first class seat as she is making her way to coach and asks him how he got that seat (he used points to upgrade).  As people are getting settled in, she makes her way back up to the first class cabin and asks to speak with the lead flight attendant.  She tells him that one of her underlings is sitting in first class, and that she needs to switch with him since she's higher on the corporate ladder.  \n\nThe guy can't believe what he's hearing, but she won't take no for an answer.  Finally he tells her she has to go back to her seat, or she will be escorted from the plane.  She made a complete ass of herself in front of the whole first class cabin.",
                "labl": 42116,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Not sure if it fits but during an insanely busy weekend before Christmas, a Karen was complaining to every associate about how messy our store was. The manager had relieved the girl at the fitting room and was helping to hang stuff. Karen pulled her crap and was trying to make a point that we were messy and a horrible place to shop.\n\nAt the this manager told her roughly, \"Ma'am we're messy at the moment because we're a popular store. And the biggest reason we're messy is because of woman like you who can't be bothered to pick up after themselves. It's not the associates making the mess. It's people like you. Your type have us outnumbered.\"\n\nFirst time I actually witnessed someone deflate.",
                "labl": 8441,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "One of the managers at my previous employer was living near me. I was not reporting to her, but my manager was sitting right next to this woman so I had to see her multiple times every day. One day she found out that I lived on the same street as her, and started forcing me to visit her. I kept making excuses, but at one point I couldn't come up with any more excuses. \n\nSo I visited her. She sat me down and asked me why I was renting a house by myself, what caste my room mate was, and told me not to have \"lower caste\" people room with me, all the while subtly trying to find out what caste I was. I hated her. I couldn't really do anything about what she spoke because the HR was not even taking sexual harassment complaints seriously, let alone this one. \n\nAlso it turned out, my apartment's owner was friends with this woman and she had a spare key to my apartment that she stored on behalf of the owner who lived abroad. If she found out that I was in a relationship with someone not from my caste, then she could tell the owner and they could have kicked me out for being sinful in their house.\n\nIn few months, I found a better job and I gave my notice at that workplace. I was also getting married in few weeks, so I was moving out of that house. Although I didn't expect anyone from that office to attend my wedding (my wedding was held in a different state), it's kind of disrespectful in our culture if you don't invite everyone you know. It was my last day in that organization, and I was going around giving wedding invites to everyone. \n\nWhen I went over to my manager's desk, this lady was all smiling and waiting to get the invitation next. I simply invited my manager, then smiled at this woman, and walked away. Also, I invited everyone in my apartment except my house owner who specifically requested that I mail her my invite. My house owner called me after I vacated and asked where the invite was. I told her that I forgot and didn't have any left.\n\nBoth of them didn't hold any power over me anymore and both my employment and my housing situation were not in their control so they could really do nothing about me disrespecting them.\n\nThis might not be much, but it felt so good when I did it.",
                "labl": 351,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "This moment happened a couple days ago. I was at work and I saw one of my old waterpolo coaches at one of our pools (I’m a lifeguard) with his team. A little detail about this coach is that he’s kind of an asshole and discriminated players for which high school their going to (he paid special attention to a certain high school, since he was the waterpolo coach there too). I decided to come watch since I was off for the rest of the night, but needed to stay around until the facility completely closed. I don’t know if he recognized me, but he got annoyed that I was standing there in his field of vision watching the practice. He told me to leave and that everything is fine now, and I politely explained that I am just watching. He more agitatedly asked me to go away, which I explained I worked here and I can stand wherever I want, since this isn’t your pool, but rather the employee’s. He eventually asked for my manager, which coincidentally hated this coach too, and got a good talking to. He’s been giving me dirty looks the rest of the night. Can’t wait to work night shifts again to see him :)",
                "labl": 339,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The first time I got to say my house, my rules to my dad after a lifetime of him saying it to me. It felt good.",
                "labl": 328,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My first job was at the box office of a movie theatre. The rule was you had to be 18 to see a Rated R movie but you could go see if a parent/guardian was somewhere in the building seeing a different movie. A mom tried to buy tickets for her daughter and friends to go see one. I explained the rules and she was enraged. She demanded to see the manager who explained the rules and refused the sale. Finally, she tried to claim that the sale should happen because her husband is a doctor. I just laughed.",
                "labl": 315,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My dad had just finished his 4 years in the army when a higher up saw him out and about with his bdu pants and a rock Tee on. The higher up started to yell at him about why he wasn't dressed up and my did flipped him off and said he had been out for weeks. Must be refreshing",
                "labl": 232,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Heavy update there yet?",
                "labl": 389,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My name + obituary. \n\nIf I get more searches? 2020, 2024 election results. COVID vaccine FDA approval parent company. TSLA, GOOG, APPL, FB prices.",
                "labl": 4726,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Like a fax from future me?\n\nDo not drink that coffee!",
                "labl": 871,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Bold of you to assume we’ll make it another 5 years",
                "labl": 1965,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "COVID vaccine",
                "labl": 918,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I...I already have B, I just can't see them.  They live in my head.\n\n*Cries in Social Anxiety Disorder, wipes tears with Clinical Major Depression*",
                "labl": 73,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I'm 35 and teen movies from the 80s seem to be the worst offenders. I can't stand the concept of Ferris Bueller as a person. \n\nAlso, as a huge fantasy fan, I'm starting to agree more and more with the wise wizard/teacher/professor/etc. that's like, \"Hey Protagonist, just chill and learn some stuff.\"",
                "labl": 3196,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "All the “JIF” people would be really happy",
                "labl": 151,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "People's names are their own, and the owner of the name is the exclusive authority on its pronunciation. Anyone who doesn't listen to someone when they inform how to pronounce their name is an asshole.",
                "labl": 154,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I'm not american, what does this mean for you guys?",
                "labl": 10933,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Yeah, a megathread is probably best for this. RIP to her.",
                "labl": 3795,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "As a resident of Western Australia, where the majority of the battles have taken place, I am constantly reminded of this ongoing conflict. Every day I see emu's, every day emu's see me. We see each other as enemies, yet we are the same. Two species grown to fight amongst each other, based on the mistakes of our forefathers. Our emotions, our feelings, our hatred, all defined by our history and surroundings. It has defined our past, it defines our present. However, when I see these flightless aviarians, I see not a faulted species, but a mirror of ourselves. We have only known this conflict, but we shall not be defined by it. Neither of our species can fly. But with peace as a possibility, perhaps we can both soar...",
                "labl": 1493,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "A while back, I got a job as a popcorn monkey in the local cinema, as a temporary thing while I figured out what the fuck I was doing with my life.\n\nThere was a supervisor that had worked there since the site opened (around 5 years) who was a total bitch and had had numerous complaints about her from countless staff.\n\nIn the first week, I nearly quit because of her attitude - as an example one night I was on a close, and basically cleaned the entirety of the front of house on my own. I stopped to take a drink of water and she marched up to me going \"WE DON'T PAY YOU TO STAND AROUND DRINKING YOU KNOW!\" to which I calmly responded that I was thirsty, and needed a drink of water, and if she wanted to tell me I wasn't allowed to have a glass of water then good luck, but I'm pretty sure health and safety would have something to say about that. She huffed about not having had a break all day, which I ignored cos not my fucking problem, but internally I was put out about it, because it was totally fucking pointless to be such a twat about things.\n\nAbout 2 weeks in I get promoted to Supervisor as I was clearly extremely competent by their usual standards (I could walk and fart at the same time) but she also gets promoted to Floor Manager, so she continues to work her little power trips and try and lord it over me (and everyone else)\n\n4 weeks after that, I get another promotion to Floor Manager, and at this point we're equals, so she can't boss me around anymore. So instead, she tries a different tack, which is to try and lord it over me with her superior knowledge of processes, where to find stuff etc.\n\nMy response is to go (saccharine sweet) \"Oh thanks! That's so helpful, I mean you know how things work so much better than me, because you've been here 5 years, and I've only been here 6 weeks...\"\n\nShe had a face like a smacked arse. It was delightful :)",
                "labl": 1144,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "The guy that i'd gone on a few dates with introduced me to his parents, things went well, or so i thought. \n\nhe drives me home, we end up talking and drinking a few beers, i didn't want him on the road with any alcohol in his system, and i enjoyed his company, so we end up hanging out until 3am. His mom starts blowing up his phone, demanding that he comes home, so he drives himself home to find that he's been locked out of his house. His mom said that he can sleep outside, he shouldn't be spending time with someone like me (still don't know what she meant by that), and that i'm \"just another stop on the pussy train\". He tells her not to talk about me like that, to which she says \"when you're under my roof, i'll say whatever i want about whoever i want!\"  so he picks up his phone, calls me, asks if he can stay at my place for a little while. \n\nIt's been seven years, we're engaged, have a dog, a cat, and a happy life. \n\ni also plan on throwing some subtle train themes into the wedding/celebration after the end of the plague.",
                "labl": 6846,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "When I was in high school I worked at popular warehouse club selling computers on the weekends. I was hired by the store manager via referral of a friend. I loved computers and they thought I'd make a good salesman, so my job was to stay in the computer department and sell computers; nothing else.\n\nWell, one of the shift managers didn't like that, and started insisted that I needed to go fold clothes for a while. As in, half my damn shift. I told him that the store manager had instructed me never to leave the technology department, but he insisted. This went on for several weeks.\n\nThe store manager showed up one weekend when both the power trippin shift manager and I were working. The store manager walks up with the shift manager close behind. Store manager slaps a stack of [greenbar paper](https://www.google.com/search?client=safari&rls=en&ei=iiBuX4PQEoqc5gL8gJLQCg&q=greenbar+paper&oq=greenbar+paper&gs_lcp=CgZwc3ktYWIQAzICCAAyBggAEBYQHjIGCAAQFhAeMgYIABAWEB4yBggAEBYQHjIGCAAQFhAeOgQIABBHOgsILhDHARCjAhCTAjoECAAQQzoECAAQCjoECC4QCjoICAAQFhAKEB5Q5g9Y2xRg2RVoAHACeACAAWyIAe8DkgEDNC4ymAEAoAEBqgEHZ3dzLXdpesgBCMABAQ&sclient=psy-ab&ved=0ahUKEwiDvZnA4oTsAhUKjlkKHXyABKoQ4dUDCAw&uact=5) (this was a while ago) down onto a shelf and points to some highlighted numbers.\n\nHe looks at the shift manager and says, \"Do you see this? This is our average technology sales numbers for the weeks you are on shift. See this number over here? This is our average technology sales numbers for weeks you are not. At this point, it would be more cost effective for me to simply fire you. What do you think of that solution?\"\n\nThe guy stammers and stutters like a toddler caught bullying another kid on the playground. Fortunately, the dude wasn't fired, but the store manager made it clear that when I was on shift, I was not to leave the technology department unless I was on break or there was a fire in the store. That shift manager never said another word to me.",
                "labl": 20074,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "happened not to me, but around me.\n\nI have a coworker/friend in a hospitality company that was pretty huuuuge. My coworker brought a lot of experience and skills to the table so many executives and bosses want him working on their projects in their departments in their umbrella of the company. When it was time for him to ask for a raise, our manager, director, and executive director turned him down and low balled him with a counter offer so insultingly low he started looking for jobs outside of the company.\n\nCFO, and other senior VPs heard about said move and reached out to him to get him to stay, and they worked it out amongst each other so they can share him in their special projects along with a hefty compensation package.\n\nCoworker being respectful puts in a request to transfer that has to be approved by the current manager, director, and executive director which they promptly turned down. To make matters worse, they go ahead and write him up for \"attendance\" problems from a couple of months ago... We're all salary, and for the most part project based.\n\nThroughout all of this, I am a fly on the wall since we shared an office, here I am laughing with him while he was in phone calls with the literal people who ran the company. He was told to ignore all that, they apologized to him, they got VP of Human Relations in on the meeting explained the situation which then launched an internal investigation unbeknownst to the 3 clowns.\n\nthe ensuing shit storm that came down onto the 3 clowns is more than enough to make this story awesome, but the cherry on top, is that he is now their boss...\n\n&#x200B;\n\n**tldr: \"management\" team tries to screw over an employee who ends up being their boss.**\n\n&#x200B;\n\n**UPDATE**: thank you for the award, and as a thank you, I will share the rest of the tea, sorry for the delay. \n\nthe way it would've worked before all this went down, is that, said executive director was gonna be promoted into a VP position and move into the big player's lounge in our main office, director which is clown#2 would've taken EXECdir spot, and clown#3 which was manager would've taken director job. \n\nThe powers that may be, CFO, senior VPs that were working behind the scenes took this opportunity to let the clowns dig a hole for themselves.  and to everybody's delight, they did. \n\nI'm going to start with the matter at hand, CFO and senior VPs told my coworker to sit tight, and they will make sure that he is taken care of, and that he from then on will be only taking instructions from them, with the VP of HR on the phone, the process of re-routing him up the chain of command went super fast. I mean why wouldn't it, the bosses who would've reviewed and approved all this have been working behind the scenes to make it happen and they are all on the phone now. My coworker was told that by the next business day he just had to fill in the proper paperwork and to send it straight to VP of HR, and formal announcements will be made to the rest of the company by the end of the week. My coworker then asked the bosses to use some of his newly granted compensation for a vacation week, just to avoid the drama.  \n\nTHIS WEEK was glorious. The clowns were busy calling my coworker, blowing up his phone. LOVING the drama that was going on, I was texting him updates. Since clown #1,2, and 3 always relied on us salaried grunts to take care of everything for them, their incompetence kept showing in their \"BIG\" projects. Projects that have to be submitted to the same CFO and senior VPs that caused all this for them. Every one of our internal clients (other departments, execs, and bosses within the company) was looking for my coworker, the incompetency of the clowns have spread across at the management level, they are all now bypassing them and going straight to us to get things done. \n\nHR was prompted by the VP of HR to start investigations in the background and we were all interviewed and sworn to secrecy. \n\nThe end of the week comes, and my coworker comes in, brand new suit, sits on his desk, and we start our usual banter.  This is supposed to be the day of the big announcement. Clown #3 calls my coworker into the office to write him up for as many things as clown #3 can. \\*\\*\\*\\*THIS I CANNOT CONFIRM because I'm only hearing this from my coworker\\*\\*\\*\\* but apparently clown#3 was putting the book down on him, and threatened termination due to the number of offenses (they wouldn't have fired him, they needed him that much)\n\nMy coworker has a habit of giving a deadpan face and just shrugging through everything that is not interesting to him, so apparently that's what he did. \n\nWhat I can confirm is that after this meeting, he showed me an email of said clown#3 scheduling a meeting with him and clown #2, and #1. WHICHHHH HE DECLINES IN FRONT OF ME...he laughs, looks at me, says watch this,  he walks out, and after some time comes back into the building with the Senior VP straight to clown#1's office Exec Dir.\n\nsome time passes and it was fun to watch Clown #2 Director, and Clown #3 Manager rush to the same office. \n\nThey were all passed over for the promotions, were not granted their raises, and now all their projects go to my coworker for approval. \n\nI no longer work for the company, after some more drama I have moved on as well. I'm still in touch with my coworker, the last update I have heard is that clown #1 and #2 exec director and director would be retiring this year after so long with the company. \n\nI heard that #3 burnt the team to the ground due to sheer incompetence, and is on the way out as well. #3 started the team with a total of 9 direct reports now down to 2.",
                "labl": 1946,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Cure for type 1 diabetes. Doctors have been saying its five years away for awhile now.",
                "labl": 32341,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Biggest crisis in the last 5 years.",
                "labl": 49182,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Betty White and Keith Richards. I assume they'll both be alive but I want to know for sure.",
                "labl": 9799,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I'd try to be like Bill Murrays character by the end of Ground Hog day. Find out if there's any needless deaths from preventable accidents that I may be able to change. Obviously I'd have won the lotto too, this would give me plenty of resources and free time to become a local superhero\n\nEdit: based on the show Early Edition from the 90s.",
                "labl": 14173,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Well, I went to Reddit and found this post. Hello from 2015!",
                "labl": 19978,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Dank memes from the future so I can pre-repost them for that sweet karma.",
                "labl": 8348,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "A Christmas Story....you'll shoot your eye out!!!",
                "labl": 356,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "He/she is probably not the love of your life\n\nEdit: to all of you that find the one when you were still babies : that’s awesome, and I wish you a lifetime of happiness!",
                "labl": 336,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Interpol-Turn on the Bright Lights",
                "labl": 3508,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Tom Petty- Wildflowers",
                "labl": 760,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Grace by Jeff Buckley\n\n&#x200B;\n\nThe single most beautiful album I've ever heard. Seriously a masterpiece",
                "labl": 3431,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Scrolled down a long way, and did not see Steely Dan's *Aja*.\n\nContains such wonderful songs as *Deacon Blues*, *Brown Cow*, *Aja*, *Peg*, and *Home At Last*. Precise, restrained passion, virtuoso performances, spectacular technical recording. Just a delight from start to finish.",
                "labl": 313,
                "true_bin": 1,
                "pred_bin": 2
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "You won’t always be living with your parents!",
                "labl": 35854,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "It's exactly as lame to not do something you want to do because it's too mainstream or popular as it is to do something only because it's cool and the cool kids are doing it",
                "labl": 3592,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "So a sugar daddy lol",
                "labl": 32,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Been in the game 12 years now. \nFound a full Christmas tree last month\n\nOther finds\n5k in £20 notes \nBig ass bag of drugs. Roughly 5kg\nBrand new shoes by the box load.\nSevered finger\n\nEdit. Holy shit this has blown up. My most commented and upvoted on reddit.\n\nSo back story.\n\n\nChristmas tree was found this year on a council estate in August. Photos was taken for the office as it was rather amusing. I visit this lift every month.\n\nThe money and drugs was found in the same lift shift around 3 months apart 7 years ago. The money  was spilt between me and my engineer as I was a apprentice at the time the drugs we handed into security. \n\nThe shoes was found on a passenger/staff lift out the back of JD sports. Suspect a staff member was sticking them down there and loading into a car at the end of his shift. Police was involved in this one. \n\nThe finger was found in a very expensive apartment building. We talking 50 floors and million£+ apartments. \nAgain police and emg services involved in this one.",
                "labl": 7377,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I was in middle school and we were going to see coach carter in theaters with the boys b-ball team. Middle school me was PUMPED. While in the shower I thought “Coach Carter eh, I bet they do push ups in that movie. Imma do push ups right now” Tried to do a wall push up. Slipped, smacked my face on the edge of the tub, and split my upper lip open from mouth to nose. Needless to say, did not make it to the movie.",
                "labl": 13715,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Cat.",
                "labl": 236,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I think the thing that helped me most was probably my parents. I had a very good relationship with them and they were always there to support me no matter what happened. There have been numerous times in my life where I felt like killing myself but because of them, I never did it.\nThey knew about my feelings and they were extremely supportive. I am not sure how much of an impact this had on me but it definitely helped.\n\nI think the other thing that really helped me was my teachers. I had some fantastic teachers in high school and college, they were always there to help me out when I needed it most.\nI don't think I would be alive if it wasn't for them.\n\nIt is very difficult to explain but there have been a few other things that I think have helped me. One of them was my friends, they were always there for me.\n\nThey did not really know about my depression or suicidal thoughts but whenever I was feeling down, they were there for me and would lift up my mood. If it wasn't for them, I probably wouldn't be alive.",
                "labl": 149,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Once in high school, I just wanted to see my friends 1 more time.\n\nThen I got accepted into a top rated university and I told myself to just make it through the year and then I could move across the country and get away from my family.\n\nThen my senior year I figured that since the room/tuition was covered for the year, I might as well stay and enjoy it.\n\nAnd then for every year since then, the only thing keeping me going is a fan convention for my favorite TV show. \n\nYou just gotta find something. That one thing. And then find one more after that.",
                "labl": 39,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My cat\n\neta: thank you for the gold :3 my cat is indeed my little reason for being.",
                "labl": 187,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I’m in the navy and we change uniforms a lot compared to other branches. There’s a conspiracy theory that there’s a rear admiral who’s wife has stocks in the company that makes our uniform. I just randomly heard someone talking about it. I have zero evidence that it’s true, but I 100% believe it\n\nEdit: told this to my coworker who added to the conspiracy cause he said the people who sell our uniforms is run by a rear admiral. The plot thickens\n\nEdit 2: apparently there’s more people saying theres more to the conspiracy so if you see this be sure to head into the replies and give them some upvotes. This kinda blew up and you guys rock",
                "labl": 15288,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "The \"UFO\" footage that just got released recently was a purposeful distraction from current events.",
                "labl": 3437,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "United 93 was shot down.",
                "labl": 2057,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "That J.R.R Tolkien actually wrote Beowulf in Old English and then translated it into modern English just for shits and giggles; can't remember where I heard this, but I've 100% believed it since I did\n\nBefore you say that it's impossible, and too crazy, let me remind you: Tolkien wrote a language, created a fictional universe for this language with dozens of wars and kingdoms, 8 more languages, several unique species and gods, and hundreds of developed characters, then wrote a children's book within this fictional universe. If anyone was crazy enough to do it, it was him",
                "labl": 1361,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "In India, you’re looked down upon if you listen to Hindi music, read Hindi books or are a fan of Bollywood. \n\nGrowing up I felt the need to completely westernise myself- listen to English music exclusively, only watch Hollywood movies, the whole shebang. \n\nSince last few years, I’ve been embracing my native language and my culture. It’s taken a lot of rediscovering my past, amazing movies I missed out on because I was too cool to watch them, Hindi music that I was too cool to play on the speaker. \n\nIt’s liberating to embrace your roots.",
                "labl": 144,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not wearing a bra when I leave the house. Quarantine freed the boobs, and they will never be oppressed again!",
                "labl": 72,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not my partner, but my mom.\n\nShe talks and moves a lot during the night. Last week she started running while laying down (yes, just like dogs do) and also screaming “get out of the way, get out of the way!”.\n\nI woke up in the other room to the sound of my dad first wondering what the fuck was going on and then laughing his ass off when he was telling me what had just happened.",
                "labl": 1700,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "No gems, just horrors. I sleepwalk once in a while but apparently when I was a toddler I used to sleepwalk, cry and say 'she's following me' or just try to leave the house by myself.\nNowadays if it happens, I wake up looking at my reflection in the mirror in the dark. When that happens it fucking creeps me out so I won't sleep the rest of the night.\n\nEdit 1: Why don't I move or cover the mirror? The first time it happened, I covered the mirror but with my morning rushes to work, I pull the cloth down to get ready, and then cover it when I reach home. I've had and still have peaceful nights of sleep (with dimmed lights on) so eventually I'd skip on covering mirror and focussed more not being afraid of the dark. When I least expect it, I then I catch myself waking up to the mirror with a gentle head bump/nod. Get spooked at the incident, rinse and repeat with a blanket cover. I generally have good nights of sleep, these sleepwalks are very rare so I'm really I'm more concerned about my fear of sleeping in the dark. I can't do it. I need a dimmed light for bedtime.\n\nEdit 2: Is it this particular mirror in my room? Yes, it's always this mirror but maybe I haven't had enough sleepovers to have another sleepwalking state elsewhere. I think it's just my subconscious self remembering how I like the mirror during the daytime to get ready, do my hair, makeup, try clothes, etc. I live in a shared flat so I can only leave it in my room. It's a cheap full length mirror and anyway, these sleep walks are so rare. Recent 'episodes' HAS made me want to leave the mirror outside my room but then again I don't want to weird out my flatmates by describing them this particular sleeping habit.",
                "labl": 6218,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "*What if Jod was one of us?*",
                "labl": 429,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My cousin scratched my face because I was very ill and everyone was taking care of me...so she got jealous and nobody noticed for a long time because they were focussed on getting my temperature back to normal",
                "labl": 480,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Boys from my class were throwing CDs like you throw frisbee. One of those hit me right between the eyes. Still got a small scar there.",
                "labl": 19599,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Was about 4 broke a glass jar and sat on it",
                "labl": 2181,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "A large chunk of my taking the lord's name in vain would go away.",
                "labl": 41259,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Does that mean Jesus would be pronounced Geezus?",
                "labl": 22978,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "It is the 41st Millenium. For ten thousand years, the Irwinperor has sat immobile on the Ayers Throne. He is the Master of Australia by the will of the gods and master of millions of blokes by the inexaustible might of his armies. But for all their multitudes, they are barely enough to hold off the ever-present threat to humanity from invasive species, genetic mutations, and far, far worse.\n\nThese are the tales of those times. Forget the promise of of scientific progess and conservation.  There is no peace amongst the Outback, only an eternity of carnage and slaughter and the laughter of thirsting gods.\n\nIn the grim darkness of the far future, there is only the Emu War.",
                "labl": 879,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Australia has bigger problems surely? they’ve been at war with the sun for almost ever.",
                "labl": 160,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My homeroom teacher in 10th grade, Mrs. Isaac, was awful. Among other things, she had a curious habbit of making cheerful little comments to people about how they're going to hell, will die alone in the street, and other lovely things of this nature. She somehow also got management backing to do pretty much whatever she wanted - giving punishments, changing schedules without asking anyone, and so on.\n\nShe had this going for several months, until she made one big mistake. According to what I heard, at least, she chirped to the resident math teacher that \"married women who do not cover their hair go to hell\". Said math teacher, of course, was a married woman who did not cover her hair, and did not appreciate this comment.\n\nAbout a week later, Mrs. Isaac decided she is pulling her class from all other classes for a bible prep marathon. Now, to be fair, there WAS a big exam coming, but you could say that about most of the other classes, too.\n\nShe sent a random 7th grader to our English classroom, to tell the teacher that we're being called for a prep marathon.\n\n\"Who is calling?\".\n\n\"Mrs. Isaac.\"\n\n\"Oh. In that case, it's a no.\"\n\nWe were utterly shocked, and amused, because... That's not a thing teachers did? \n\nShe made a few other attempts, but it seems all of the teachers decided they had enough, and flat out refused to send us to her little prep marathon.\n\nThe best part came on Thursday the same week. She sent in yet another 7th grader to call us. Except this time - it was Math class.\n\n\"Who's calling them?\"\n\n\"Mrs. Isaac.\"\n\n\"So it doesn't matter.\"\n\n\"But Mrs. Isaac said-\".\n\n\"I know. I don't care.\"",
                "labl": 499,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "When I was in my very early twenties, I learned that my BF had cheated on me for months and the other girl was pregnant and keeping the baby. It was 100% certain and I was so traumatized by this that I broke up with him over the phone in about 15 seconds, *without revealing* *what I knew,* and then went hard no contact. I didn't even want to yell at him. I wanteed him to cease to exist. \n\nAbout a year later I ended up with a short-term contract with his company that was too good to pass up, so I did my best to avoid him until one day cornered me and started into me, in front of about six of his co-workers, about how it was shitty it was we couldn't just be friends, how immature I was to avoid him, and how I couldn't even be 'basically civil' to him. \n\nI blurted out \"Congratulations on the birth of your child. Remind me how old the babe is?' and ran from the room. \n\nHis coworkers put 2 and 2 together and I hear he didn't last much longer there.",
                "labl": 450,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I had a guy check my laptop, but it came back to me fixed without my consent, and he was trying to get me to pay 6x the usual rate of what he did.\n\nWe were mediated by a local government official to see if we could resolve this among ourselves. He was spewing lies about me asking him to proceed with fixing it but I saw his face turn pale as I showed everyone there the pictures of our messages indicating otherwise. I even did a little research on the laws he violated and recited it to everyone.\n\nI finished it off by saying I am willing to spend three times more than what he's asking me just to see justice come through and I heard him whimper a bit.\n\nHe ended up returning my laptop and didn't ask for anything. \n\nDefinitely had no power there. I'm still quite proud of myself.",
                "labl": 252,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Was pulled over by AZDPS and they tried to ticket me for speeding... on a highway smack dab in the middle of an Indian reservation. He asked to see my ID, my registration, and to search my car. All no’s. “Ok sir have a great day”",
                "labl": 383,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "At the old courthouse I worked at, the stairs leading to the courtroom were often crowded. As I was trying to squeeze by everyone after stopping downstairs, some guy towards the top of the staircase intentionally stepped in my way and refused to move. After asking him to politely move twice, he made a comment under his breath (but purposefully loud enough so I heard it) that I should essentially go screw myself and that lawyers are entitled assholes and should wait in line like everyone else (which they actually do). He didn’t move so I said sorry and quietly waited behind him for a few minutes. \n\n20 minutes later, I call him out of the courtroom to plea bargain and got the satisfaction of seeing his face when he realized I was the prosecutor",
                "labl": 166,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Elder Scrolls 6 gameplay",
                "labl": 1430,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Ghislaine Maxwell suicide date",
                "labl": 4494,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Ez. Stock market. And not tell any-fucking-one.",
                "labl": 1553,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I would check my mails and message Apps to find out how I'm doing in the future.\n\nIf the phone continuously updates, so that it always show the internet of in five years. Then I would probably look for scientific breakthroughs like fusion and also for catastrophes. Then I would start writing messages to myself like a diary so I can see them in the present. And also in 2025 I would start copying the messages from then in 5 years and send them to myself so I can see the messages of the next ~100 years assuming I live that long.\n\nEdit: I probably would write a script that copies the messages for me.",
                "labl": 377,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "If I had unlimited searches I'd probably look up the Reddit frontpage first.\n\nThere's a lot of information in there that would give a good general explanation about that timeperiod. And from there on I could search up anything that seems interesting while already having some context.",
                "labl": 986,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "A. I already live with B 24/7.",
                "labl": 210,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I feel like A is specific towards men.",
                "labl": 150,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "In Dirty Dancing, Jerry Orbach just wanted a family summer vacation and instead learned entirely too much about his daughters’ sex lives.",
                "labl": 35525,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Mrs. Doubtfire but relating more with Miranda than Daniel. As a kid I didn’t understand why she lost her shit when she came home to the petting zoo.",
                "labl": 3129,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "\"There's plenty more fish in the sea\" won't make any sense.\n\nEdit. This comment doesn't really answer OP's question. I'd delete it but some of the responses are pretty good.",
                "labl": 18008,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "You're not always going to be able to access your brain's memory files, sometimes you may need to remember things off the cuff",
                "labl": 3913,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Bold of you to assume we are still gonna be alive 20 years from now.",
                "labl": 329,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "My mother and brother were arguing about ice cream cone sizes, so my brother stormed off, I followed him back to a villa thing we were staying at. He didn't have a key and we didn't want to wait so I just punched through the glass in the sliding door to make an entrance. There were probably a thousand other safer ways to do it but it just seemed the quickest. Fucking ice cream cone sizes, man.",
                "labl": 1702,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Singing out loud, ever since I started singing for my kids I realized it doesn't matter what you sound like as long as you're enjoying yourself.",
                "labl": 676,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "I have a scar on my forearm from a weaponized paper airplane I taped razor blades to and launched with a rubber band.\n\nEdit: Holy crap, had no idea what I was getting into when I posted this! Thanks for the upvotes and awards everyone! Going to try and post some pictures.\n\nEdit:[Photos of the monstrosity ](https://imgur.com/gallery/WM3bbyC) \n\nSadly, this happened when I was 22, in the Air Force as a 3D0X2. It sliced my forearm open on launch. I enlisted the help of another member of our shop to help me destroy the evidence and drive me to the base hospital to get stitches.",
                "labl": 32418,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "This should probably be tagged [serious]",
                "labl": 2893,
                "true_bin": 3,
                "pred_bin": 3
            }
        ],
        "incorrect": [
            {
                "sent": "After months of negotiations the Koalas and Kangaroos are now our allies.  We had to give the Kangaroos half of Sydney as part of the terms.  The large emus left in Sydney are ostrichsized.  Some of them are emuvable.",
                "labl": 18090,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "B. Because Nothing gets me more aroused than to be condescended and corrected. “YEAH MAKE ME FEEL STUPID DADDY!”\n\n*smart ghost exits stage left feeling dirty*",
                "labl": 982,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Yeah, dude, I saw the funny cartoon going around also. Don’t steal jokes.",
                "labl": 23,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Get a marketable skill, unskilled labor sucks. You need something that’s going to pay you, it doesn’t have to be your life’s passion, contrary to what my peers were saying at that age, but you do need to be able to tolerate it.",
                "labl": 5394,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Not an elevator technician, but I can tell you some dude, at some point is going to find a kindle at the bottom of a shaft in a Toronto hotel elevator. \n\nRules to remember: \nRule #1: Always check that you zipped your carry-on and didn't leave a gap in the bottom\nRule #2: Kindles fit through small carry-on bag zipper gaps and elevator shaft gaps",
                "labl": 321,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Talking Heads, *Remain in Light*",
                "labl": 6697,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Jar of Flies - Alice in Chains",
                "labl": 4521,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Natalie Merchant, *Tigerlilly*\n\nWu-Tang Clan, *Enter the Wu-Tang*\n\nMy Chemical Romance, *The Black Parade*\n\nPearl Jam, *Ten*\n\nStevie Wonder, *Talking Book*\n\nFrankie Goes to Hollywood, *Welcome to the Pleasuredome*\n\nDeltron 3030, *Deltron 3030*\n\nLate edit: One that I doubt most people have heard but I think fits the bill is Underworld's *Underneath the Radar*. It was their debut album and one of only two they made in this particular \"incarnation\" as Christian rockers - their third album was *Dubnobasswithmyheadman* which took them in a different direction and launched them (and their genre) into the mainstream. Most people consider that their \"real\" first album, and it's a legitimate classic, but *Underneath* is a remarkably well-produced and consistently solid album from start to finish. Highlights are \"Glory! Glory!\", \"Rubber Ball (Space Kitchen)\", and the title track.",
                "labl": 2310,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Ben Folds Five - Whatever and Ever Amen",
                "labl": 48,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Drunk, and leaned down to kiss a strange dog on the nose, of all things. 27 stitches down my nose later...",
                "labl": 1399,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Punching concrete don’t ask why I did it I have no fucking clue.\n\nEdit: Why is it every comment I fall asleep after making that blows up.",
                "labl": 2585,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "I have multiple scars on my thumbs from slicing my thumb open on cans of ravioli and spaghetti-o's",
                "labl": 252,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Cutting a pretzel open to put butter in it. I cut my right Ringfinger.",
                "labl": 301,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "My government stored 2700 tons of ammonium nitrate alongside fireworks in a warehouse at the port near a residential area for 7 years until they blew up in the biggest non-nuclear explosion ever, shattering the glass window I was sitting by in my house and giving me a nasty scar on the arm.",
                "labl": 461,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Mom: Don't pinch that pimple now, you'll get a scar. \n \nMe: YOU CAN'T TELL ME WHAT TO DO, WOMEN! \n \n*gets scar*",
                "labl": 198,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "I finished a suicide note and folded it into my wallet on the bus ride back onto base after a weekend of binge drinking on the beach to avoid every person I could. When I got back to the barracks I looked at my rack mate and told him exactly what I wrote down in that note and instead of making things worse he genuinely helped me, and reminded me that not every Marine is meant to do a full term. Sometimes things just don’t go as planned and it’s okay to take that DD-214 early, even if it will disappoint your family. We still talk around the holidays every year.\n\nEdit: Thank you for the award, I’ve never received one on Reddit to my knowledge. I would also like to add that if anybody reads this, and you feel somewhat lost while in the Military, don’t be afraid to go to medical and talk about it. It happens unfortunately often where speaking directly to your chain of command will not help things and word can travel fast. But there is absolutely nothing wrong in seeking help to allow yourself to be the best Marine/Sailor or whatever title you gave your all to achieve. It’s just harder in some units compared to others.",
                "labl": 6343,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I can always kill myself, so why not keep pushing just another day?",
                "labl": 30645,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "After my second attempt, I spent 2 weeks in hospital. They fed me coal. For two fucking weeks I shit black and nurses cleaned up my shit. I killed myself but only the part that I hate. I killed everything I hate about me, cleaned the toxic ppl around me. One day, I just said to myself \"No, you won't go anywhere like this. You will have what you deserve and if they don't give it to you, you will fucking take it. You will quit smoking, begin sports, get mental and physical strength. You won't just be nice and wait ppl to give it to you anymore. You will fucking take it.\" So it was my anger, it saved me actually.",
                "labl": 729,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "The third shot that hit JFK was fired by a Secret Service member. But, it was entirely an accident.\n\nThe motorcade surrounding him was full of secret service. Some were standing up on the seats. When the first shot was fired, they were all on high alert, fingers on the trigger, looking around. The drivers all hit the breaks. A guy standing up in the back lurched forward and pulled the trigger by accident. This shot hit the president. He had already been hit twice and was pretty much toast, so it didn't matter. But they covered it up.\n\nI like it as a conspiracy theory because it reduces such an important mystery to a pure human accident. Which is what a lot of historical events are.",
                "labl": 1001,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "O.J. Simpson didn't do it, it was Jason Simpson. The L.A.P.D. was so convinced that they had their man that they tried to make the evidence fit the suspect rather than allowing the evidence to lead them to a suspect. \n\nO.J. didn't do it: \n\nNicole Brown was nearly decapitated and Ron Goldman was stabbed 20+ times. The prosecution claimed the injuries were consistent with two knives being used and produced a stiletto knife -good for stabbing but not cutting- and a Swiss Army knife -not really good for hurting anyone other than yourself. Ron Goldman had numerous defensive wounds and the injuries to his hands indicated that he had landed numerous blows yet O.J. had only a small cut on his hand with no other evidence of having been in a fight. The only evidence found in O.J.'s home were a few drops of his own blood which were contaminated with a preservative used in blood draws.\n\nJason did it: \n\nMeans: Jason was employed as a sous-chef and had his own knife set and also owned a double-edged combat knife.\n\nMotive: Jason was cooking alone at his restaurant that night and had specifically invited Nicole to come see him cook. She stood him up and went to Mezzaluna where Ron Goldman worked. Jason was known to be bothered by Nicole seeing men other than his father.\n\nOpportunity: Jason's timecard that night was handwritten for a time much later than when the restaurant shut down. His alibi changed multiple times, but the last time anyone can definitely account for him is around 9:30 that night.\n\nThe kicker? The day after the murders, O.J. retained one of L.A.'s top criminal defense attorneys for Jason and did not hire his own defense attorney until several days later.",
                "labl": 643,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Embrace my absolute love for pink after years of deluding myself into believing I wasn’t like the “other girls” lol\n\nEDIT: My first bunch of awards! So glad everyone's breaking out of their shell into the wonderful world of pink! 💕 Now I must ask....red pink, or purple pink?",
                "labl": 6777,
                "true_bin": 3,
                "pred_bin": 2
            }
        ]
    }
]