[
    {
        "correct": [
            {
                "sent": "You'd have different religious factions arguing that they're right and the other is wrong\n\nOh wait",
                "labl": 15158,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Does that mean Jesus would be pronounced Geezus?",
                "labl": 22978,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Graphic Omnipotent Deity.\n\nNo, that's a hard G, bud.",
                "labl": 3007,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Why is this in Askreddit? No hate, but curious.",
                "labl": 763,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "With the Republican's having the Senate majority required to seat a new supreme court justice,  what things could prevent Trump from picking the next justice?",
                "labl": 273,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well, this might be a long one.\n\nI grew up around a mother with dissociative disorder as well as narcissism. She was addicted to opiates as far back as I can remember, and would do anything to get them, and I mean anything.\n\nGrowing up, it wasn't rare for her to have a tantrum during one of her highs and beat the shit out of me, break me down by picking apart every little thing she knew I was afraid or self-conscious of, and actively sabotage my relationship with my father and siblings.\n\nShe would be up for days at a time, pass out standing up with her eyes glassed over and back hunched, and when she festered once again start moving and otherwise destroying everything in the house.\n\nThere were times where I'd leave and the house would be clean, and come home and it would look as though a pissed off tornado had run through the house i.e. broken glass, animal feces, dirty clothes, roaches, empty pill bottles, ground-up pill residue, and other miscellaneous things littering the house. On particularly bad nights she would hallucinate, and during those times it wouldn't be uncommon to find pools of her blood on the ground from running through glass.\n\nI remember being up for days at a time because her and my father would scream at each other for days at a time without stopping; actively trying to get me to pick one side or the other even if it meant barging into my room at 4 am to begin their screaming match where I could watch.\n\nShe manipulated me, abandoned me at times in the middle of nowhere when she'd meet up with her various sugar daddies (she was still with my dad during this), and never once apologized during her brief moments of mental clarity. If anything, she would blame everything but herself. In her mind she was infallible.\n\nMoney was always a big issue since she couldn't work in such a state. She sold some of her pills, yes, but ultimately those funds were used to buy more drugs anyway. Because of this, we were homeless frequently, without power and water for literally years at a time, and barely ever had any food. It was almost every night I went to sleep with the only thing I'd have eaten that day being a school lunch. On weekends, sometimes I didn't eat at all.\n\nThe rest of my family had no clue this was happening. During the summer when I was 16, my aunt whom I hadn't talked much with since I was a lot younger got in touch. She asked if I'd like to come to stay with them in Texas for a few weeks during the summer.\n\nOf course I said yes, and I was absolutely ecstatic. I didn't bother asking my parents since I'd be very much surprised if they even noticed I was gone so they were unaware. My aunt drove up all the way to Iowa and stayed the afternoon with us.\n\nMy parents seemed to lack the cognition to recognize she was even there out of the blue so they didn't come out of their room. As I stated before would happen frequently, when she arrived our house was fairly clean. We left for a bit to go get food, and when we returned the tornado had already passed.\n\nAs she told me when we were on our way to Texas: the thing that bothered her the most wasn't that our house had suddenly gone to hell, it was that I didn't even react to it. Instead, I tiptoed around the debris and started packing my things without a word.\n\nThis deeply unsettled her, and ultimately she asked me if I was safe where I lived. I said yes, as it was all I had ever known. She told me that what she saw frightened her, and she wanted me to come live with her in Texas. Thinking that she was joking, I brushed it off. After a few days down there though, I knew I had to do it. They showed me love, compassion, and care that I'd never even known existed prior to this and it shook me to my core.\n\nSo we decided, I was going to get emancipated from my parents and move in with them. Ultimately, this involved sitting in a courthouse across from my parents and their lawyer.\n\nThe judge asked why I wanted to leave, and I explained the above. I expressed the love and compassion I'd experienced for the first time in my life, and that I wanted to, for once, live in peace.\n\nTheir lawyer rebutted, \"To me, it seems as though you have no respect for your parents. Is it because of their financial situation? It looks as though you're attached to the perks of living in a family that makes a reasonable amount of money, and not that you want to leave because they're unfit parents.\"\n\nMy mother and father joined in, hooting and hollering actively trying to break me down as they have so many times before.\n\nI let him speak, I let them speak, and I held my tongue until it was my turn. They tried to goad me on, tried to break me as they had so many times before, but I wouldn't let them.\n\nFinally, the judge asked me to speak.\n\nWith as level a stare as I could muster, I looked at mother, my father, and their lawyer across from me and said \"If you're asking me if I have no respect for my parents, then you are correct. However, to say it's simply financially motivated is incorrect. I no longer have respect for them because they have-\"\n\nAs I was nearly finished, my mother, as she had so many times in the past began to squirm and scream at me from across the table. \"HE'S LYING THE LITTLE BASTARD IS JUS-\"\n\nUntil the Judge slammed his gavel down and cut the room; my mother staring up at him in complete and utter disbelief.\n\nI looked at her, keeping the tears I knew were right behind the corner at bay and said, \"For once in your life; for once in my life, behave as an adult. You can't stop me by simply yelling over me anymore, you have nothing to hold over me now. You can do nothing.\"\n\nAs I spoke, the judge motioned to his officer who moved towards my mother. Her expression still frozen in complete bewilderment as the officer aggressively told her to get up out of her chair and escorted her out of the room.\n\nThe judge looked to me, my aunt, my father, and his lawyer with one sweeping glance and then spoke.\n\n\"I am sorry that you have had to deal with this for so long young man. There's nothing more that you or anyone else needs to say. You deserve to live a normal life as a normal kid and it's obvious to me now that your parents are unfit to produce that kind of environment. You will go back to Texas with your Aunt, and we will regularly have our social workers in touch to check in on how you are doing. Make the most of this second chance, good luck young man. Adjourned.\"\n\nThough the bang of his gavel was the only noise that permeated the room, all I could hear was the ringing in my ears. My father and his lawyer were escorted out of the room and the tears I had held back all this time came gushing out like a tidal wave.\n\nIt's been 7 years since that day and I am happy to say that I've managed to grow up and become a well-adjusted adult. I have a great career, great friends, and an amazing girlfriend. I've been in therapy ever since we got back to Texas, and I no longer have trouble sleeping or terrible bouts of anxiety and depression as I used to.\n\nLife is good.\n\nTl;dr:\n\nMother is a narcissist with dissociative personality disorder addicted to opiates. Father kind of just went with the flow and didn't really do much. Aunt came down to take me to Texas, saw how shit everything was and asked me if I wanted to live with them. After some time I said yes, went to court against my parents under the pretense of emancipation, and got to stare them down and layout all the trauma, pain, and fear they've caused me. My mother was escorted out of the room when she tried to cut over me, and the judge sided with us and I was emancipated. Now I'm doing really well.",
                "labl": 631,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The guy that i'd gone on a few dates with introduced me to his parents, things went well, or so i thought. \n\nhe drives me home, we end up talking and drinking a few beers, i didn't want him on the road with any alcohol in his system, and i enjoyed his company, so we end up hanging out until 3am. His mom starts blowing up his phone, demanding that he comes home, so he drives himself home to find that he's been locked out of his house. His mom said that he can sleep outside, he shouldn't be spending time with someone like me (still don't know what she meant by that), and that i'm \"just another stop on the pussy train\". He tells her not to talk about me like that, to which she says \"when you're under my roof, i'll say whatever i want about whoever i want!\"  so he picks up his phone, calls me, asks if he can stay at my place for a little while. \n\nIt's been seven years, we're engaged, have a dog, a cat, and a happy life. \n\ni also plan on throwing some subtle train themes into the wedding/celebration after the end of the plague.",
                "labl": 6846,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I worked at a Walmart as a cashier, and the assistant manager there was a dick, he would insult everybody working there and forced us sometimes to do work above our pay grade.  6 months later me and him got transferred to another Walmart that was just built and they needed to pick a manager and assistant manager some random got manager but I got assistant manager (I guess all the complaints on the assistant manager basically gave him a demotion) so one day he was ordering the other cashiers around then i pulled him to the side and told him that if he kept pulling the same shit around he would be out of here.  I haven't heard anything from him since.",
                "labl": 24364,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My parents were yelling at me and then my grandpa walks over and tells them both to sit the fuck down. They both shut the fuck up and sit their ass down on the couch. It was by far the most powerful thing I've ever seen him do lmao.",
                "labl": 14433,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Every word of this story is true:\n\nMy younger sister and I have different dads. Her dad was an alcoholic abusive asshole to our mom. She left him at Christmas 1981. \n\nChristmas ‘82 rolls around, and they were divorced by then, but he wanted to see his daughter at Xmas, so he came by my grandparents house for Christmas Eve. We always have a big celebration with food, family, etc. \n\nBefore we continue, a word about my grandfather- he was a card-carrying badass. Purple Heart in WW2, also fought in Korea, old-school NRA, etc. \n\nAt some point, my sister’s dad gets some liquor in him and starts telling my mother, in front of all of us, how he is going to whip her ass and doesnt care who is there, no one’s going to stop him. \n\nIt got dead quiet. Everyone was really on edge. After a few moments, my gramma gave me another present to open. My grandfather just walked out of the room. \n\nWhen he walked back in, he was holding his shotgun at waist level. He looked at my sister’s dad dead in the eyes and said, “the only reason i don’t put this up your ass and pull the trigger is that my wife just redecorated this room.” Pure Eastwood shit!\n\nMy sisters dad got up and walked out without turning his back to my grandpa. The old man just kept the gun pointed at him until he got in his car and drove off. Then he put the gun up and we enjoyed the rest of our Christmas Eve. \n\nI was six years old. To say that made an impression on me would be a gigantic understatement.",
                "labl": 198,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Loto numbers, Sports results, stock market stats.",
                "labl": 8606,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Besides the obvious (lottery, election, myself, etc) I would want to see if opera made a comeback after the pandemic or if the virus was the final nail in the coffin of this art form, which has been slowly headed towards its demise for decades now.\n\n\n\nEdit:  I should have said here that I’m a huge opera fan and I hope I’m wrong!\n\n\n\n\nAnd I’m not talking about the web browser.",
                "labl": 1842,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "queen elizabeth (if there were more searches available)\n\nthen probably see which countries still exist as they are now,\n\nsee how covid-19 played out\n\nmemes so I can make an accurate \"this is a meme from the future\"\n\nthen see what are the biggest breakthroughs of science in the last 5 years, probably at least medicine and energy\n\nalso obviously lottery numbers or something",
                "labl": 1063,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Is Betty White still alive?",
                "labl": 130,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I’d choose B. Condescending or not that could be handy.",
                "labl": 53189,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I want to fuck a ghost",
                "labl": 8952,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Wtf, I'm already horny all the time....I take option B",
                "labl": 3145,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "B. We just become friends. I'm sure they mean no harm. If they're hanging around me that much, they must like my company.",
                "labl": 567,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I watched Sixteen Candles recently and I now do not approve of Samantha going anywhere near Jake Ryan.",
                "labl": 3519,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The mom in Ice Princess. So you have a daughter who has a talent for and seems to like physics and has a shot of getting into harvard. This girl throws it away for ice skating where she has only been competing for less than a year, where if she gets injured she's done and when she reaches 30 she's pretty much done. There is no way she is at an olympic level at that point she would need years of training! Hell yes I would advise against it to!",
                "labl": 11372,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Goob, Meet the Robinsons",
                "labl": 4889,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "You laugh but having run into these fuckers in the wild I tell you, they would kill you and everyone you love.",
                "labl": 340,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I had a short stint as private investigator who specialized in providing investigative services to public deffenders.\n\nWe had this one county that was notorious for a sheriff's department that would make BS traffic stops as a pretext to search vehicles. One deputy in particular came up time and time again for this kind of thing.\n\nI was asked to interview this deputy for a defense attorney. Deputy had some of the worse report writing skills I've ever seen. Riddled with grammar and spelling errors. Quite often, deputy wouldn't even include the reason he pulls people over in his reports. \n\nSo I go to interview the guy. As part of the process, there's a senior sheriff's rep there that basically is suppose to protect deputies from people like me and keep them from saying things they shouldn't. \n\nWe sit down and I pull out his report he wrote on the stop he made on my client's defendant.  I've already marked it up, English teacher style with a red pen and start with, \"I had some trouble understanding your report.\" I proceeded to go error by error for the purpose of \"clarifying\" the report. He's getting redder and redder. I then go into trying to determine why he pulled over the defendant because it's unclear in the report. He's not able to give a definitive response.\n\nAll the while, the sherriff's rep, whom I've worked with a lot and who I have seen be very vocal protecting deputies in interviews like this in the past, is silent. Ultimately, charges against client are dropped.\n\nMonths later, I'm driving through the area on the way home from camping, not speeding or breaking any traffic laws. I get pulled over by a deputy. It's the same deputy. He recognizes me immediately, stammers and manages to say, \"Uhhhh, it's almost dusk, turn on your headlights.\" He gets back in his vehicle and takes off before I've even started my engine.",
                "labl": 158,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "Lottery numbers -> stock prices -> my name.\n\n&#x200B;\n\nYou may ask why my name but it's very simple as I then can learn if I died until then or got caught for some shit and are still in prison.\n\nEDIT: WHOA, I didn't expect anything. Many thanks for the awards and upvotes.",
                "labl": 22897,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "All sports betting wins of the last 5 years",
                "labl": 18261,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Bitcoin price history.",
                "labl": 5496,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "How long does it work for? If it is permanent, lottery numbers once or twice anymore and you would draw attention.then best tech developments and start ups to invest in. Locate the brightest and smartest graduates to come and work for you and enough dirt on politicians to let you get away with what your planning.",
                "labl": 14,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Not a teen movie, but Father of the Bride.\n\nWatching it as a kid, Steve Martin seemed like an old grump.\n\nRewatching it as an adult, holy shit he is the only sane person in that movie.",
                "labl": 2739,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Don't put off dealing with mental health issues. Developing unhealthy coping mechanisms for emotional issues will fuck you up big time down the road. If you have issues, deal with it head on, right away. It can take time, but start the work now.\n\nAlso, save for retirement. You should open a Roth IRA yesterday.",
                "labl": 14572,
                "true_bin": 1,
                "pred_bin": 4
            },
            {
                "sent": "Hold yourself to your own standards.\n\nIf you wouldn't let anyone treat your friends/family like trash, then don't do it yourself.\n\nIf you feel learning is a positive thing, then learn on the daily.\n\nIf you value work and security, then give yourself security through work.\n\nIf you expect others to be intelligent and to care, then you should be intelligent and caring.\n\nHold yourself accountable for how you want the world to be.  Be a part of the world you want to live in.\n\nEDIT:  Wow.  This...stratospherically launched my internet points.  Thank you very much everybody, that feels very nice.  I wish you all a great week.  xDD",
                "labl": 14154,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I had this but it turned into an abusive relationship. Enlisted Air Force. I ended things after 4 years.",
                "labl": 2971,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Wife already has that - though the friend part of it is rapidly waning.",
                "labl": 882,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "We have a name for that in the military: \"Dependapotamus\"",
                "labl": 135,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "My dad has a great story about this. He supervised the mechanics, and one of them called him from a mental hospital and said \"you've got to see this\". The maintenance guy was called because the elevator wasn't quite sitting level on the ground floor; it was about half an inch too high and both patients and staff had been tripping on it. But all other floors were no problem.  \n  \nMy dad arrived to find the maintenance guy cackling, looking into the bottom of the shaft. There were probably tens of thousands of magazines down there. They had to get a bunch of shovels, a small crew, and a rolling dumpster to clear it out. When it was all done, my dad decided to stay behind and pretend to read a newspaper while he sat in the lobby. After about half an hour, he sees an elderly patient holding a magazine, shuffling slowly toward the elevator. He stops in front of the doors, glances left, glances right, and quickly stoops down, slides the magazine into the gap, and shuffles away as fast as he can with a huge grin on his face. My dad could not help but laugh hysterically. This guy had probably been sliding magazines in there multiple times per day, every day, for decades. I should ask him whether he reported it or let the guy have his fun. Wouldn't surprise me if my dad went with the latter.",
                "labl": 21626,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Why have so many people in the comments found purple dildos",
                "labl": 8981,
                "true_bin": 1,
                "pred_bin": 3
            },
            {
                "sent": "Not exactly answer to the question but still related. When we came to call about \"broken doors\" we was not expecting that someone for some unknown reasons stole one half of elevator's door.",
                "labl": 113,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Disintegration - The Cure",
                "labl": 6241,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Violent Femmes-Violent Femmes [https://www.youtube.com/watch?v=QeJODSjIbT8](https://www.youtube.com/watch?v=QeJODSjIbT8)",
                "labl": 1750,
                "true_bin": 1,
                "pred_bin": 4
            },
            {
                "sent": "De-Loused in the Comatorium — The Mars Volta\n\nRecorded in a way that there are no pauses in between each song.\n\nEdit: Wow this blew up! I’m so glad there are so many At the drive in / The Mars Volta fans. Hopefully some new fans came out of this as well!!",
                "labl": 2444,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Purple Rain - Prince",
                "labl": 285,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "AM - Arctic Monkeys",
                "labl": 693,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Mount & Blade: Warband is one that comes to mind for me.",
                "labl": 6617,
                "true_bin": 1,
                "pred_bin": 3
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "With the high cost of medical and dental, that's even better than sex.",
                "labl": 15896,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not in elevator repair...\n\nA few months ago we had a floridly psychotic patient (think staring into space, can’t form a coherent sentence, etc) brought into hospital. There was a fire alarm at an apartment building and when fire went in, they somehow found this guy living in an elevator shaft. He had evidently been there for some period of time.\n\nMost of his delusions that he was talking about for me (that I could understand) were about time travel and Jesus, so we were joking a bit that he wasn’t actually psychotic and was just time travelling Jesus.",
                "labl": 196,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Alexander Graham Bell pushed for the eugenics of Deaf and hard of hearing people and was a major obstacle to fund schools for the Deaf, which thankfully did persist despite this asshat",
                "labl": 6532,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Ever heard of General Perón? To half my country, he was a savior, the guy who gave (too much) rights to the workers and the one who industrialized the country, but to the other half he was a coupist (a guy who supports the coups) because he gained power that way, a supporter of the axis, a genocidal of aborigins, natives and oppositors, a pedophile, and of course, he left an ideology that started destroying my country and provoked it to lower from 'developed' to 'in way of developing'",
                "labl": 303,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "You're at a time in your life when you see your friends almost every day at school. That should be cherished, because it's vastly simpler than maintaining friendships as you enter adulthood and you don't have that constant contact.\n\nLife as an adult *is* change, most of it outside of your control. People change, circumstances shift...all of that work you put into your adult friendships can vanish in an instant, and you just have to adapt and move on.",
                "labl": 13525,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Was in the scouts whittling a stick for funsies. Except I was pushing the blade in the wrong direction and whittled my index finger instead",
                "labl": 606,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Just a casual fan of this one but that Christopher Walken knows whether Natalie Wood's death was an accident or not.",
                "labl": 9147,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Maybe not Tupac. But at least one celebrity has faked their death and is still out there.",
                "labl": 33164,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Mattress stores are just money laundering fronts.",
                "labl": 5207,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Letting my weird out. \n\nI used to try to fit in with everyone, I pretended to like sports, or shooter games or whatever the group was into and talking about. Finally I just embraced the fact that I’m just different enough from “the normal crowd” and I don’t care. I like the obscure Japanese games people in my area haven’t heard about, I like collecting cool looking bottles and glasses and pretending I’m a wizard making potions, I like listening to showtunes, I like disney movies, I like all those girly alcoholic drinks. \n\nIdk, what seems weird to people and what I enjoy seem to line up pretty frequently.",
                "labl": 446,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Once my ex said \"horse.\" That's all. Just horse. But with a sense of urgency.\n\nThe same ex told me I once sat straight up in bed and mumbled, \"Jesus, grandma, you scared the shit out of me.\" I had been dreaming that I was in bed at night and my grandma (still alive at the time) wandered into the room and stood at the end of the bed with a blank stare.",
                "labl": 1159,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I'd be the king of Monaco! My wife said this one night out of nowhere. The funniest part was her tone of voice,proud and assertive, like she was really sure of her claim to the throne. Anyway, the joke's on her, Monaco is a principality.\n\nWow, thanks everyone, I've never had a post or comment get above 10 upvotes before and definitely never had any awards!!",
                "labl": 17278,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My friend has this awesome story from college:\n\nHe was a school \"president\", he was in charge of things, and had quite some power and responsibility. \n\nThis one time he had to organize a seminar which was pretty important especially because he was hosting. As he was going around making sure everything was running smoothly, he noticed a few students messing around and not rehearsing a speech they had to deliver. He questioned each of them on said speech and, as expected, none of them knew it well enough. So he asked them to start rehearsing but as reckless as freshmen students can get, they ignored the order. \n\nBeing fed up with them, my friend simply took their presentation and told them to leave. That's when one of them snapped back, \"You can't do that! You don't even know me, i know the president of the department!\", showing off illusions of the amount of power a 3rd grader has on a Thursday morning after a bowl of cereal. \n\nNaturally, my friend asked this schmuck to use their wild card and call the president. They took out their phone, started dialing and guess what happened next \n\nHis phone started ringing.\n\nNow I'll let you imagine the sheer horror in this kid's eyes, the shame on their face, the cringe and regret for the rest of their life.I have no idea how my friend kept a straight face.\n\nThis is one of my favorite \"you have no power here\" stories.",
                "labl": 1490,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "American Pie. As a new father, I hope to be like Jim’s dad when my little one is a teenager. Caring, loving and a complete embarrassment to them.",
                "labl": 10021,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not a movie but Gilmore Girls in general. When I first saw it I was all about Rory, as I aged I switched to Lorelai, now, quite a while later, it’s ALL about Emily. She’s the absolute heart and soul of the show and the best thing in it by far. Conversely Rory is a horrible whiny little cow and she needs to grow up. \n\n(I am a nearly 40 year old man).",
                "labl": 409,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Sgt peppers lonely hearts club band-the beatles",
                "labl": 940,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Tinkerbell.  Everybody thinks she was so cute and such a good friend to Peter, but she was a jealous psychopath and tried to murder Wendy several times.",
                "labl": 16277,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Sir John  A MacDonald. First prime minister of Canada. Did a lot for the country in its infancy but treated indigenous people like garbage.",
                "labl": 8679,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Found my father's pistol, but couldn't find the bullets.",
                "labl": 283,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "There was a page online that talked me down and convinced me to give it 24 hours. So I made a deal with the devil, fortunately I felt less shitty once the time was up and I continued to keep living.",
                "labl": 130,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Paint/draw and then share it with strangers. I did not grow up with art and had absolutely no confidence in attempting it. During our quarantine this spring, I taught myself how to watercolor and draw birds and am now selling prints and stickers and donating 100% of the profits to bird conservation groups. \n\nI just love birds.",
                "labl": 2950,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "It's too bad all we can see in the Supreme Court is the D or R when it shouldn't matter.  Justice is no longer blind.",
                "labl": 5332,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "she seemed like she lived a fulfilling life. R.I.P.",
                "labl": 105,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "McConnell in 2016 under Obama: \"Because Scalia's seat had become vacant during an election year, the Senate would not even consider a nomination from the president.\"\n\nMcConnell in 2020 under Trump: \"Trumps nominee for Bader's replacement will get the Senate's support.\"\n\nDECLARED IMMEDIATELY AFTER RBG'S DEATH\n\nMcConnell is a shameless snake. What are his motivations? Why do Republicans respond well to their representative playing the system? What can America do to stop a party from playing with people in order to gain control longer than welcomed? Why don't Republicans and lawmakers see that this is a dangerous game?",
                "labl": 360,
                "true_bin": 2,
                "pred_bin": 3
            },
            {
                "sent": "It is the 41st Millenium. For ten thousand years, the Irwinperor has sat immobile on the Ayers Throne. He is the Master of Australia by the will of the gods and master of millions of blokes by the inexaustible might of his armies. But for all their multitudes, they are barely enough to hold off the ever-present threat to humanity from invasive species, genetic mutations, and far, far worse.\n\nThese are the tales of those times. Forget the promise of of scientific progess and conservation.  There is no peace amongst the Outback, only an eternity of carnage and slaughter and the laughter of thirsting gods.\n\nIn the grim darkness of the far future, there is only the Emu War.",
                "labl": 879,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Pretty brutal really. My dad was attacked by an emu once. He is bald and his head is a little shiny. he was sitting on a bench at a wildlife park and The emu must have been attracted to the shiny reflection, snuck up behind him and bit his head. I have never seen someone jump so far in one leap before or since. As a child this traumatised me a little and now I am pretty uneasy around all kind of birds.",
                "labl": 27325,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Firstly, thanks for bringing this issue up, it often feels like nobody cares, this is just what the emu loyalists want.\n\nSecondly, the war efforts themselves are an ongoing struggle for me and my unfeathered brethren. We try to ‘stick our necks out’ on war related issues, but the emus have always had us covered here as evolution has been kind to them when it comes to neck related advancements and rhetoric.\n\nLastly, our underground movements are gaining traction thanks to the tireless work of the wombat alliance and the ‘eye in the sky’ koala efforts are proving vital to our current, and future progress on the front lines.\nHope for a COVID vaccine that doesn’t work on emus is still in the works, but hope is on the horizon.",
                "labl": 375,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I'll sum it up in two words\n\"fucking scary\"",
                "labl": 5,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I used to work for a super cunty manager when I worked at McDonalds. This guy was horrible to us. He was constantly bullying us, shit talking us TO CUSTOMERS, and doing everything in his power to make us miserable. Well, so many people complained about him that he ended up getting fired. \n\nNew manager was great. He was super chill and understanding with us all. A couple weeks after he took over, the old douchebag comes in and starts talking about how terrible the store looks, how our service is shittier than ever, and how much this store needs him. The new manager looked at him and said \"If you don't leave, then the cops are gonna make you\"\n\nWhen the douchebag didn't move, new awesome manager stuck to his guns and called the cops. The douchebag is no longer allowed on ANY McDonalds property in the city and has a restraining order against him.",
                "labl": 1328,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My homeroom teacher in 10th grade, Mrs. Isaac, was awful. Among other things, she had a curious habbit of making cheerful little comments to people about how they're going to hell, will die alone in the street, and other lovely things of this nature. She somehow also got management backing to do pretty much whatever she wanted - giving punishments, changing schedules without asking anyone, and so on.\n\nShe had this going for several months, until she made one big mistake. According to what I heard, at least, she chirped to the resident math teacher that \"married women who do not cover their hair go to hell\". Said math teacher, of course, was a married woman who did not cover her hair, and did not appreciate this comment.\n\nAbout a week later, Mrs. Isaac decided she is pulling her class from all other classes for a bible prep marathon. Now, to be fair, there WAS a big exam coming, but you could say that about most of the other classes, too.\n\nShe sent a random 7th grader to our English classroom, to tell the teacher that we're being called for a prep marathon.\n\n\"Who is calling?\".\n\n\"Mrs. Isaac.\"\n\n\"Oh. In that case, it's a no.\"\n\nWe were utterly shocked, and amused, because... That's not a thing teachers did? \n\nShe made a few other attempts, but it seems all of the teachers decided they had enough, and flat out refused to send us to her little prep marathon.\n\nThe best part came on Thursday the same week. She sent in yet another 7th grader to call us. Except this time - it was Math class.\n\n\"Who's calling them?\"\n\n\"Mrs. Isaac.\"\n\n\"So it doesn't matter.\"\n\n\"But Mrs. Isaac said-\".\n\n\"I know. I don't care.\"",
                "labl": 499,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My mother trying to force me to do stuff when she came and visited my dad's house.",
                "labl": 3303,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My So Called Life. I shipped Angela/Jordan so hard; as an adult I can see why he sucks and why her parents acted the way they did. I still love those kids though.",
                "labl": 1070,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Obligatory \"not a movie but...\"\n\nWhen I was younger, hank Hill seemed like the most boring buzzkill stick in the mud. He didn't get teen slang and would get grumpy in his confusion. He didn't put up with antics and was always telling his friends to knock it off.\n\nWhen you get older, you realize hank hill is exactly the kind of guy you want to be. He always keeps his word. He's always responsible. He has faith in people. He's a good friend, always there to help his pals out when they need it. He doesn't understand his son but he does his best to support him. \n\nAnd he doesn't put up with bullshit. It's not zany antics he's stamping out, it's bullshit.",
                "labl": 1252,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Goddammit, T-Karen, your gender reveal T-party brought a fucking meteor down on us. Great job.",
                "labl": 536,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "\"There's plenty more fish in the sea\" won't make any sense.\n\nEdit. This comment doesn't really answer OP's question. I'd delete it but some of the responses are pretty good.",
                "labl": 18008,
                "true_bin": 2,
                "pred_bin": 3
            },
            {
                "sent": "How do you feel about a friend with benefits, but instead of sexual benefits, they just make a reddit thread with the top comment of that day's top threads?",
                "labl": 1233,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Well over 1500 tax returns at the bottom of the ATO's north brisbane office elevator shaft.",
                "labl": 14407,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "cowboy bebop (original motion picture soundtrack) - seatbelts",
                "labl": 764,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Kendrick Lamar - To Pimp A Butterfly",
                "labl": 4644,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "As long as I never see Steve Irwin, Mr. Rogers, or Bob Ross in one of these threads, we’re good.",
                "labl": 418,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Not necessarily a \"good guy\", but got lots of positive attention from the release of the Greatest Showman- apparently PT Barnum was a terrible person in real life",
                "labl": 52721,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Thomas Edison. Biggest monopolist ever and took credit for other people's work. He didn't invent the lightbulb but bought the rights and advanced it. He monopolized the film-projector + most films at the time and it took a very long lawsuit to get that fixed. He took many creations from his employees and put his name on it. This wasn't illegal because of the contracts employees signed at the time but it's not exactly a sign of good will. I don't hate the guy but his character is often completely exaggerated.",
                "labl": 25886,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "For those who aren’t aware, tonight is the start of the jewish new year. There is an old, old tradition that at this time of year God “opens his book”. During the days between the new year and Yom Kippur, Jews pray for atonement and pledge to do better in the following year, and on Yom Kippur God enters the names of those who have truly atoned in the  book, and seals it for a year. Those whose names are sealed will live for at least another year. So for someone to die on the very last day of the year means that God judged that person very highly. It’s an old story/tradition from the Middle Ages and I doubt anyone literally believes this now, but it seems like the perfect ending to her life.",
                "labl": 1059,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "The internet still exists in five years, so that’s my first worry assuaged...",
                "labl": 112,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "\"It's my estimation that every man ever got a statue made of 'im was one kinda som'bitch or another.\" - Cap'n Tightpants",
                "labl": 193,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Normally I would use my alt account to post this, but I have been more and more open about my mental illness recently, so I'll post it on here. First of all, the stigma around this topic sucks so much and I want people to be able to openly talk about mental illness without others judging them. I really hope anyone who will read this will take a moment to check on their friends, so many people don't and even if they want you to or not, it will make them feel more loved in the long run.\n\nPotential trigger warnings below, so just be warned. PS I love you, even if you don't love you.\n\n>!I have been suicidal for 12 years. The last 2-3 years I have been doing much much better and I don't really consider myself suicidal anymore, but for the sake of this I will include this year in the tally because I had a bad month a few months back.!<\n\n>!There have been 3 very distinct times in my life where I almost killed myself. First was when I was in high school, I started drinking every day and blacking out all the time, I did drugs and drank every day. I hated life and just wanted to feel something else. One night I was extremely wasted and decided to go walk around town. I was standing next to the road and was waiting to just jump in front of a bust or large truck. While waiting I was thinking about the reasons I didn't want to be alive. After an hour of thinking all the bad things, I started thinking about reasons I might want to be alive... This first time was because I promised myself that I wouldn't make my mom bury another child (my sister died before I was born).!<\n\n>!The second time I was 8 months out of HS, same scenario as above with all the drugs and all. This time I had a gun to my head, I was going to pull the trigger, but when I did my finger wouldn't move.  I put the gun down and cried. This time I remembered that I wanted to move away some day and see new places, I couldn't die before I left my hometown and had new experiences.!<\n\n>!The third time was my closest time. I was in college and my entire life fell apart. GF left me, lost my job, had to drop out of school, one of my pets died, I lost a good friend, my life literally collapsed around me. I took an entire bottle of pain killers, mixed an entire bottle of vodka with it and then went to sleep. I woke up 30 minutes later with the worst pain of my life. I could have just took the pain, but once I felt that, once I felt something that made me actually feel alive I called my friend. He knew I was suicidal and knew that I would probably try something soon. He was on call for me 24/7. He picked me up, forced me to throw up and then rushed me to the ER to get my stomach pumped. I decided to fight it because I actually realized that I WANT TO BE ALIVE, I JUST DON'T KNOW HOW TO LIVE.!<\n\n&#x200B;\n\n>!From that day on, I have tried my best to be happy, its been 3 years now, and I have only been in a slump where I was slightly suicidal for 6 days out of 3 years. My depression tried killing me, I didn't try to kill me. That is how I think about it. So now I fight my depression, instead of being my depression.!<\n\nEdit: I got so emotional writing this I forgot to mention my cat really helped me with my depression. She never leaves my side, it's like she knows I need a guardian of some sort.",
                "labl": 139,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Years ago, my wife was mumbling in her sleep and seemed a bit upset.  I wanted to comfort her, without waking her up too much, so I said, \"Honey, you're fine.  Do you know where you are?\"  \n\nShe slugged me in the arm, and said \"I'm in place where punch buggies are seen first.\"  She then rolled over and muttered to herself, \"chugga-chugga-chugga-buggy\", and went back to sleep.\n\nShe didn't remember a think the next morning.",
                "labl": 6671,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "We were freshly married and living overseas. My husband hadn’t had much sleep the nights before, which usually enhances any sleep talking. It was hot in our room. My husband mumbled something which I didn’t quite catch. I asked him to repeat it. He got up, opened the bedroom window and said very pointedly “Air flow, Bitch!” then laid back down, completely asleep. Now, my husband has never, not once, ever called me a name or even raised his voice to me, so this is particularly hilarious.\n\nEdit: you guys are FAR too kind with all the awards and upvotes! Thank you so much!!!\n\nAlso, this happened before Breaking Bad was a big thing, so maybe my husband is the original Jesse Pinkman? Except without all the meth and mayhem, of course.",
                "labl": 38281,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "My now-ex was dreaming that he was on a hill with parked cars when one’s brakes gave out and it was slowly coasting downhill towards me. He jumped in front, bracing himself against the car to stop it and save me. In reality he was just shoving the bed around the room at 2am. I got the story from his answers to my questions before he semi-woke up and went to sleep again in bed.",
                "labl": 189,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "For those who aren’t aware, tonight is the start of the jewish new year. There is an old, old tradition that at this time of year God “opens his book”. During the days between the new year and Yom Kippur, Jews pray for atonement and pledge to do better in the following year, and on Yom Kippur God enters the names of those who have truly atoned in the  book, and seals it for a year. Those whose names are sealed will live for at least another year. So for someone to die on the very last day of the year means that God judged that person very highly. It’s an old story/tradition from the Middle Ages and I doubt anyone literally believes this now, but it seems like the perfect ending to her life.",
                "labl": 1059,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "While he almost certainly wasn't the first to say it, Lord Acton once observed that \"Great men are almost always bad men.\"  Pluck any great man from history - those rare figures about whom the story of the human race seems to turn - and you find a monster who changed the world, probably without even intending to do so.",
                "labl": 20264,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "I had a sleepover at my friends house and her brother was in her room with us because he's young and that's what he does. He had the bed and we were on the floor. So eventually he fell asleep and we were reading her old messages like the pair of weird children we are when he sits up, stares at us and says \"Light out!\" and drops back down. It was horrifying and is too this day. We never told him.",
                "labl": 371,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Went to a private school for a couple years, and boarded (stayed overnight) a few times. Woke up one morning to everyone looking tired af and pissed at me. Apparently I'd commentated a full football match in my sleep, with replays and full hype over the goals. Don't remember it at all",
                "labl": 356,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "I was trying to squeeze between 2 cars. One of the cars must have had a jagged bumper because it sliced  a 2 inch gash in my leg.",
                "labl": 15752,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "Was in the scouts whittling a stick for funsies. Except I was pushing the blade in the wrong direction and whittled my index finger instead",
                "labl": 606,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "It sounds so dumb but I truly think that the fear of the unknown is the only thing that saved me. Obviously we don't really know what if anything happens after death and honestly almost every religion's idea of an afterlife or the atheist belief that you just stop existing all seem pretty shitty to me compared to just living a crappy life on Earth\n\nlike sure I may be dead inside but at least if I stay on Earth I get things like video games and YouTube and those few other things that I can still find enjoyment in",
                "labl": 113,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "I search porn to see if the industry has gotten over its step-family obsession",
                "labl": 12533,
                "true_bin": 3,
                "pred_bin": 3
            },
            {
                "sent": "My ex-wife told me that I once sat up straight in bed, pointed at the window, and gravely said, \"Laser bitches.\"",
                "labl": 225,
                "true_bin": 3,
                "pred_bin": 3
            }
        ],
        "incorrect": [
            {
                "sent": "Would Satan make an announcement that it’s pronounced sah-tin instead of say-tin",
                "labl": 12,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Within the last 4 minutes I have seen at least 5 gender reveal posts. What has happened that I'm unaware of?",
                "labl": 9051,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Blue album, Weezer",
                "labl": 4930,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Rush - Moving Pictures.",
                "labl": 126,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I'll throw a curve ball here, but there are three Blink-182 albums I think don't have any bad songs.\n\nEnema of the State\n\nTake off your Pants and Jacket \n\nBlink 182",
                "labl": 338,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Factorio!",
                "labl": 16518,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Minesweeper",
                "labl": 295,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "This is a little more niche, but Bill Wilson, the founder of alcoholics anonymous.\n\nThe guy did great things, and created a program of recovery that has saved millions of lives since it's inception 85 years ago.\n\nHe was also an arrogant ass hole that cheated on his wife even in sobriety.\n\nEdit: This isn't here to scare away anyone that's trying to get sober. I've been sober thanks to AA for 5 1/2 years. So don't let this keep you away if you're struggling with your drinking.",
                "labl": 13565,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "In some aspects to the 60’s and 70’s when the Beatles were icons, (I’m talking about John Lennon) people who use his image and face for “peace” sometimes forget important details. \n\n\n-He abused women\n\n\n-He was a cheater\n\n\n-He abused his children (made one go completely deaf in one ear)\n\n\n-Total hypocrite on the “no possessions” when he lived one of the most lavish lifestyles of his time\n\n\n-compulsive liar\n\n\n\n-had a sexual appetite for his own mother \n\n\n-almost killed a few people (look up Bob Wooler, he was almost punched to death by John. There were others but their stories have either been disputed or unclaimed.)\n\n\n\nSo whenever I see a bunch of people sing *imagine* I just shake my head in shame cause so many people don’t even know how bad he was but act like he was a saint.",
                "labl": 5722,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I punched a pint glass one night when I was drunk back in college. \n\nIt ended up slicing my finger *really* badly, like there was a flap of skin that came up. Went to the bathroom and ran it under water, but it just kept bleeding. I didn't know what to do and was too drunk to try to deal with it, so I just wrapped my hand in a towel and tried to go to sleep.\n\nWoke up to knocking at my door and it ended up being security. He followed a trail of blood from the bathroom to my room and wanted to make sure I was alright. I showed him my finger and he was like, \"Come on, you gotta go to the hospital.\" Dude was a bro and drove me there even though it was like 3am. Saw a doctor and he had to give me a bunch of stitches. He said I was very lucky because if it was just a tiny bit deeper I would have probably had done permanant damage and lost mobility of the finger.\n\nNow I have [this scar on my finger shaped like a Nike swoosh](https://i.imgur.com/cEhQRG0.jpg) to remind me not to be stupid and try to fight glass.",
                "labl": 1082,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "\nIt’s finally my time to shine!!\n\nIt was Christmas Day, 2010. I was 10, my brother was 12. I was in that stage of my life where I greatly admired my brother, and basically followed him around and did what he ordered me to do.\n\nAt this given moment, my nan and her boyfriend were at the table sitting outside enjoying the sunshine and listening to Mariah Carey. My mum,  preparing the Christmas feast of ham and roast veg. My dad, probably trying to figure out how to make ice with the new ice machine and cursing his existence.\n\nNow for a little more context, I’ve grown up in the Australian suburbs. This is important to reference, as it explains why my brother and I were trying to peep over the fence to see what our loud neighbours were doing. You’re probably confused...I’ll explain. In Australia, it’s common culture to extend to your neighbours, or the entire street, an invitation into the family.\n\nThis includes inviting them over to celebrate birthdays, having afternoon siestas on the front lawn, joint Australia Day bbqs, that kind of thing.\nHowever, my family was never really close to the neighbours behind us. I personally feel like this is because they never cut their bloody tree that’s palms dipped into our yard. \n\nAnyway, on this particular Christmas, those neighbours were being louder than usual. My brother, being the nosey bastard he is, decided he wanted to see what the commotion was all about. So he decided he had a plan; get a chair, put it against the fence and look over. \n\nBut alas, this plan would not work, as the way the chair was positioned, my brother would surely topple over. Cue my involvement. I sat down in that chair as if my life depended on it. My brother needed my help, so I’d be sure to give it. I watched as my brother climbed the chair, using the headrest as a step. \nHe peered over. \nI caught my breath. \nIt felt like eternity before my brother started to jitter and panic. \n\n\n\n“WHAT ARE YOU DOING UP THERE?!”\n\n\n\nHOLY TURTLE DOVES, \nI thought, as my brother clambered down the fence. The bloody neighbours had seen his boof of a head peering into their yard. Now panicking as well, I yelled at my brother to hurry down so I could runaway myself, but that wasn’t before the incident occurred.\n\nThe life changing moment that gave me my scar.\n\nI bet you’re wondering how it happened? Did my brother somehow topple the chair over and make me fall, cutting my hand on the pot plant below? No. Or did the neighbour throw over a cricket ball in anger, it landing on my head and causing me to bleed and have a little Harry Potter scar?\n\nNot even close. \n\nAs my brother rushed down from the fence, his feet came too close to my face. His big toe specifically. And in a moment you could say was set on 0.75 speed, his toe nail collided with my cheek, cutting my face.\n\nHe landed safely on the floor and ran to the outdoor table, including himself in my nan and her partner’s conversation as if nothing happened. But I knew something was wrong. My bloody face was burning!\n\nI abandoned the chair and the yells of fury behind me and darted for the bathroom. I looked in horror at my new battle wound.\n\nMy god, I looked like a prisoner you wouldn’t want to fuck with. The cut resembled la teardrop. Almost exactly so. It was rather fascinating in a way. But the stinging overcame the wonderment.\n\nI cleaned the wound as best as I could, being 10 years old and not very bright, and stuck a band aid on it. I know.\n\nI walked out and copied my brother; sitting at the table and acting like nothing happened. Of course everyone picked up on the bandaid, but I simply said I wanted to be a Christmas Pirate (doesn’t make any sense? I know) and they moved on.\n\nTo this day, I have that scar. Yes, it still resembles a tear drop.",
                "labl": 258,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "the guilt if i failed and everyone found out.",
                "labl": 9577,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Shelly Miscavige is either dead or being held prisoner by the Church of Scientology.",
                "labl": 21943,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "A lot of entertainment companies are money-laundering fronts.",
                "labl": 41922,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I believe conspiracy theories are the ultimate conspiracy. They send the message that there is some invisible hand controlling things, meaning there’s nothing you can do to change it. They instill complacency",
                "labl": 11682,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "It sounds crazy, but I'm getting a sneaking suspicion that the earth just might be spherical after all",
                "labl": 19163,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I was gonna say rim jobs then I saw all the thoughtful answers....\n\nEdit.  Thanks for the awards folks,  I'll pay it forward.  With rim jobs of course.",
                "labl": 1340,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Talk like a goofball to my kids. Read in silly voices. \n\nBack when I only had one kid, I wasn't even comfortable doing it when I was home alone with him. Now I can be silly at the store, in front of strangers with my kids.",
                "labl": 171,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Barking at men catcalling me",
                "labl": 1785,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "He farted very loudly and proceeded to say, “you got the wrong guy”",
                "labl": 6021,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "We’d have conversations. One of my favourites:\n\nYou shouldn’t fuck (mumbles)\n\nHuh?\n\nYou shouldn’t fuck (mumbles) in the ass. \n\nWhy would I want to fuck John Stamos in the ass?\n\nNo, not John Stamos, (mumbles), you shouldn’t fuck (mumbles) in the ass. \n\nWho?\n\nJOE NAMATH!\n\nWHAT?!\n\nYou said you were going to.",
                "labl": 1328,
                "true_bin": 3,
                "pred_bin": 1
            }
        ]
    },
    {
        "correct": [],
        "incorrect": [
            {
                "sent": "I'm unsubscribing",
                "labl": 147,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "One time, we were doing a rip out at an old factory. They were gutting them and turning them into luxury apartments. The elevator we were taking out was a shitty old freight that hadn't run in years. When we finally ran it up, we went down to inspect the pit. It smelled like a dead body had chilled there for half a century. The bottom floor wasn't lit so I shined my flashlight under the elevator and the whole floor started moving. Roaches. Nasty\n\nHaven't really found anything fun though. I've cleaned out more pits than I could count too. I gave my mom a cheap ring I found. Found a pair of underwear at a hotel. Found a full packet at a courthouse of some lady's case transcribed. Oh, I was on a mod once and one of the hoistway doors had an advertisement sticker for a tennis restringing service. Which was weird because it was somewhere only an elevator guy should be able to reach. I called the number, but it was out of service. I've found some cool grafitti from the 40s. That's about it\n\nI worked on escalators for a year and a half. There was a lot more in those pits. I was taking home bent up quarters every day. There was lots of shoe bits and I was always nervous of coming across used needles in certain units",
                "labl": 7268,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Retired 40 years in the trade the best I ever found was a $20.00 bill but know a man that found a $7000.00 diamond ring kept it for six months no one ever asked about it and he gave it to his wife.",
                "labl": 666,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "The National - Boxer",
                "labl": 283,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Pong",
                "labl": 616,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "So I broke my right arm when I was a kid then decided to put a cast on me. My skin under my cast is so itchy, its like my skin is alive. When 2 months have passed, I decided to scratch my skin under the cast using a pen since my fingers couldn't reach further areas. While doing so, I accidentally put the pen further away inside that I can't remove it under my cast since I can't reach it then I just ignored it after that thinking that it will be just fine and I didn't tell that to my parents since they would be mad. After 2 months, they decided to remove my cast since its already due but the night before removing my cast, my mom noticed that my arm smells rotten. So fast forward, they removed the cast in my arm in the hospital then they noticed that the pen was penetrating my skin for months and the hole is about a size of a penny full of pus. I didn't even feel a thing. After that, the hole eventually became a penny-sized scar in my skin.",
                "labl": 7462,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "I got drunk on 4th of July and fell in a utility hole thing in my friends yard and then got sunburned so the scar never healed properly",
                "labl": 876,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "This one pertains to my university, but some people may have the same experiences with theirs.\n\nSo students who choose my university send applications in by December. The entire COVID shutdown happens in March, around the same time university acceptances are starting to be sent out. Each first year student has guaranteed residence. \n\nEveryone is wondering what the new teaching model will be, and it’s announced that it’s mixed. 30% in person, 70% online. \n\nAt this point, if you’re in first year, and all your courses are online, why pay for residence? You can do class online. But the university sees these discussions, and know they’ll lose A LOT of money if they don’t have students in residence. \n\nSo what is announced? Almost EVERY first year has at least 1 person class. Meaning? They have to be on campus. MEANING, they have to live in residence. \n\nIdk if this makes sense to anyone but I thought it was interesting.",
                "labl": 4287,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "The \"UFO\" footage that just got released recently was a purposeful distraction from current events.",
                "labl": 3437,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Stay calm around women I find attractive.\n\nI use to get anxious and even avoid",
                "labl": 13971,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "I woke up one night with my wife's hands in my mouth. When I sat up and asked what she was doing her reply was \" I thought you were a vampire\" 20 years later I still tease her about that one",
                "labl": 139,
                "true_bin": 4,
                "pred_bin": 3
            },
            {
                "sent": "I'm not american, what does this mean for you guys?",
                "labl": 10933,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Well, for starters, my area was stolen from the emus when we drove them off the land, we've built a fine community in its place. The emus have yet to take this land back, until then, I have yet to see a wild emu anywhere near here.\n\nIf it were not for the war, I wouldn't be where I am today.",
                "labl": 1575,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "Is this a joke I'm too European to understand?",
                "labl": 1062,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Incubus-mornibg view",
                "labl": 198,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Your neighbors don’t come knocking on your door to see if you want to come play.  Sometimes it’s days before you actually interact with another human.  It gets lonely fast",
                "labl": 42,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "i was headbanging my hair dry in the bathroom, I hit the counter.  I was 8.",
                "labl": 9822,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "Fir needle cut me across the wrist while playing hide and seek out in the woods. A _fir needle_!",
                "labl": 1925,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Playing man hunt. Some idiot made the camp fire area base. I was running for my life to get there, jumped this huge pile of fire wood, tripped over something and rolled right into the fire. It could've been SO much worse, but I only burned my elbow and some of my hair. It's been probably 15 years and the scar is only about 3inches long and 1 wide.",
                "labl": 6595,
                "true_bin": 4,
                "pred_bin": 1
            },
            {
                "sent": "Was about 4 broke a glass jar and sat on it",
                "labl": 2181,
                "true_bin": 4,
                "pred_bin": 2
            },
            {
                "sent": "When I was 5, I was spinning around in the living room and then fell face first into the coffee table. I have a scar on my forehead from that lmao",
                "labl": 1757,
                "true_bin": 4,
                "pred_bin": 2
            }
        ]
    }
]