[
    {
        "correct": [
            {
                "sent": "FIVE battles with cancer during her term. Rest in peace!\n\n&#x200B;\n\nEDIT: lol the dozens of you commenting/messaging me saying how her passing is somehow a victory for the Republicans or Trump should take a long, hard look at yourselves.",
                "labl": 22928,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I have had more days off in the last 5 years for coughs and colds than Justice RBGI has had throughout her entire ordeal with cancer.\n\nWe may never see her like again, a true beacon of honour and fortitude.\n\nI hope cancer never fully recovers from being diagnosed with Ruth Bader Ginsburg and I look forward to her inevitable critically acclaimed biopic.\n\nI'm not American but I am proud to have shared a planet with her Justice.",
                "labl": 226,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Her body isnt even cold yet. \n\n[Mitch McConnell confirms court nominee will get Senate vote.](https://www.cnbc.com/2020/09/18/trump-nominee-to-replace-ruth-bader-ginsburg-on-supreme-court-will-get-senate-vote-mcconnell-says.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard&fbclid=IwAR2KZ7RffOeCRFO0wZvEelyxp4GCRK-CMqPxlwmT-3U1XpPjZXQqrp5FU0E)",
                "labl": 978,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "McConnell in 2016 under Obama: \"Because Scalia's seat had become vacant during an election year, the Senate would not even consider a nomination from the president.\"\n\nMcConnell in 2020 under Trump: \"Trumps nominee for Bader's replacement will get the Senate's support.\"\n\nDECLARED IMMEDIATELY AFTER RBG'S DEATH\n\nMcConnell is a shameless snake. What are his motivations? Why do Republicans respond well to their representative playing the system? What can America do to stop a party from playing with people in order to gain control longer than welcomed? Why don't Republicans and lawmakers see that this is a dangerous game?",
                "labl": 360,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Every day I live in constant fear of the emus' inevitable swift and bloody reprisal, I wouldn't wish for anyone to have to live this way but all we can do is take each day as it comes. My great uncle Bazza has it worse, he fought in the war and it still hurts him to this very day, he can't even see a chicken without having a complete meltdown now. For me by far the hardest thing about living under the shadow of the emu is th- hold on, I think something just breached the birdseed perimeter outside my bunker, I hope they don't make it past the line of hanging CDs. I'm gonna go check it ou-",
                "labl": 179,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Why do you think we have to ride kangaroos to school",
                "labl": 6,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "ex and i were moving out after a breakup. cleaning out garage. she was being critical of my post-breakup plan of moving in with a coworker until i could find a better place to live, as most options weren't great.\n\ni took a deep breath and laughed. this puzzled her. why are you laughing, she asked? i collected myself and said \"because this is the last time i have to listen to this. you don't get to be critical of anything i ever do, ever again!\"\n\nit was a really great feeling, because i literally thought of the \"you have no power here\" as i laughed.",
                "labl": 934,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I was working as a consultant for a company, there was a bit of a competition between me and this guy, company starts to have some financial issues so I leave and start working for a client of theirs. Shortly after joining they bring in this guy I was competing with at my old job, he was technically my equal except now I was employed by the client and he was just a consultant. He was trying to one-up me during meetings and my boss told him that decisions are made by the company not the consultants. It felt good.",
                "labl": 28726,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Probably watching a few Texas DPS Officers realize they couldn't shut down a whole airport.\n\nI was working as a flight instructor at small airport on a Saturday afternoon.  We had one plane that had an issue on takeoff and veered off the runway, it cartwheeled and totaled the airplane but fortunately the pilot was not serious injured.  I had a student who was next in line for takeoff when it happened, he called me from his phone as it happened.  I hopped in the airport car with one of the rampers and drove out to the plane with a radio to inform inbound planes to use the other runway (we had no control tower).  On the way to the runway I called the airport manager who drove to the airport and on his way he made a phone call to officially closed that runway.\n\nAbout 30 minutes later a metric fuckton of DPS officers showed up and immediately tried to close the whole airport, treating it like a giant crime scene.  They were carelessley driving around the airport like they owned the place, ignoring the planes that were moving around, and crossing our only open runway without regard to inbound traffic.  A mechanic and I tried to tell them to be careful and they got mad at us.  One of them told me they were \"locking it down\" a couple times, meaning the whole airport.  Now I was a broke ass flight instructor and I had a flight that afternoon that was ultimately going to help pay for me to eat that week.\n\nThe airport manager was a short stereotypical country guy, also former Navy.  He was not intimidated at all by the cops trying to close his airport.  When he showed up I was about to go out with a student who was preflighting for a cross-country.  There were about 5 cops in the lobby, me with my flight bag, the airport manager, and a mechanic.  One of the cops saw my flight bag and said \"I don't know why you have that or why he's out a the plane, you aren't going anywhere\", the moment he finished his sentence the airport manager said \"it's one runway that's closed, the airport is still open.  This pissed off the cops.\n\nI was about to head out the door, and one of the officers said he was driving out to the disabled plane.  Idky, the pilot had been gone for about an hour.  The mechanic said \"you need to be careful\" and the cop quickly retorted \"AND WHY THE HELL IS THAT?\" and he said \"because this is still an airport, and the first thing that hits you is going to be a propeller\" a few seconds later a plane took off as one of the cars was approaching the runway intersection ironing in that point.\n\nI walked out, and as I was hopping in the plane with my student the same cop came up to me and said \"you aren't going anywhere, we're locking this down!\"  I looked at the airport manager who followed all of us out to the ramp, he said \"have a nice flight AjaxBU!\" \n\nYou could see these cops just fuming that they didn't have the authority to close down an entire airport because one plane went off the runway.   The airport had two runways, where the disabled plane was located was probably a mile or so away from the open runway.  Why they were making a big fuss, I don't know.  The occupant was relatively uninjured, his wife was the worst thing he had to deal with that day, he told her he wasn't going to fly.\n\nWe had a good flight, and I got to eat dinner that week.",
                "labl": 7674,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "When my shitty father kicked me out of the house and then demanded he have access to my bank to \"control my financial situation\" and I got to tell him \"you have no control over me anymore. You set me free when you kicked me out and now you cant do shit\"",
                "labl": 17077,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Had a client at an animal hospital get upset when the veterinarian was a female. This lady legitimately threw a fit and refused to let the arguabley much more qualified doctor see her pet for no other reason than that the vet was female. So, the doctor told her to get out. The lady wouldn't leave and started yelling at and berating the doctor, threatening to call the owner of the clinic. She even whipped out her phone and acted like she was going to dial.\n\nNow someone saying they know the owner is something that is very very common, as the owner is still a practicing vet well over 60 hours a week, and has been for 20+ years. Probably thousands of people have this guy's number. Most of them on the older side that try to flex it, though. \n\nSo our female vet said go right ahead, I'm calling the cops if you don't leave. And that's exactly what happened. The client quickly left once the vet started speaking with the dispatcher. The police still came and took a report.\n\nLater when the owner caught wind, he left a note on her account that she was no longer welcome in our clinic :)",
                "labl": 174,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I worked at a Walmart as a cashier, and the assistant manager there was a dick, he would insult everybody working there and forced us sometimes to do work above our pay grade.  6 months later me and him got transferred to another Walmart that was just built and they needed to pick a manager and assistant manager some random got manager but I got assistant manager (I guess all the complaints on the assistant manager basically gave him a demotion) so one day he was ordering the other cashiers around then i pulled him to the side and told him that if he kept pulling the same shit around he would be out of here.  I haven't heard anything from him since.",
                "labl": 24364,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My mother made my childhood hell (unpredictable moods, every second weekend would be family drama weekend with day long tirades about how everyone hates her and we are horrible to her and surely we are so vile and want her to leave; yelling and abuse got so bad I got panic attacks and nothing was done about it, random beating, crying, insults, very controlling, went through my letters and diary, called me a whore or dumb as a cow when I came home 15 minutes too late, the works)...After what seemed like ages of struggling, I finally managed to move out at age 21, to an address within the same city.\n\nHer whining continued. Why would I not give her keys to my apartment? Why did I not phone in every day? Where was I, who was I with, what was I doing at every time of the day? I must hate her! I must be looking forward to dancing on her grave!\n\nI tried to not react and give her more ammunition, but when she ended up asking at some point \"Why are you not coming by and visiting us every day??\", I finally replied \"because I don't live here anymore\", and THANK GOD it shut her up.\n\nEdit: Ironing out some typos, formating. Also whoah thanks for all these likes you guys.",
                "labl": 6304,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I had a short stint as private investigator who specialized in providing investigative services to public deffenders.\n\nWe had this one county that was notorious for a sheriff's department that would make BS traffic stops as a pretext to search vehicles. One deputy in particular came up time and time again for this kind of thing.\n\nI was asked to interview this deputy for a defense attorney. Deputy had some of the worse report writing skills I've ever seen. Riddled with grammar and spelling errors. Quite often, deputy wouldn't even include the reason he pulls people over in his reports. \n\nSo I go to interview the guy. As part of the process, there's a senior sheriff's rep there that basically is suppose to protect deputies from people like me and keep them from saying things they shouldn't. \n\nWe sit down and I pull out his report he wrote on the stop he made on my client's defendant.  I've already marked it up, English teacher style with a red pen and start with, \"I had some trouble understanding your report.\" I proceeded to go error by error for the purpose of \"clarifying\" the report. He's getting redder and redder. I then go into trying to determine why he pulled over the defendant because it's unclear in the report. He's not able to give a definitive response.\n\nAll the while, the sherriff's rep, whom I've worked with a lot and who I have seen be very vocal protecting deputies in interviews like this in the past, is silent. Ultimately, charges against client are dropped.\n\nMonths later, I'm driving through the area on the way home from camping, not speeding or breaking any traffic laws. I get pulled over by a deputy. It's the same deputy. He recognizes me immediately, stammers and manages to say, \"Uhhhh, it's almost dusk, turn on your headlights.\" He gets back in his vehicle and takes off before I've even started my engine.",
                "labl": 158,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I have one that crosses with \"I don't work here lady\" a bit.\n\nI have a job, but I will still do interviews every couple years.  this means the script is flipped a bit.   They have to convince me to work there.\n\nAnyway I got the town early so I stopped at a bakery to get something to eat.  the woman went in the back to get it, and this squat toad of a woman walks in, yells at me to get her order and then yells at me again for not getting up right away to serve her.  When I point out that I do not in fact work there she goes off me about how important she is etc.   We can skip the play by play.\n\nI go the interview.   Head of IT and the toad woman walks in.   She has this evil grin on her face.   I stop everything.   I point at the toad woman and I say something like \"I have seen how your managements treats people, and I have no interest in working for you\"  and I take my resume out his hands and walk out.     The look on her face was priceless.   Oh and he had walked in with a print of a resume, so I took his copy.\n\nFelt great to do.\n\nEdit: And gold? thanks kind stranger!\n\nEdit 2: Reward overload! thank you all so much",
                "labl": 13607,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "In my first apartment, my parents came to visit, and I said \"Fuck!\" when I hit my head on the open door of the freezer while standing up from grabbing something from the fridge.\n\nMy mother said \"You can't talk like that in my hou...\" and stopped midsentence.",
                "labl": 30318,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A museum in a town added to its collection a replica of Michelangelo's famous nude statue, *David*.\n\nThe pastor of a nearby church demanded that the curator remove it from display because it was \"inappropriate\" for public viewing.\"\n\nTo her credit, the museum's curator told the clergyman in unequivocal terms that the church had no say in the matter and that fine art would be exhibited without need for ecclesiastical approval.\n\nhttps://en.wikipedia.org/wiki/David_%28Michelangelo%29#/media/File:'David'_by_Michelangelo_Fir_JBU002.jpg",
                "labl": 781,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "One of the managers at my previous employer was living near me. I was not reporting to her, but my manager was sitting right next to this woman so I had to see her multiple times every day. One day she found out that I lived on the same street as her, and started forcing me to visit her. I kept making excuses, but at one point I couldn't come up with any more excuses. \n\nSo I visited her. She sat me down and asked me why I was renting a house by myself, what caste my room mate was, and told me not to have \"lower caste\" people room with me, all the while subtly trying to find out what caste I was. I hated her. I couldn't really do anything about what she spoke because the HR was not even taking sexual harassment complaints seriously, let alone this one. \n\nAlso it turned out, my apartment's owner was friends with this woman and she had a spare key to my apartment that she stored on behalf of the owner who lived abroad. If she found out that I was in a relationship with someone not from my caste, then she could tell the owner and they could have kicked me out for being sinful in their house.\n\nIn few months, I found a better job and I gave my notice at that workplace. I was also getting married in few weeks, so I was moving out of that house. Although I didn't expect anyone from that office to attend my wedding (my wedding was held in a different state), it's kind of disrespectful in our culture if you don't invite everyone you know. It was my last day in that organization, and I was going around giving wedding invites to everyone. \n\nWhen I went over to my manager's desk, this lady was all smiling and waiting to get the invitation next. I simply invited my manager, then smiled at this woman, and walked away. Also, I invited everyone in my apartment except my house owner who specifically requested that I mail her my invite. My house owner called me after I vacated and asked where the invite was. I told her that I forgot and didn't have any left.\n\nBoth of them didn't hold any power over me anymore and both my employment and my housing situation were not in their control so they could really do nothing about me disrespecting them.\n\nThis might not be much, but it felt so good when I did it.",
                "labl": 351,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I grew up fairly poor. In some of my HS classes there was a very rich girl who liked to lord power over people. She had the teachers convinced she was a saint, though. One day she and I got into an arguement and we were sent to the vice principal's office. I thought I was doomed. Low and behold, the vp wasn't there that day and the art teacher was filling in for this sort of thing. We told him what happened and I mentioned that she acted like she was better than everyone else because she has nice clothing and money. She yelled that I was a liar and the art teacher said \"you do act like you own the place\". She was shocked and shut the hell up. Knowing someone finally believed me was just blissful.",
                "labl": 472,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I had an elderly lady come into the pharmacy I work at when I was roughly 17. It’s a community pharmacy and all the patients and people in the community have been going there awhile, they know the owner and he knows them. She was acting really suspicious and terse with the employees, walking around shrinking away from people and shit. I saw her grab something and put it into her purse, a couple things of robutussin.\n\nI walk up to her and say “ma’am I need you to put that back or pay for it, and if you were wanting to sell that or use it to make something, it doesn’t even have the right ingredients” (I should clarify that this is in Clarksdale, MS one of the biggest meth and drug abuse places in the country)\n\nShe acts accosted and starts screaming that I need to unhand her and stop trying to abuse her and then “IM GOOD FRIENDS WITH THE OWNER AND I WHEN HE HEARS HOW RACIST AND ABUSIVE YOU ARE I HOPE YOU LEARN TO BE A PROPER MAN WHILE FINDING A NEW JOB!” \n\nSo I stayed in front of the door and calmly said “ma’am I’m sorry I’ve offended you. The owner is here today, actually.”\n\nShe walks back and starts hollering “where is Eric?! This young man is abusing me!” The owner rushed out, looked at me and said “what happened?” “She said “he accused me of taking medicine” and I looked at the bag. The owner and pharmacist looks at me then asks her “Did you take any?” She said “Mr. Eric I’ve known you since I moved here four years ago and I don’t like this little boy you have working for you. His mama didn’t teach him how to treat a lady!” To which he said “I think she did a fine job, she’s my wife. Let me see in your bag.”",
                "labl": 181,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A few years ago I was helping my parents move to a new house locally. My father is fairly particular and told me he has reserved a U-Haul truck for specifically 24 hours as we are going to need to make a few trips across a large metro.\n\nI go in to pick the truck up for him, and look at the sheet stating the truck needed to be back in just over 3 hours (we were about 35 minutes late, but that would be okay with 24 hours). I tell the fellow behind the desk that this should be for 24 hours, and he says it is not in the system and it is spoken for already after we return it for another rental. I ask if there is anything we can do at which time the owner comes over to see what the issue is.\n\nI explain it to him and he proceeds to chastise me, saying we must not have ordered it correctly, if we need it so long why are we 35 minutes late, and a bunch of other down talk. By this time my father comes in to see why I have not come out, and also gets talked down to which upsets me internally. I tell the owner that we need to move at least the big things, so if we only have 3 hours we will make it work the best we can (then rent another truck elsewhere during the week) but he keeps chewing up more time arguing then says the kicker. He will look up the call recording to see who is right. I have absolute trust in my father when he says he did something, so I agree and wait.\n\nTurns out the owner was the one that took the call and he gets smug. \"I have done this for 20 some years and I don't make mistakes.\" Five minutes later, sounding defeated, he is asking us to bring it back early so we don't mess up another person's move (guilting us for his mistake that he never makes). On the call you clearly hear my father asking for the 24 hour rental with multiple confirmations from the owner throughout the call. Guy was a real jerk, never even apologized for anything. Also left a lengthy detailed review on multiple sites and emailed U-Haul corporate. It is now my most \"helpful\" review on just about every platform.",
                "labl": 171,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "I had to clean some bad isolation at the top of the elevator chamber. So the maintenance guy bring the elevator with the top at the second floor and we go on top to drive to the top, on the elevator cabine were a few pairs of women underwear and used condoms. So someone was having sex on the top of the elevator, how the got there was a mystery because it was a very modern one and you need a special key to open the control box to access the top of the elevator.",
                "labl": 231,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Rudyard Kipling, author of 'the jungle book.'   Paraphrasing, \"the only way to keep the yellow man out is to bring the white man in.\"",
                "labl": 2604,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Deus ex!",
                "labl": 197,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "FTL (faster than light), Darkest Dungeon, Terraria, Cardinal Quest 2 (mobile game), Rymdresa, Bomber crew\n\nWow people need to play more indie games.\n\nEdit: I just looked at my stream library and have so many more to add.\n\nUnturned, dungeon of the endless, The binding of isaac, crypt of the necro dancer, realm of the mad God, spelunky, CASTLE CRASHERS!!",
                "labl": 2368,
                "true_bin": 1,
                "pred_bin": 2
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "I got hit on the bridge of my nose by a ceramic toilet seat when I was learning to pee like a big boy.\n\nNow I think about it - that's probably the best outcome there.",
                "labl": 12323,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I used a pressure washer on my foot",
                "labl": 19382,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I climbed up the drain pipe of a school, put my thigh in the spike that's supposed to stop me from climbing. Didn't stop me from getting to the roof.\n\nEdit:spelling",
                "labl": 407,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Teacher: \"Go to lunch, but do not run! I'll be watching you all.\"\n\n8 year old me proceeds to walk to lunch facing backwards, checking to see if the teacher is still watching - she is. Eventually I accept defeat, turn to walk forwards, and collide head first with a piano.",
                "labl": 257,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I was standing very close to my cousin while playing mini golf when i was like 6 or 7. This fucking girl swings it like she is tiger woods at the PGA tour and smacks me right above my eye.",
                "labl": 49,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "\nIt’s finally my time to shine!!\n\nIt was Christmas Day, 2010. I was 10, my brother was 12. I was in that stage of my life where I greatly admired my brother, and basically followed him around and did what he ordered me to do.\n\nAt this given moment, my nan and her boyfriend were at the table sitting outside enjoying the sunshine and listening to Mariah Carey. My mum,  preparing the Christmas feast of ham and roast veg. My dad, probably trying to figure out how to make ice with the new ice machine and cursing his existence.\n\nNow for a little more context, I’ve grown up in the Australian suburbs. This is important to reference, as it explains why my brother and I were trying to peep over the fence to see what our loud neighbours were doing. You’re probably confused...I’ll explain. In Australia, it’s common culture to extend to your neighbours, or the entire street, an invitation into the family.\n\nThis includes inviting them over to celebrate birthdays, having afternoon siestas on the front lawn, joint Australia Day bbqs, that kind of thing.\nHowever, my family was never really close to the neighbours behind us. I personally feel like this is because they never cut their bloody tree that’s palms dipped into our yard. \n\nAnyway, on this particular Christmas, those neighbours were being louder than usual. My brother, being the nosey bastard he is, decided he wanted to see what the commotion was all about. So he decided he had a plan; get a chair, put it against the fence and look over. \n\nBut alas, this plan would not work, as the way the chair was positioned, my brother would surely topple over. Cue my involvement. I sat down in that chair as if my life depended on it. My brother needed my help, so I’d be sure to give it. I watched as my brother climbed the chair, using the headrest as a step. \nHe peered over. \nI caught my breath. \nIt felt like eternity before my brother started to jitter and panic. \n\n\n\n“WHAT ARE YOU DOING UP THERE?!”\n\n\n\nHOLY TURTLE DOVES, \nI thought, as my brother clambered down the fence. The bloody neighbours had seen his boof of a head peering into their yard. Now panicking as well, I yelled at my brother to hurry down so I could runaway myself, but that wasn’t before the incident occurred.\n\nThe life changing moment that gave me my scar.\n\nI bet you’re wondering how it happened? Did my brother somehow topple the chair over and make me fall, cutting my hand on the pot plant below? No. Or did the neighbour throw over a cricket ball in anger, it landing on my head and causing me to bleed and have a little Harry Potter scar?\n\nNot even close. \n\nAs my brother rushed down from the fence, his feet came too close to my face. His big toe specifically. And in a moment you could say was set on 0.75 speed, his toe nail collided with my cheek, cutting my face.\n\nHe landed safely on the floor and ran to the outdoor table, including himself in my nan and her partner’s conversation as if nothing happened. But I knew something was wrong. My bloody face was burning!\n\nI abandoned the chair and the yells of fury behind me and darted for the bathroom. I looked in horror at my new battle wound.\n\nMy god, I looked like a prisoner you wouldn’t want to fuck with. The cut resembled la teardrop. Almost exactly so. It was rather fascinating in a way. But the stinging overcame the wonderment.\n\nI cleaned the wound as best as I could, being 10 years old and not very bright, and stuck a band aid on it. I know.\n\nI walked out and copied my brother; sitting at the table and acting like nothing happened. Of course everyone picked up on the bandaid, but I simply said I wanted to be a Christmas Pirate (doesn’t make any sense? I know) and they moved on.\n\nTo this day, I have that scar. Yes, it still resembles a tear drop.",
                "labl": 258,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I called someone I barely knew a couple of days before I planned it to basically unload what I couldn't say to those closest to me. It sound backwards I know but I wasn't really thinking straight back than. I don't think they understood the reason to the call becusse we shifted to talking about roommates and I had a good laugh for the first time in a while. I decided after we hung up that if a stranger could make me smile that I wanted to try to meet those who could make me happier and hopefully be that person for someone else. A year later and I can happily say I'm better and enjoying life, I found that the only real person though that can make me happy was myself. I just needed to give him a chance. \n\nThat person that I originally called, I am still in contact with them but haven't told them how much they helped me that day yet mostly out of being nervous lol. I hope to repay them though with never leaving their side because they came to mine without even realizing it and I am forever grateful. \n\nMy advice to anyone making this far I'm my response lol is it doesn't cost you anything to listen and be nice, someday you may help someone more than you will ever realize!",
                "labl": 4704,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I fully planned to kill myself until I wrote a song in G minor.\n\nAnd it was really, really beautiful. And I wanted to see if anything else that beautiful was in me.\n\nIn retrospect it was a really pretentious angsty piece of crap but it saved my life!",
                "labl": 8581,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Found my father's pistol, but couldn't find the bullets.",
                "labl": 283,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I used the up coming video game release schedules of the years i would lose. Not even the announced releases but the ones in the future that I wouldn't even get to know about.   Pretty lame but it was enough.",
                "labl": 242,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My dog, he was the only one who cared when i cried and when my parents would scream at me",
                "labl": 801,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Thinking about my family/ friends and how hurt they would be",
                "labl": 300,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "My kids.\n\nEdit: Stay strong friends, our kids need us now more than ever. Reach out if you need someone to listen, I start work at 11pm CST, Saturday to Tuesday.",
                "labl": 560,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Um ok game of thrones. Really. Not season 8, of course. Some time around season 4 or 5 (whichever came out in spring) I made a really half-assed suicide attempt and was going to try again, I just wanted to wait a week until the first episode of the new season. It came and I wanted to watch the next one. By mid-season my meds finally kicked in and the weather got really nice, so I got through.",
                "labl": 282,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "When my gran died I had been suicidal for over a year and when I lost her I just felt so selfish cause life without her was so much worse... and I don’t know it just sent me into a spiral or well what else am I missing. I can live for her it’s what she would have wanted ... and I decided to give it a few years ... I’m now 20 graduating college next year and getting married in two weeks \n\nMy health both psychical and mental has changed so much but I still miss her so much everyday. She was a gift I didn’t recognize until she was gone and for that I’m forever shameful",
                "labl": 131,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "This thread...",
                "labl": 220,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "This one pertains to my university, but some people may have the same experiences with theirs.\n\nSo students who choose my university send applications in by December. The entire COVID shutdown happens in March, around the same time university acceptances are starting to be sent out. Each first year student has guaranteed residence. \n\nEveryone is wondering what the new teaching model will be, and it’s announced that it’s mixed. 30% in person, 70% online. \n\nAt this point, if you’re in first year, and all your courses are online, why pay for residence? You can do class online. But the university sees these discussions, and know they’ll lose A LOT of money if they don’t have students in residence. \n\nSo what is announced? Almost EVERY first year has at least 1 person class. Meaning? They have to be on campus. MEANING, they have to live in residence. \n\nIdk if this makes sense to anyone but I thought it was interesting.",
                "labl": 4287,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Collegeboard isn't non-profit",
                "labl": 23217,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "That Mexican drug cartels continue to exist because they do the governments dirty work, without implicating the government.\n\nEdit: Ed Calderon interviews, and Narcos paint a fairly accurate picture. [los narcos gringos](https://youtu.be/KJuL2ncZcQU) (spanish video) by Jesus Esquivel illustrates the extent of US involvment, and how the cartel exploits racial tensions in the US, to ensure attention  from authorities is focused elswhere. Its worth watching.",
                "labl": 5645,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "A lot of entertainment companies are money-laundering fronts.",
                "labl": 41922,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I still to this day believe that for every sock that goes missing in your dryer it turns into a tupperware lid in you cabinent that fits nothing.  I have seen no evidence to disprove this.",
                "labl": 11376,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "A large chunk of my taking the lord's name in vain would go away.",
                "labl": 41259,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Do you want a Holy War? Because that's how you get a Holy War.",
                "labl": 26069,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "“They are illusions Michael! A trick is something a whore does for money”",
                "labl": 691,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Rip",
                "labl": 9,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I was a salesman at a wire and cable place. I got a call Friday morning from a tow truck driver freaking out. He needed a replacement cable for his truck ASAP because the weekends were the big business days for him, bragging about the big money in people who leave their cars somewhere overnight because they're too drunk to drive home. He was shitty and rude the whole time we were on the phone. He demanded that the cable be cut and shipped immediately, sent next day air, saturday delivery (pretty expensive). I rushed his order, ran back to the warehouse to hand it to the manager myself to make sure it could jump in line and get cut before the next day air guy showed up. But we did it, rushed every part of it and got it shipped out in time. Every person involved prioritized this order to get it out to him on time.\n\n\nTow truck dude calls me back later that afternoon saying he got the truck working and no longer needs the cable. He asks to cancel the order and get a refund. I explain to him that because he had it cut to a specific length, if we were to take it back, there would be a restock fee (because we're not going to be able to resell it until someone needs that exact specific length). I also explain that I can't refund the shipping costs because the order has already been shipped the way he demanded it be sent out.\n\n\nDude loses his mind. Screaming at me telling me he's going to give the company terrible reviews everywhere and tell all his friends how we're all pieces of shit. There was literally nothing I could do for him. No amount of him being an asshole could uncut and unship that order.",
                "labl": 333,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "We had an HR lady who was extremely power hungry. \n\nShe is walking around with the president of the company who flew in from Japan. She rushes him though the warehouse. Just spits  out “oh these are the warehouse guys we don’t have to stop and talk to them.”\n\nHe stops walks over and starts talking to me about my last vacation. How buying my house went. You could just see her fuming behind him as we talked for almost 45mins. I’ve had multiple meeting with him we knew each other really well.\n\nI don’t think he liked her and drug it out on purpose but I was thrilled to see her just standing there bored as hell.",
                "labl": 53836,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I was a cashier working at the returns counter for a big box store. Customer wanted to return a drill that stoped working after he dropped it in wet concrete. I told him I couldn't take it back. He got all huffy and wanted to see the manager. The manager backed me up and refused to take it back as well. Things escalated and the customer threatened to call the CEO, \"who was a personal friend\", and get us both fired.\n\nI had recently done some volunteer work that the CEO was heavily involved in and had directly work with him on it over the past few months, so I had his personal phone number.\n\nI took out my phone and brought up the CEOs contact page on my phone. Showed it to guy and asked if he wanted me to place the call for him.\n\nHe threw the drill in the trashcan and stormed out. The look on my managers face was priceless.",
                "labl": 248,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "At the old courthouse I worked at, the stairs leading to the courtroom were often crowded. As I was trying to squeeze by everyone after stopping downstairs, some guy towards the top of the staircase intentionally stepped in my way and refused to move. After asking him to politely move twice, he made a comment under his breath (but purposefully loud enough so I heard it) that I should essentially go screw myself and that lawyers are entitled assholes and should wait in line like everyone else (which they actually do). He didn’t move so I said sorry and quietly waited behind him for a few minutes. \n\n20 minutes later, I call him out of the courtroom to plea bargain and got the satisfaction of seeing his face when he realized I was the prosecutor",
                "labl": 166,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I would start a blog on my pc and then switch to my phone to check if it now has updates from the future. If so, my future self could talk to my present self.\n\nI could read about my mistakes and try to avoid them. If a post disappears, that would mean that I did it right.\n\nEdit: Holy shit thank you for all the likes and awards!",
                "labl": 25435,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Ghislaine Maxwell suicide date",
                "labl": 4494,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "If I had unlimited searches I'd probably look up the Reddit frontpage first.\n\nThere's a lot of information in there that would give a good general explanation about that timeperiod. And from there on I could search up anything that seems interesting while already having some context.",
                "labl": 986,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "A, cause I don’t have a dick. Being hard all the time isn’t an issue",
                "labl": 8842,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "This question is just \"would you rather have erectile dysfunction or crippling self esteem issues\"",
                "labl": 1731,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I never watched it as a teenager, only as an adult but Red Foreman from that 70s show is quite relatable.",
                "labl": 258,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Goddammit, T-Karen, your gender reveal T-party brought a fucking meteor down on us. Great job.",
                "labl": 536,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Wife already has that - though the friend part of it is rapidly waning.",
                "labl": 882,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Non Americans must think this was written in another language.",
                "labl": 118,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "The Cars debut album,  The Cars",
                "labl": 5309,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Supertramp-Breakfast in America",
                "labl": 4416,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "A Night at the Opera by Queen",
                "labl": 5019,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Mac Miller- Swimming, Watching Movies with the Sound Off, Circles (all his music is incredible)\nRadiohead- In Rainbows \nJohn Mayer- Continuum, The Search For Everything\nArctic Monkeys- Favourite Worst Nightmare, Humbug, AM",
                "labl": 531,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    },
    {
        "correct": [],
        "incorrect": [
            {
                "sent": "Republicans fought tooth and nail to prevent a supreme court justice being appointed in an election year 4 years ago\n\nTime to see hypocrisy of the highest order from McConnel. \n\nAnd not a single conservative will care. No matter how far the courts are stacked.",
                "labl": 6451,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Yeah, dude, I saw the funny cartoon going around also. Don’t steal jokes.",
                "labl": 23,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "You will not always have Mambo No. 5",
                "labl": 4887,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "The pain.  Bodies start breaking down.",
                "labl": 10318,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Drunk, and leaned down to kiss a strange dog on the nose, of all things. 27 stitches down my nose later...",
                "labl": 1399,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Was probably 10 when I fought with my younger brother over who gets to use the knife first to slice our own fruits and I tried snatching it from him. I still have one scar on each of my first four fingers forming a straight line from that cut lol",
                "labl": 240,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "If you ever need help, then please know that there are many qualified people who would like to help you.\n\nhttps://www.iasp.info/resources/Crisis_Centres\n\nhttp://www.befrienders.org/\n\nhttp://www.suicidepreventionlifeline.org/GetHelp/LifelineChat.aspx\n\nhttps://translifeline.org/ [US & CA]\n\n\nhttp://www.samaritans.org/how-we-can-help-you [UK]\n\nhttps://www.lifeline.org.au/Get-Help/ [AU]\n\nThere are crisis services worldwide that are trained to provide support. They are designed to give temporary relief from feelings that are overwhelming you and while they are unlikely to fix any underlying problems, can help you get through a tough hour/night/week. Chat services are usually available on these sites. In the US, calling 211 or going to their website is a free referral source. They have providers who will see you regardless of your ability to pay. Just as you would see a doctor when you are sick, you deserve to take care of your mental health.",
                "labl": 1,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "The few friends who still stayed  in contact with me. They were the small glimmer of light who kept me in this world.",
                "labl": 13602,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Just a casual fan of this one but that Christopher Walken knows whether Natalie Wood's death was an accident or not.",
                "labl": 9147,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "The third shot that hit JFK was fired by a Secret Service member. But, it was entirely an accident.\n\nThe motorcade surrounding him was full of secret service. Some were standing up on the seats. When the first shot was fired, they were all on high alert, fingers on the trigger, looking around. The drivers all hit the breaks. A guy standing up in the back lurched forward and pulled the trigger by accident. This shot hit the president. He had already been hit twice and was pretty much toast, so it didn't matter. But they covered it up.\n\nI like it as a conspiracy theory because it reduces such an important mystery to a pure human accident. Which is what a lot of historical events are.",
                "labl": 1001,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "The U.S and other world leaders aren't some genius masterminds, with infinite knowledge, resources, and information, but are a bunch of people in way over their heads barely keeping their shit together, with one trip away from fucking everything up.\n\nPersonally this terrifies me more than if they were evil masterminds, at least those are in control...",
                "labl": 656,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "My Chinese college roommate (he speaks good English but has a fairly thick accent) once sat up in bed, said in perfect, clear, American accented English, like a 30s radio announcer, “what a beautiful creature,” and went right back to sleep.",
                "labl": 267,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Goddammit, T-Karen, your gender reveal T-party brought a fucking meteor down on us. Great job.",
                "labl": 536,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "This aint r/showerthoughts",
                "labl": 215,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I'm 39.\n\n&nbsp;\n\n#1. Life is work. \n\nEverything requires perpetual maintenance. All elements of your life, be they self-care, friendships, relationships, work-life balance, health, your house, your car, bank accounts, etc. require **constant** repair. This is our attempt at slowing down entropy. We'll never stop it, as the [energy of the universe](https://www.youtube.com/watch?v=w2iTCm0xpDc) is constantly trying to seek perfect equilibrium, and our efforts only last a lifetime. If you wish to be even *remotely* successful in life, you will recognize how much work you will need to put into every little thing. Otherwise, you'll end up like me: alone, unloved, unhealthy, and ready to die at a moment's notice.\n\n&nbsp;\n\n#2. \"Know thyself.\"\n\nIf you don't know who you are, you're gonna have a bad time. You need to understand that your life is HEAVILY impacted by various forms of luck: where you live; how much money your family has; how abusive your family is; the school system's resources; the literal air that you are breathing. These all have an impact on your life, and the possibility of your future life. The opportunities or obstacles of your life are LARGELY dictated by simple factors of luck. Not all, but I'll get to that.\n\n&nbsp;\n\n#3. \"Be yourself\"...is horseshit.\n\nIf you don't know who you are, *how the hell can you be yourself‽* How do you overcome this catch-22? \n\nA better variant, IMO, is ***\"be the person you wish to become\"***. Not a living or dead person that you hope to magically morph into. But the person that you, in your mind, wish to be in the future. \n\nDo you want to [be kind](https://www.youtube.com/watch?v=sicUhD1n-es), or ruthless? Do you want to be respected, or feared? To you want to help, or hurt? Those are broad and vague, and there are many many more, but they're starting points for how to approach your future. If you've decided to be ruthless, then you'll begin to adapt behaviors that go that route. If you're a meek and timid person who can't even say their name clearly (been there, done that, relevant username now), you're not likely to command any kind of respect.\n\nIf who you are right now is not what you want to be, then \"being yourself\" is the worst advice you'll receive. You must change yourself, because whether you like it or not, change occurs, and you can't control the majority of those changes. So change the ones you *can*.\n\n&nbsp;\n\n#4. Friends come and go.\n\nThe reason you have friends *right now* is because of geographic (and, to a not-to-be-dismissed degree, socioeconomic) reasons. Once you stop going to the same schools, and movie theaters, and book stores, and restaurants, etc. the friendships will begin to diminish. You will more likely grow apart over time, not together. It's possible, sure. But don't make any heavy bets, because you'll lose money on those bets more often than not.\n\nYou'll need to find new ways of making friends. College is yet another school-related location that can help. Clubs help. Hobby-related activities help. \n\nRight before COVID lockdowns here in LA, I made a friend with my tattoo artist, barely knew him otherwise. He mentioned he and his friends were gonna start watching crappy 80's horror movies on the weekend. I was down. Then the lockdowns hit, and we couldn't do it. And I'm bad at making friends with new people I've barely met, so I've made no attempts to reconnect. Maybe when I get back to the tattoo shop. Goes back to point #1.\n\nMaking friends will be hard. But if you're lucky, and make enough connections, it won't be *as hard*.\n\n&nbsp;\n\n#5. \"Expect the best, prepare for the worst.\"\n\nHaving a positive outlook is healthy. If you're perpetually despondent, hopeless, and listless, you probably have depression, and that needs tending to. But ONLY having a positive outlook will lead you to trouble. You must prepare for the times when life throws a wrench into your car tire. Saving money is necessary. Blowing it all and wondering how you're gonna eat next week is pointless drama you've placed upon yourself. Get a checking account, a savings account, and a retirement account. Even if you only put $10 / week into the thing, AND LEAVE IT THE HELL ALONE, you'll likely have a nice rainy day fund when the shit hits the fan. \n\nLiving in a fire-prone region? make sure you have proper equipment in case wildfires become too dangerous. Earthquake kits, first aid kits, bottled water, blankets, etc. \n\nIf you don't live in a place with reliable mass transit, best make sure you have a car that's in good working order. In that car, ensure you have a fresh spare tire (replace tires every 5 years, unless otherwise indicated by professionals). Know how to change a tire: loosen those lugnuts FIRST, then jack up the car, remove tire, replace tire, tighten lug nuts with wrench, lower the car SLOWLY AND SAFELY, finish tightening lugnuts, etc. Know how to bleed brakes (get a friend to help). Replace wipers and fluid before the rainy season as needed. SO much car care is necessary, going back to point #1.\n\n&nbsp;\n\n#6. Kissing ass and networking are IMPORTANT.\n\nIf you think you're going to have a *remotely* successful life, you're going to be kissing a LOT of ass. It doesn't mean completely shoving your nose up someone's ass, but sometimes it might. If you are regularly on someone's radar in a good way, especially someone with an inkling of power, you're going to be one of the first people they think of for a promotion or raise or relocation to an exotic land. You're going to have to wear a lot of \"masks\" when you're around various people. Or you could just become like me and avoid that, keep your \"self respect\", and be poor and ignored. \n\nI was \"discovered\" last year. Like, legit. I was on a podcast with a coworker (I was the interviewee), and **an executive producer of one of the nation's largest morning shows** heard the podcast. He found me a month later, talked to me, and helped me get started. He gave me a lot of advice that I never used (regarding kissing ass, etc.), because I'm a fuck up. After a month, he dropped me, told me I needed to \"be my own cheerleader\". Coulda been a host on the radio in Los Angeles, but I'm not.\n\n&nbsp;\n\n#7. Hard Work & Luck.\n\nLuck starts your journey, hard work continues it. Anyone successful who doesn't say they are lucky (or outright refuses to acknowledge it) are not people to look up to. [Survivorship Bias](https://xkcd.com/1827/) is a huge factor. If you look at all the people who've worked hard and were successful, and then found everyone else who did similar, but aren't successful, you can factor in luck for the successful. Every. Single. Time. This [Veritasium video](https://www.youtube.com/watch?v=3LopI4YeC4I&vl) better explains everything.\n\n&nbsp;\n\n#8. \"No man is an island.\"\n\nYou can't do this alone. Everyone who gets anywhere in life is doing it with the help of others. They could be supportive parents. Friends who love them for who they are. Teachers that see the possibilities. Employers who see growth. Coworkers that empower their workday. Baristas at the coffee shop with a smile. Strangers on the train who hold the door for 1 extra second (don't go nuts on this one, people, there's a threshold). If you are surrounded by supportive and loving people, life, in all its difficulties and flaws and foibles, will become much less work. \n\n&nbsp;\n\n#9. Life is a game.\n\nIf you don't play, you lose. If you don't play by the rules, you lose. If you don't play well with others, you lose. No matter how much you want it or not, you're in the game. You have no choice. And your only opponent is you. Goes back to #6, and ties in with #8. And despite how shitty the game is, again, if you choose not to play, you will reap zero rewards. You might get a ball to the face, too.\n\n&nbsp;\n\n#10. Iroh\n\n[\"While it is always best to believe in oneself, a little help from others can be a great blessing.\"](https://www.youtube.com/watch?v=jZZXAvHySQ4)\n\n&nbsp;\n___\n\n#I have failed at all 10 of these points. Don't be like me.\n\n&nbsp;\n___\n\ntl;dr - read it anyway. I just gave you multiple summaries of life. I'm not summarizing my summaries, dammit! Now go out there, try to have fun, and try to find some meaning.",
                "labl": 44,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Give Up, The Postal Service",
                "labl": 3297,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Van Morrison - Moondance",
                "labl": 875,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Songs for the Deaf -Queens of the Stone Age\n\nRed Headed Stranger -Willie Nelson\n\nIdk if it counts cause it’s a sort of greatest hits but Alice in Chains Unplugged is the greatest unplugged set ever recorded and the best greatest hits album ever put together, fight me.",
                "labl": 6688,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "\"It's my estimation that every man ever got a statue made of 'im was one kinda som'bitch or another.\" - Cap'n Tightpants",
                "labl": 193,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "You are always cleaning the kitchen",
                "labl": 51395,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Life is like a free to play game with an incredibly low return ratio on the grind. You will want to buy in-game currency with real money to make things go quicker, but that isn't an option, you just need to keep  the never ending grind up, or you will die.",
                "labl": 300,
                "true_bin": 3,
                "pred_bin": 2
            }
        ]
    }
]