[
    {
        "correct": [
            {
                "sent": "Then all of Scandinavia will pronounce it like \"Yod\" and the Spanish will pronounce it like \"Hod\"",
                "labl": 15799,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "“I recognize the council has made a decision, but given that it’s a stupid-ass decision, I’ve elected to ignore it.”",
                "labl": 47634,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "All the “JIF” people would be really happy",
                "labl": 151,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Jesus is actually pronounced Yeshua. I doubt he would care.",
                "labl": 541,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "\"Actually, it's pronounced \"Loyd\"\"\n\nhttps://youtu.be/IJbvc31d1OE",
                "labl": 93,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I have had more days off in the last 5 years for coughs and colds than Justice RBGI has had throughout her entire ordeal with cancer.\n\nWe may never see her like again, a true beacon of honour and fortitude.\n\nI hope cancer never fully recovers from being diagnosed with Ruth Bader Ginsburg and I look forward to her inevitable critically acclaimed biopic.\n\nI'm not American but I am proud to have shared a planet with her Justice.",
                "labl": 226,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Pretty brutal really. My dad was attacked by an emu once. He is bald and his head is a little shiny. he was sitting on a bench at a wildlife park and The emu must have been attracted to the shiny reflection, snuck up behind him and bit his head. I have never seen someone jump so far in one leap before or since. As a child this traumatised me a little and now I am pretty uneasy around all kind of birds.",
                "labl": 27325,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "We took back the cities, but it's in our minds that any day could be the day that we need to pick up our whacking sticks to defend our bbq retreats from another invasion.",
                "labl": 7832,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "We never travel alone. Outside of the city walls, we drive in convoys of atleast half a dozen vehicles. Some of them armoured with machine gun turrets.\n\nIf we are lucky, we get aircover.",
                "labl": 175,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I was in Aussie at Christmas. Holy fuck everything was on fire and now I hear people in Melbourne can't even leave their houses.",
                "labl": 860,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I worked in management at a theatre for a while. If the concession counter was slammed and I was able, I’d leave my post and help them sling popcorn. \n\nOne night while helping out, a particularly belligerent man started cussing out a 16year old girl on a cash register for being too slow, even suggesting she quit since she clearly couldn’t handle pushing buttons or scooping popcorn. It was pretty disgusting and I felt so bad for the girl, I stepped in and told the guy that our employees have the right to refuse service to customers who harass them as part of our anti-harassment/discrimination policy, empathized that the lines were longer than usual, and  suggested he should apologize and move on. He was PISSED. Left half his order on the counter and started fuming off.\n\nAnticipating his next move, I went back to my original post that night - as manager of the customer service kiosk. Oh boy, the look on his face when he saw me. (Didn’t want a refund of his tickets though so I assume he watched the movie, without popcorn).",
                "labl": 9859,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My wife and I moved to WA state and my MIL tried to tell me that she was going to call the police because I had pot in the house.",
                "labl": 2672,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I worked at a Walmart as a cashier, and the assistant manager there was a dick, he would insult everybody working there and forced us sometimes to do work above our pay grade.  6 months later me and him got transferred to another Walmart that was just built and they needed to pick a manager and assistant manager some random got manager but I got assistant manager (I guess all the complaints on the assistant manager basically gave him a demotion) so one day he was ordering the other cashiers around then i pulled him to the side and told him that if he kept pulling the same shit around he would be out of here.  I haven't heard anything from him since.",
                "labl": 24364,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "So my uncle is a deputy sheriff, and one time he was at an airport talking to my aunt over the phone in spanish. Once he got done with his call some nearby Karen that overheard him went up to him and started demanding to see his green card (uncle has an accent too so you can tell he's wasn't born in the US). Uncle decides to fuck with her and tells her he doesn't know what a green card is and has never heard of one. She gets more pissed and keeps demanding to see it. He messes with her some more then eventually he goes \"Well I don't got a green card but I got this\" then takes out his wallet and shows her his badge. She immediately walked away while my uncle laughed his ass off.",
                "labl": 2598,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "We had an HR lady who was extremely power hungry. \n\nShe is walking around with the president of the company who flew in from Japan. She rushes him though the warehouse. Just spits  out “oh these are the warehouse guys we don’t have to stop and talk to them.”\n\nHe stops walks over and starts talking to me about my last vacation. How buying my house went. You could just see her fuming behind him as we talked for almost 45mins. I’ve had multiple meeting with him we knew each other really well.\n\nI don’t think he liked her and drug it out on purpose but I was thrilled to see her just standing there bored as hell.",
                "labl": 53836,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My ex was a narcissist and I had learned to basically walk on eggshells in our relationship to try to keep the peace. We had two kids and I was a stay-at-home dad who did more than 90% of the parenting. One of the tactics I used with our kids was counting to three when they were behaving badly, and if they hadn't shaped up they would go to time out.\n\nCue forward to our divorce; she had manipulated the courts into granting her educational decision making for our kids and enrolled them in a school far from me and close to her. I began volunteering at the school to help in class to give me more time with our kids. She called to tell me that she had made the executive decision that I couldn't do that anymore. I told her she had no right to make that decision. She pulled out the education decision making card, and I told her that gave her no right to tell me what to do on my own time. She started ranting and wouldn't let it go; she had grown accustomed to me just giving in and I wasn't doing that anymore.\n\nShe started getting really angry and yelling. Without even thinking about it, I just said, \"One...\"\n\nShe paused for a moment and then started into it again. I said, \"Two...\"\n\nBy that point she got what I was doing I think, because she took a breath and started a bit more calmly, but then she got to yelling again and I said, \"Three.\" And I hung up the phone.\n\nShe immediately called me back and I ignored the call. She kept trying and I kept ignoring it. Ten minutes later I called her back and we started talking again. She didn't yell, and of course I kept volunteering at my kids' school because I'm a good dad, dammit.",
                "labl": 423,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I once had a boss try to give me a disciplinary (three months later I may add) for my behaviour as it was noted I was 'rude to her' by several of the Groups CEOs in a Board meeting. \n\nOn the disciplinary forms, you both have to write your version of the events and it goes to HR for an adjudication, she did her part and I casually filled in something to the effect of \"manager continually pressured me into deleting files from our client management system prior to a regulatory audit which is against the ethical code of our profession and not aligned with my moral standards, I accept I was short with her but she was trying to force me into performing an illegal activity.\"\n\nI watched her collect up the paper and the colour drained from her face. I never did hear from HR.  \n\nShe got fired not long after when I casually mentioned to the CEO in a bar if she remembered the encounter and explained why I may have appeared a little frustrated and upset. Bye Felicia.",
                "labl": 131,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I was a registration supervisor in an emergency department. Our manager was out for heart surgery so the manager of a different facility was filling in. She was a righteous cunt who needed everyone to bow to her authority. \n\nDuring a staff meeting she tried to implement a policy that the president of our hospital has specifically rejected. Nothing major, just a process change in how we checked in patients arriving by EMS. This policy worked at her facility but we weren't equipped to implement it. She knew this but thought she was going to force us to do it as a way of showing how it was \"the better way\". After she gave the instructions she said, \"any questions?\"\n\nMy staff all turned and looked at me for a moment, then one of them said, \"is this true, uh-okay?\"\n\n\"No. As you know, we've been told not to do this. Please continue arriving those patients as we have been.\"\n\nThe manager flipped out and tried to write me up for insubordination. Took it to the director who knew we weren't allowed to make this change. He shot her down and dismissed my write-up. It was super validating. It also helped me with my staff because they saw that I wouldn't let them or myself be pushed around.",
                "labl": 369,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A cop pulled me over at 2am on my way home from work.  He was visibly agitated that I wasn't the drunk driver he was fishing for.  I asked him why he pulled me over and he gave me some nonsense about swerving.  I told him no I wasn't.  He walked away, did a 180 and came back with \"Well, if I searched your car right now, what might I find...\"  I laughed at him and told him that there was no way I would ever consent to a search.  He walked away fuming.",
                "labl": 331,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I worked at a prison for 10 years. A lot of the captains were notorious for giving into newer employees demands for training usually reserved for senior officers, or at the very least, easier jobs away from inmates. \n\nOne night I was talking with one of the captains in his office and a new officer came in, he’d been there about 3 months or so. He started asking the captain for some particular training. The captain kept telling him no because there were senior officers ahead of him.\n\nNaturally, this 20 something year old kid started whining about so and so getting trained and he wasn’t and  they felt like they have proven their worth.\nThe captain got up and start walking circles around the officer as if he was looking for something. Checked his shirt collar, pockets, and even made him give him his wallet, and he looked through it. He finally sat down and looked at his own collar and touched his captains pin and said, “holy shit! You almost had me convinced that I wasn’t the decision maker. Get the fuck out of my office!”\n\nHe was my favorite supervisor of all time, still is.",
                "labl": 222,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "A museum in a town added to its collection a replica of Michelangelo's famous nude statue, *David*.\n\nThe pastor of a nearby church demanded that the curator remove it from display because it was \"inappropriate\" for public viewing.\"\n\nTo her credit, the museum's curator told the clergyman in unequivocal terms that the church had no say in the matter and that fine art would be exhibited without need for ecclesiastical approval.\n\nhttps://en.wikipedia.org/wiki/David_%28Michelangelo%29#/media/File:'David'_by_Michelangelo_Fir_JBU002.jpg",
                "labl": 781,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "This is a little more niche, but Bill Wilson, the founder of alcoholics anonymous.\n\nThe guy did great things, and created a program of recovery that has saved millions of lives since it's inception 85 years ago.\n\nHe was also an arrogant ass hole that cheated on his wife even in sobriety.\n\nEdit: This isn't here to scare away anyone that's trying to get sober. I've been sober thanks to AA for 5 1/2 years. So don't let this keep you away if you're struggling with your drinking.",
                "labl": 13565,
                "true_bin": 1,
                "pred_bin": 2
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "Usually just a load of nonsense. He’ll have full conversations with me in his sleep that essentially make no sense at all and he’ll have no memory of it in the morning. Never fails to make me laugh, so I actually enjoy it",
                "labl": 597,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "... Fuck.",
                "labl": 12039,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I'll sum it up in two words\n\"fucking scary\"",
                "labl": 5,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Probably watching a few Texas DPS Officers realize they couldn't shut down a whole airport.\n\nI was working as a flight instructor at small airport on a Saturday afternoon.  We had one plane that had an issue on takeoff and veered off the runway, it cartwheeled and totaled the airplane but fortunately the pilot was not serious injured.  I had a student who was next in line for takeoff when it happened, he called me from his phone as it happened.  I hopped in the airport car with one of the rampers and drove out to the plane with a radio to inform inbound planes to use the other runway (we had no control tower).  On the way to the runway I called the airport manager who drove to the airport and on his way he made a phone call to officially closed that runway.\n\nAbout 30 minutes later a metric fuckton of DPS officers showed up and immediately tried to close the whole airport, treating it like a giant crime scene.  They were carelessley driving around the airport like they owned the place, ignoring the planes that were moving around, and crossing our only open runway without regard to inbound traffic.  A mechanic and I tried to tell them to be careful and they got mad at us.  One of them told me they were \"locking it down\" a couple times, meaning the whole airport.  Now I was a broke ass flight instructor and I had a flight that afternoon that was ultimately going to help pay for me to eat that week.\n\nThe airport manager was a short stereotypical country guy, also former Navy.  He was not intimidated at all by the cops trying to close his airport.  When he showed up I was about to go out with a student who was preflighting for a cross-country.  There were about 5 cops in the lobby, me with my flight bag, the airport manager, and a mechanic.  One of the cops saw my flight bag and said \"I don't know why you have that or why he's out a the plane, you aren't going anywhere\", the moment he finished his sentence the airport manager said \"it's one runway that's closed, the airport is still open.  This pissed off the cops.\n\nI was about to head out the door, and one of the officers said he was driving out to the disabled plane.  Idky, the pilot had been gone for about an hour.  The mechanic said \"you need to be careful\" and the cop quickly retorted \"AND WHY THE HELL IS THAT?\" and he said \"because this is still an airport, and the first thing that hits you is going to be a propeller\" a few seconds later a plane took off as one of the cars was approaching the runway intersection ironing in that point.\n\nI walked out, and as I was hopping in the plane with my student the same cop came up to me and said \"you aren't going anywhere, we're locking this down!\"  I looked at the airport manager who followed all of us out to the ramp, he said \"have a nice flight AjaxBU!\" \n\nYou could see these cops just fuming that they didn't have the authority to close down an entire airport because one plane went off the runway.   The airport had two runways, where the disabled plane was located was probably a mile or so away from the open runway.  Why they were making a big fuss, I don't know.  The occupant was relatively uninjured, his wife was the worst thing he had to deal with that day, he told her he wasn't going to fly.\n\nWe had a good flight, and I got to eat dinner that week.",
                "labl": 7674,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "A few years ago I was helping my parents move to a new house locally. My father is fairly particular and told me he has reserved a U-Haul truck for specifically 24 hours as we are going to need to make a few trips across a large metro.\n\nI go in to pick the truck up for him, and look at the sheet stating the truck needed to be back in just over 3 hours (we were about 35 minutes late, but that would be okay with 24 hours). I tell the fellow behind the desk that this should be for 24 hours, and he says it is not in the system and it is spoken for already after we return it for another rental. I ask if there is anything we can do at which time the owner comes over to see what the issue is.\n\nI explain it to him and he proceeds to chastise me, saying we must not have ordered it correctly, if we need it so long why are we 35 minutes late, and a bunch of other down talk. By this time my father comes in to see why I have not come out, and also gets talked down to which upsets me internally. I tell the owner that we need to move at least the big things, so if we only have 3 hours we will make it work the best we can (then rent another truck elsewhere during the week) but he keeps chewing up more time arguing then says the kicker. He will look up the call recording to see who is right. I have absolute trust in my father when he says he did something, so I agree and wait.\n\nTurns out the owner was the one that took the call and he gets smug. \"I have done this for 20 some years and I don't make mistakes.\" Five minutes later, sounding defeated, he is asking us to bring it back early so we don't mess up another person's move (guilting us for his mistake that he never makes). On the call you clearly hear my father asking for the 24 hour rental with multiple confirmations from the owner throughout the call. Guy was a real jerk, never even apologized for anything. Also left a lengthy detailed review on multiple sites and emailed U-Haul corporate. It is now my most \"helpful\" review on just about every platform.",
                "labl": 171,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Hey OP cherish 2015 while you can OK?",
                "labl": 34730,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I would start a blog on my pc and then switch to my phone to check if it now has updates from the future. If so, my future self could talk to my present self.\n\nI could read about my mistakes and try to avoid them. If a post disappears, that would mean that I did it right.\n\nEdit: Holy shit thank you for all the likes and awards!",
                "labl": 25435,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "2020 election results lol",
                "labl": 2914,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "GTA VI release date",
                "labl": 7517,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "My name + obituary. \n\nIf I get more searches? 2020, 2024 election results. COVID vaccine FDA approval parent company. TSLA, GOOG, APPL, FB prices.",
                "labl": 4726,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "You're not always going to be able to access your brain's memory files, sometimes you may need to remember things off the cuff",
                "labl": 3913,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Get a marketable skill, unskilled labor sucks. You need something that’s going to pay you, it doesn’t have to be your life’s passion, contrary to what my peers were saying at that age, but you do need to be able to tolerate it.",
                "labl": 5394,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "**Money**\n\n* Save it. Even if it's a little bit. You don't need the latest and greatest of every widget to exist. Remember at one point your widgets were the greatest, don't try and keep up with your neighbors.\n\n&#x200B;\n\n**Relationships**\n\n* Don't burn bridges, no matter how obscure they are. It might be satisfying to get shit off your chest and tell people off as you're leaving a gig or a job, but it's a really small world. Really. You will be shocked at how connected everyone is these days and who talks to who. \n* Be kind.\n* Read Dale Carnegie's book How to Win Friends and Influence People. There are some audio book versions on youtube you can listen to. Some of the examples are out of date (like letters and calling cards...) but the sentiment is not. It is single handedly the keys to success in interpersonal relationships at work, school, or in your love life. \n* Listen more than you talk, and don't just wait for your time to talk in a conversation.   \n\n\n**Self Help / Self Improvement**\n\n* Always improve.\n* Read a book. \n* Keep a journal occasionally. It's good for reflection on how far you've come.   \n\n\n**Sex**\n\n* Is awesome.\n* babies are forever. Use protection if you’re not ready for them. I love mine, but I am 30 - you might not want a baby until later if you even want one at all. \n* Don't put it on a pedestal. If it's the only reason you're into someone, chances are that relationship isnt going to last.\n* STDs are mostly permeant, just wear a condom or make your partner wear one...\n* People have sex, don't shame people for the number of partners they have had (or haven't?). In fact, nothing good comes out of even asking someone you're interested in the question of how many women they've slept with.    \n\n\n**Cars**\n\n* you don't need the greatest car in the world. \n* don't waste your money on a new car.  1 owner trade in if you're looking for new fancy tech. 7 year, 70k mile, $7k price tag is about the car you should be chasing. \n* learn how the car works\n* dont be afraid to get a second estimate for car repairs\n* car insurance is stupid expensive, and the \"it drops at 25\" is a myth. \n* don't let people borrow your car. you're liable for whatever happens. \n* don't cheap out on tires or brakes. if you have tire/ brake problems with your car, get them fixed.  \n\n\n**Drugs / Alcohol**\n\n* if you do drugs, don't make it your life. pot is not a lifestyle, it's a drug. nobody likes \"that guy\" who doesn't shut up about drugs. same goes for booze / liquor.\n* some shit will seriously ruin your body, just be careful \n* learn your limits and stay within them while drinking. nobody likes a drunk. \n* dont get behind the wheel of a car after drinking - this WILL ruin your life. have a plan. a $200 dollar taxi trip is wayyy cheaper than bail + legal fees for DUI/DWI.  \n\n\n**Job Satisfaction**\n\n* don't stay in a job you hate. \n* find something you can enjoy. it sounds silly but it helps to find something positive about your line of work. if you can't, work towards a new career. \n* value yourself and your time. dont let work walk all over you.   \n\n\n**Clothes**\n\n* wash them, learn to do laundry regardless of what gender you are\n* dont worry about brands. buy brands because they are quality, and last - don't buy clothes that have excessive rips and tears (oh god i sound old... i promise they were super cool to me when I was a teen) clothes get really expensive\n* buy something dressy, but not too flashy. Button down with a tie, matching slacks, a belt, and some dress socks/shoes. make sure it fits. if you can afford it, get something dark/neutral colored for attending funerals, and something pleasant for attending weddings. These clothes don't have to be really expensive.   \n\n\n**Mental Health / Fitness**\n\n* check in on your friends. vent to professionals, not to your friends.\n* smile often, it helps. \n* life is awesome, it gets better, and this too shall pass. time really does heal all wounds, it may be miserable now but it will get better. \n* Go for a walk every now and then. Go to the gym if you want to. You don't need to be a gym rat to be in decent shape.\n* Abs are made in the kitchen, not on the ab roller or crunch machine. Don't eat like shit, because you can't out train a bad diet.",
                "labl": 549,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I'm 39.\n\n&nbsp;\n\n#1. Life is work. \n\nEverything requires perpetual maintenance. All elements of your life, be they self-care, friendships, relationships, work-life balance, health, your house, your car, bank accounts, etc. require **constant** repair. This is our attempt at slowing down entropy. We'll never stop it, as the [energy of the universe](https://www.youtube.com/watch?v=w2iTCm0xpDc) is constantly trying to seek perfect equilibrium, and our efforts only last a lifetime. If you wish to be even *remotely* successful in life, you will recognize how much work you will need to put into every little thing. Otherwise, you'll end up like me: alone, unloved, unhealthy, and ready to die at a moment's notice.\n\n&nbsp;\n\n#2. \"Know thyself.\"\n\nIf you don't know who you are, you're gonna have a bad time. You need to understand that your life is HEAVILY impacted by various forms of luck: where you live; how much money your family has; how abusive your family is; the school system's resources; the literal air that you are breathing. These all have an impact on your life, and the possibility of your future life. The opportunities or obstacles of your life are LARGELY dictated by simple factors of luck. Not all, but I'll get to that.\n\n&nbsp;\n\n#3. \"Be yourself\"...is horseshit.\n\nIf you don't know who you are, *how the hell can you be yourself‽* How do you overcome this catch-22? \n\nA better variant, IMO, is ***\"be the person you wish to become\"***. Not a living or dead person that you hope to magically morph into. But the person that you, in your mind, wish to be in the future. \n\nDo you want to [be kind](https://www.youtube.com/watch?v=sicUhD1n-es), or ruthless? Do you want to be respected, or feared? To you want to help, or hurt? Those are broad and vague, and there are many many more, but they're starting points for how to approach your future. If you've decided to be ruthless, then you'll begin to adapt behaviors that go that route. If you're a meek and timid person who can't even say their name clearly (been there, done that, relevant username now), you're not likely to command any kind of respect.\n\nIf who you are right now is not what you want to be, then \"being yourself\" is the worst advice you'll receive. You must change yourself, because whether you like it or not, change occurs, and you can't control the majority of those changes. So change the ones you *can*.\n\n&nbsp;\n\n#4. Friends come and go.\n\nThe reason you have friends *right now* is because of geographic (and, to a not-to-be-dismissed degree, socioeconomic) reasons. Once you stop going to the same schools, and movie theaters, and book stores, and restaurants, etc. the friendships will begin to diminish. You will more likely grow apart over time, not together. It's possible, sure. But don't make any heavy bets, because you'll lose money on those bets more often than not.\n\nYou'll need to find new ways of making friends. College is yet another school-related location that can help. Clubs help. Hobby-related activities help. \n\nRight before COVID lockdowns here in LA, I made a friend with my tattoo artist, barely knew him otherwise. He mentioned he and his friends were gonna start watching crappy 80's horror movies on the weekend. I was down. Then the lockdowns hit, and we couldn't do it. And I'm bad at making friends with new people I've barely met, so I've made no attempts to reconnect. Maybe when I get back to the tattoo shop. Goes back to point #1.\n\nMaking friends will be hard. But if you're lucky, and make enough connections, it won't be *as hard*.\n\n&nbsp;\n\n#5. \"Expect the best, prepare for the worst.\"\n\nHaving a positive outlook is healthy. If you're perpetually despondent, hopeless, and listless, you probably have depression, and that needs tending to. But ONLY having a positive outlook will lead you to trouble. You must prepare for the times when life throws a wrench into your car tire. Saving money is necessary. Blowing it all and wondering how you're gonna eat next week is pointless drama you've placed upon yourself. Get a checking account, a savings account, and a retirement account. Even if you only put $10 / week into the thing, AND LEAVE IT THE HELL ALONE, you'll likely have a nice rainy day fund when the shit hits the fan. \n\nLiving in a fire-prone region? make sure you have proper equipment in case wildfires become too dangerous. Earthquake kits, first aid kits, bottled water, blankets, etc. \n\nIf you don't live in a place with reliable mass transit, best make sure you have a car that's in good working order. In that car, ensure you have a fresh spare tire (replace tires every 5 years, unless otherwise indicated by professionals). Know how to change a tire: loosen those lugnuts FIRST, then jack up the car, remove tire, replace tire, tighten lug nuts with wrench, lower the car SLOWLY AND SAFELY, finish tightening lugnuts, etc. Know how to bleed brakes (get a friend to help). Replace wipers and fluid before the rainy season as needed. SO much car care is necessary, going back to point #1.\n\n&nbsp;\n\n#6. Kissing ass and networking are IMPORTANT.\n\nIf you think you're going to have a *remotely* successful life, you're going to be kissing a LOT of ass. It doesn't mean completely shoving your nose up someone's ass, but sometimes it might. If you are regularly on someone's radar in a good way, especially someone with an inkling of power, you're going to be one of the first people they think of for a promotion or raise or relocation to an exotic land. You're going to have to wear a lot of \"masks\" when you're around various people. Or you could just become like me and avoid that, keep your \"self respect\", and be poor and ignored. \n\nI was \"discovered\" last year. Like, legit. I was on a podcast with a coworker (I was the interviewee), and **an executive producer of one of the nation's largest morning shows** heard the podcast. He found me a month later, talked to me, and helped me get started. He gave me a lot of advice that I never used (regarding kissing ass, etc.), because I'm a fuck up. After a month, he dropped me, told me I needed to \"be my own cheerleader\". Coulda been a host on the radio in Los Angeles, but I'm not.\n\n&nbsp;\n\n#7. Hard Work & Luck.\n\nLuck starts your journey, hard work continues it. Anyone successful who doesn't say they are lucky (or outright refuses to acknowledge it) are not people to look up to. [Survivorship Bias](https://xkcd.com/1827/) is a huge factor. If you look at all the people who've worked hard and were successful, and then found everyone else who did similar, but aren't successful, you can factor in luck for the successful. Every. Single. Time. This [Veritasium video](https://www.youtube.com/watch?v=3LopI4YeC4I&vl) better explains everything.\n\n&nbsp;\n\n#8. \"No man is an island.\"\n\nYou can't do this alone. Everyone who gets anywhere in life is doing it with the help of others. They could be supportive parents. Friends who love them for who they are. Teachers that see the possibilities. Employers who see growth. Coworkers that empower their workday. Baristas at the coffee shop with a smile. Strangers on the train who hold the door for 1 extra second (don't go nuts on this one, people, there's a threshold). If you are surrounded by supportive and loving people, life, in all its difficulties and flaws and foibles, will become much less work. \n\n&nbsp;\n\n#9. Life is a game.\n\nIf you don't play, you lose. If you don't play by the rules, you lose. If you don't play well with others, you lose. No matter how much you want it or not, you're in the game. You have no choice. And your only opponent is you. Goes back to #6, and ties in with #8. And despite how shitty the game is, again, if you choose not to play, you will reap zero rewards. You might get a ball to the face, too.\n\n&nbsp;\n\n#10. Iroh\n\n[\"While it is always best to believe in oneself, a little help from others can be a great blessing.\"](https://www.youtube.com/watch?v=jZZXAvHySQ4)\n\n&nbsp;\n___\n\n#I have failed at all 10 of these points. Don't be like me.\n\n&nbsp;\n___\n\ntl;dr - read it anyway. I just gave you multiple summaries of life. I'm not summarizing my summaries, dammit! Now go out there, try to have fun, and try to find some meaning.",
                "labl": 44,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Obviously you haven’t heard of half the relationships in the military",
                "labl": 122,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "So a sugar daddy lol",
                "labl": 32,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Here’s an obligatory “not one of the elevator maintenance folk” story. \n\nMy dad had a Razr phone back when they were still cool. Just to annoy him, my mom changed the ringtone to the sound of a meowing cat. My dad absolutely hated it, but didn’t change it. \n\nAnyway, one day at work, he’s getting out of the elevator and accidentally drops his phone into the crack between the elevator car and the doors! \nHe calls maintenance and asks them if they can get his phone back, but they say sorry, we can’t do that. So he’s standing outside the elevator thinking of what to do and he gets an Idea. Running into a nearby office, he asks a coworker if he can use their desk phone for a second... and proceeds to call his own phone. He does this a few times.\n\nA couple minutes later, someone else hysterically phones security, saying that there’s a cat stuck in the elevator shaft. A few other people in the elevator at the time corroborate the story, so the elevator maintenance folk run the elevator up the shaft and shine some light down there. \n\nMeanwhile, my dad and some other people are standing by the open doors to the shaft, looking downwards. \nMy dad says, “Hey, I don’t see any cat...but I think I see my phone down there! Can you guys grab it for me?” \nAnd they do.",
                "labl": 129,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "London Calling",
                "labl": 4514,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "The Downward Spiral: Nine Inch Nails",
                "labl": 4508,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Riot! by Paramore",
                "labl": 607,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "LUV VS. The World",
                "labl": 134,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "This is a little more niche, but Bill Wilson, the founder of alcoholics anonymous.\n\nThe guy did great things, and created a program of recovery that has saved millions of lives since it's inception 85 years ago.\n\nHe was also an arrogant ass hole that cheated on his wife even in sobriety.\n\nEdit: This isn't here to scare away anyone that's trying to get sober. I've been sober thanks to AA for 5 1/2 years. So don't let this keep you away if you're struggling with your drinking.",
                "labl": 13565,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    }
]