[
    {
        "correct": [
            {
                "sent": "We’d be like, “No way!” and he’d be like, “Yahweh.”\n\nedit: holy shit, y’all are making my day",
                "labl": 20046,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Then we can be divisive on a whole slew of new things!\n\n\nWas that really God?\n\nIt's a hoax!\n\nWho made God leave again?\n\nI bet it was the liberals! They drove god away!\n\nJod was talking to me in particular!  Only I may refer to him as such!\n\nWe have to Murder anyone who dare says it with a hard \"G\"! Its Jods will!",
                "labl": 2210,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Well I'd have to think he's just trolling because God actually isn't even his name. His name is YHWH, God is just what people called him when they didn't want to use his actually name and after a while it just became the only thing people called him. Christians, Jews, and Muslims only believe in one god so calling their god \"God\" never had the problem of becoming confusing. Though I know certain sect of Christians call him Jehovah, which seems to be an anglicized version of YHWH. And also Allah is just Arabic for God, it's not another name for him. It's like the equivalent of Christians saying Deus, the only difference is Latin has lost it's value as the Christian/Western world's lingua franca.",
                "labl": 105,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "For those who aren’t aware, tonight is the start of the jewish new year. There is an old, old tradition that at this time of year God “opens his book”. During the days between the new year and Yom Kippur, Jews pray for atonement and pledge to do better in the following year, and on Yom Kippur God enters the names of those who have truly atoned in the  book, and seals it for a year. Those whose names are sealed will live for at least another year. So for someone to die on the very last day of the year means that God judged that person very highly. It’s an old story/tradition from the Middle Ages and I doubt anyone literally believes this now, but it seems like the perfect ending to her life.",
                "labl": 1059,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "... Fuck.",
                "labl": 12039,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "she seemed like she lived a fulfilling life. R.I.P.",
                "labl": 105,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Who do you think started the fires?",
                "labl": 40276,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "We are moving in to spring. It is a terrifying time for us all as their allies the Magpies launch sorties.\n\nPray for us.",
                "labl": 382,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Every day I live in constant fear of the emus' inevitable swift and bloody reprisal, I wouldn't wish for anyone to have to live this way but all we can do is take each day as it comes. My great uncle Bazza has it worse, he fought in the war and it still hurts him to this very day, he can't even see a chicken without having a complete meltdown now. For me by far the hardest thing about living under the shadow of the emu is th- hold on, I think something just breached the birdseed perimeter outside my bunker, I hope they don't make it past the line of hanging CDs. I'm gonna go check it ou-",
                "labl": 179,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The Australians are living in constant fear, waiting for us to strike, and claim a devastating victory from the jaws of defeat.",
                "labl": 16,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Why do you think we have to ride kangaroos to school",
                "labl": 6,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "This is a bit silly, but gave me a great feeling of satisfaction. Due to the bad economy and poor money management, my parents have moved into the spare room of the house my husband and I bought a year ago. Things are mostly smooth, tho I’m not the closest to them for several reasons I won’t go into here. \n\nThe other evening I was out gardening (because it’s hot during the day and we have the luck of having a streetlight right next to our front yard, keeping it pretty well illuminated even after sundown, I mostly garden at night), and I thought I had gotten the hose twisted, as it kept getting stuck. This went on for a bit, when I realized that it wasn’t stuck, but being pulled. I looked into the dim area just past the illumination of the street light and spied my father, crouched over and tugging the hose. Well I did the only reasonable thing to do, and I sprayed him. He yelled and ran inside with me chasing. \n\nOnce he got inside he made a face and goes “You can’t get me now! I’m inside!!” In that father-to-daughter-don’t-you-make-a-mess tone of voice.\n\nI readied my hose, looked him in the eye and said, “It’s my house.” And just fucking let loose with the hose. He was soaked. Worth cleaning up the mess for that moment of true fear in his eyes.\n\nEdit: thanks for all the appreciation! I’m glad my silly story made your day better!!",
                "labl": 5819,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "When I was in high school I worked at popular warehouse club selling computers on the weekends. I was hired by the store manager via referral of a friend. I loved computers and they thought I'd make a good salesman, so my job was to stay in the computer department and sell computers; nothing else.\n\nWell, one of the shift managers didn't like that, and started insisted that I needed to go fold clothes for a while. As in, half my damn shift. I told him that the store manager had instructed me never to leave the technology department, but he insisted. This went on for several weeks.\n\nThe store manager showed up one weekend when both the power trippin shift manager and I were working. The store manager walks up with the shift manager close behind. Store manager slaps a stack of [greenbar paper](https://www.google.com/search?client=safari&rls=en&ei=iiBuX4PQEoqc5gL8gJLQCg&q=greenbar+paper&oq=greenbar+paper&gs_lcp=CgZwc3ktYWIQAzICCAAyBggAEBYQHjIGCAAQFhAeMgYIABAWEB4yBggAEBYQHjIGCAAQFhAeOgQIABBHOgsILhDHARCjAhCTAjoECAAQQzoECAAQCjoECC4QCjoICAAQFhAKEB5Q5g9Y2xRg2RVoAHACeACAAWyIAe8DkgEDNC4ymAEAoAEBqgEHZ3dzLXdpesgBCMABAQ&sclient=psy-ab&ved=0ahUKEwiDvZnA4oTsAhUKjlkKHXyABKoQ4dUDCAw&uact=5) (this was a while ago) down onto a shelf and points to some highlighted numbers.\n\nHe looks at the shift manager and says, \"Do you see this? This is our average technology sales numbers for the weeks you are on shift. See this number over here? This is our average technology sales numbers for weeks you are not. At this point, it would be more cost effective for me to simply fire you. What do you think of that solution?\"\n\nThe guy stammers and stutters like a toddler caught bullying another kid on the playground. Fortunately, the dude wasn't fired, but the store manager made it clear that when I was on shift, I was not to leave the technology department unless I was on break or there was a fire in the store. That shift manager never said another word to me.",
                "labl": 20074,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My boss calling me at 7am on a saturday to ask if I could lay some flooring for a friend of his *at nearly half my normal rate.* yeah, hard pass Andy.",
                "labl": 172,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My mother made my childhood hell (unpredictable moods, every second weekend would be family drama weekend with day long tirades about how everyone hates her and we are horrible to her and surely we are so vile and want her to leave; yelling and abuse got so bad I got panic attacks and nothing was done about it, random beating, crying, insults, very controlling, went through my letters and diary, called me a whore or dumb as a cow when I came home 15 minutes too late, the works)...After what seemed like ages of struggling, I finally managed to move out at age 21, to an address within the same city.\n\nHer whining continued. Why would I not give her keys to my apartment? Why did I not phone in every day? Where was I, who was I with, what was I doing at every time of the day? I must hate her! I must be looking forward to dancing on her grave!\n\nI tried to not react and give her more ammunition, but when she ended up asking at some point \"Why are you not coming by and visiting us every day??\", I finally replied \"because I don't live here anymore\", and THANK GOD it shut her up.\n\nEdit: Ironing out some typos, formating. Also whoah thanks for all these likes you guys.",
                "labl": 6304,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My friend has this awesome story from college:\n\nHe was a school \"president\", he was in charge of things, and had quite some power and responsibility. \n\nThis one time he had to organize a seminar which was pretty important especially because he was hosting. As he was going around making sure everything was running smoothly, he noticed a few students messing around and not rehearsing a speech they had to deliver. He questioned each of them on said speech and, as expected, none of them knew it well enough. So he asked them to start rehearsing but as reckless as freshmen students can get, they ignored the order. \n\nBeing fed up with them, my friend simply took their presentation and told them to leave. That's when one of them snapped back, \"You can't do that! You don't even know me, i know the president of the department!\", showing off illusions of the amount of power a 3rd grader has on a Thursday morning after a bowl of cereal. \n\nNaturally, my friend asked this schmuck to use their wild card and call the president. They took out their phone, started dialing and guess what happened next \n\nHis phone started ringing.\n\nNow I'll let you imagine the sheer horror in this kid's eyes, the shame on their face, the cringe and regret for the rest of their life.I have no idea how my friend kept a straight face.\n\nThis is one of my favorite \"you have no power here\" stories.",
                "labl": 1490,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "I had an elderly lady come into the pharmacy I work at when I was roughly 17. It’s a community pharmacy and all the patients and people in the community have been going there awhile, they know the owner and he knows them. She was acting really suspicious and terse with the employees, walking around shrinking away from people and shit. I saw her grab something and put it into her purse, a couple things of robutussin.\n\nI walk up to her and say “ma’am I need you to put that back or pay for it, and if you were wanting to sell that or use it to make something, it doesn’t even have the right ingredients” (I should clarify that this is in Clarksdale, MS one of the biggest meth and drug abuse places in the country)\n\nShe acts accosted and starts screaming that I need to unhand her and stop trying to abuse her and then “IM GOOD FRIENDS WITH THE OWNER AND I WHEN HE HEARS HOW RACIST AND ABUSIVE YOU ARE I HOPE YOU LEARN TO BE A PROPER MAN WHILE FINDING A NEW JOB!” \n\nSo I stayed in front of the door and calmly said “ma’am I’m sorry I’ve offended you. The owner is here today, actually.”\n\nShe walks back and starts hollering “where is Eric?! This young man is abusing me!” The owner rushed out, looked at me and said “what happened?” “She said “he accused me of taking medicine” and I looked at the bag. The owner and pharmacist looks at me then asks her “Did you take any?” She said “Mr. Eric I’ve known you since I moved here four years ago and I don’t like this little boy you have working for you. His mama didn’t teach him how to treat a lady!” To which he said “I think she did a fine job, she’s my wife. Let me see in your bag.”",
                "labl": 181,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "The first time I got to say my house, my rules to my dad after a lifetime of him saying it to me. It felt good.",
                "labl": 328,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "My abusive ex who tried to keep me from leaving. Saying I'd never see my son, harassing me, whatever else you could think of. Finally one day I walked out, and she demanded I give her my phone since she paid for it. Something finally snapped and I told her I didn't need her. She didn't drive, she didn't have an income that could sustain herself, she didn't have a car, she didn't even have family to rely on. Her own mother kicked her out when she was pregnant. So I said fine, keep the phone and lose the only person who has helped you in any way. We're broken up and I have my son 50% of the time. All her threats are empty and I just kinda ignore her when she starts being abusive towards me.",
                "labl": 154,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Biggest crisis in the last 5 years.",
                "labl": 49182,
                "true_bin": 1,
                "pred_bin": 1
            },
            {
                "sent": "Lottery numbers the last five years ? Easy peasy",
                "labl": 32935,
                "true_bin": 1,
                "pred_bin": 1
            }
        ],
        "incorrect": [
            {
                "sent": "Jesus is actually pronounced Yeshua. I doubt he would care.",
                "labl": 541,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Get back here and answer for children with cancer, you motherfucker!",
                "labl": 362,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "People's names are their own, and the owner of the name is the exclusive authority on its pronunciation. Anyone who doesn't listen to someone when they inform how to pronounce their name is an asshole.",
                "labl": 154,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "ex and i were moving out after a breakup. cleaning out garage. she was being critical of my post-breakup plan of moving in with a coworker until i could find a better place to live, as most options weren't great.\n\ni took a deep breath and laughed. this puzzled her. why are you laughing, she asked? i collected myself and said \"because this is the last time i have to listen to this. you don't get to be critical of anything i ever do, ever again!\"\n\nit was a really great feeling, because i literally thought of the \"you have no power here\" as i laughed.",
                "labl": 934,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Cure for type 1 diabetes. Doctors have been saying its five years away for awhile now.",
                "labl": 32341,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I search porn to see if the industry has gotten over its step-family obsession",
                "labl": 12533,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Like a fax from future me?\n\nDo not drink that coffee!",
                "labl": 871,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Find out when the Corornavirus was eradicated and invest in stocks accordingly.",
                "labl": 769,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "queen elizabeth (if there were more searches available)\n\nthen probably see which countries still exist as they are now,\n\nsee how covid-19 played out\n\nmemes so I can make an accurate \"this is a meme from the future\"\n\nthen see what are the biggest breakthroughs of science in the last 5 years, probably at least medicine and energy\n\nalso obviously lottery numbers or something",
                "labl": 1063,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Pest control tech here, Snakes had gotten into the pit and were climbing up and dropping down on people as they rode the elevator. Good times",
                "labl": 257,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "The elevator guys in my dad's office complex found pieces of a dog's skeleton. Not the whole skeleton, just random parts.",
                "labl": 12986,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "\"In 1988, the same bones were rediscovered when a new elevator shaft near the south parking lot on Elm Street was excavated. At that time, 11 skulls and 88 pounds of bones were found on one day, followed by 119 more pounds of bones. The Enquirer reported that they were being stored at the morgue.\"  Cincinnati Music Hall, built on a children's home, built on a potters field, built on a burial site, built on bulldozed Indigenous Mounds.",
                "labl": 424,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Arcade Fire - Funeral",
                "labl": 1922,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Lots of great albums here, but I'm going to add something a bit newer.\n\nRTJ4 by Run The Jewels is an immediate classic.  Not only are there no bad songs, but it's nearly entirely GREAT songs, and also captures its moment in time perfectly.\n\n👉🤛",
                "labl": 1043,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Tony Hawk: Pro Skater for the PlayStation 1",
                "labl": 454,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Look behind you - a three-headed monkey!",
                "labl": 143,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Rudyard Kipling, author of 'the jungle book.'   Paraphrasing, \"the only way to keep the yellow man out is to bring the white man in.\"",
                "labl": 2604,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "People's names are their own, and the owner of the name is the exclusive authority on its pronunciation. Anyone who doesn't listen to someone when they inform how to pronounce their name is an asshole.",
                "labl": 154,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "This is a bit silly, but gave me a great feeling of satisfaction. Due to the bad economy and poor money management, my parents have moved into the spare room of the house my husband and I bought a year ago. Things are mostly smooth, tho I’m not the closest to them for several reasons I won’t go into here. \n\nThe other evening I was out gardening (because it’s hot during the day and we have the luck of having a streetlight right next to our front yard, keeping it pretty well illuminated even after sundown, I mostly garden at night), and I thought I had gotten the hose twisted, as it kept getting stuck. This went on for a bit, when I realized that it wasn’t stuck, but being pulled. I looked into the dim area just past the illumination of the street light and spied my father, crouched over and tugging the hose. Well I did the only reasonable thing to do, and I sprayed him. He yelled and ran inside with me chasing. \n\nOnce he got inside he made a face and goes “You can’t get me now! I’m inside!!” In that father-to-daughter-don’t-you-make-a-mess tone of voice.\n\nI readied my hose, looked him in the eye and said, “It’s my house.” And just fucking let loose with the hose. He was soaked. Worth cleaning up the mess for that moment of true fear in his eyes.\n\nEdit: thanks for all the appreciation! I’m glad my silly story made your day better!!",
                "labl": 5819,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "I grew up with my parents having screaming arguments over every little thing (they do love each other - over 50 years of marriage so far testifies to that) and it always upset me.\n\n\nA couple of days ago, they popped into my house to visit for a coffee on their way to stay with friends a few miles away. Within minutes, they were yelling at each other.\n\n\nI took great pleasure in telling them that I would not stand for such behaviour in MY house and, if they didn't lower their voices, they could stand outside until they learned some manners.\n\n\nThe meek apologies tasted so sweet. As did the coffee.",
                "labl": 407,
                "true_bin": 1,
                "pred_bin": 2
            },
            {
                "sent": "Girl came into my apartment to hang out with my roommate. Demanded that I turn off the football game I was watching so we could focus on her. I literally said to her, “Who the hell do you think you are?” And kept watching the game. She yelled at me and stormed out. Thankfully me and my roommate never saw her again.",
                "labl": 785,
                "true_bin": 1,
                "pred_bin": 2
            }
        ]
    },
    {
        "correct": [
            {
                "sent": "Does that mean Jesus would be pronounced Geezus?",
                "labl": 22978,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I was a cashier working at the returns counter for a big box store. Customer wanted to return a drill that stoped working after he dropped it in wet concrete. I told him I couldn't take it back. He got all huffy and wanted to see the manager. The manager backed me up and refused to take it back as well. Things escalated and the customer threatened to call the CEO, \"who was a personal friend\", and get us both fired.\n\nI had recently done some volunteer work that the CEO was heavily involved in and had directly work with him on it over the past few months, so I had his personal phone number.\n\nI took out my phone and brought up the CEOs contact page on my phone. Showed it to guy and asked if he wanted me to place the call for him.\n\nHe threw the drill in the trashcan and stormed out. The look on my managers face was priceless.",
                "labl": 248,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Is this a joke I'm too European to understand?",
                "labl": 1062,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Sgt peppers lonely hearts club band-the beatles",
                "labl": 940,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I was in middle school and we were going to see coach carter in theaters with the boys b-ball team. Middle school me was PUMPED. While in the shower I thought “Coach Carter eh, I bet they do push ups in that movie. Imma do push ups right now” Tried to do a wall push up. Slipped, smacked my face on the edge of the tub, and split my upper lip open from mouth to nose. Needless to say, did not make it to the movie.",
                "labl": 13715,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I was trying to squeeze between 2 cars. One of the cars must have had a jagged bumper because it sliced  a 2 inch gash in my leg.",
                "labl": 15752,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I used a pressure washer on my foot",
                "labl": 19382,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "I used the up coming video game release schedules of the years i would lose. Not even the announced releases but the ones in the future that I wouldn't even get to know about.   Pretty lame but it was enough.",
                "labl": 242,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Shelly Miscavige is either dead or being held prisoner by the Church of Scientology.",
                "labl": 21943,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Well, the government is listening to everyones phone calls and reading our emails was once considered a conspiracy theory, and we all know how that turned out.",
                "labl": 9724,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "United 93 was shot down.",
                "labl": 2057,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "While Lee Harvey Oswald did shoot and hit JFK twice, the final, killing shot came from the Secret Service vehicle directly behind the president's vehicle, by accident. The agent carrying the Secret Service's one and only AR-15 at the time stood up when JFK was shot the first two times, and was thrown back in his seat when the car lurched forward, causing him to accidentally shoot the president in the back of the head.",
                "labl": 210,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Masturbate",
                "labl": 171,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "No gems, just horrors. I sleepwalk once in a while but apparently when I was a toddler I used to sleepwalk, cry and say 'she's following me' or just try to leave the house by myself.\nNowadays if it happens, I wake up looking at my reflection in the mirror in the dark. When that happens it fucking creeps me out so I won't sleep the rest of the night.\n\nEdit 1: Why don't I move or cover the mirror? The first time it happened, I covered the mirror but with my morning rushes to work, I pull the cloth down to get ready, and then cover it when I reach home. I've had and still have peaceful nights of sleep (with dimmed lights on) so eventually I'd skip on covering mirror and focussed more not being afraid of the dark. When I least expect it, I then I catch myself waking up to the mirror with a gentle head bump/nod. Get spooked at the incident, rinse and repeat with a blanket cover. I generally have good nights of sleep, these sleepwalks are very rare so I'm really I'm more concerned about my fear of sleeping in the dark. I can't do it. I need a dimmed light for bedtime.\n\nEdit 2: Is it this particular mirror in my room? Yes, it's always this mirror but maybe I haven't had enough sleepovers to have another sleepwalking state elsewhere. I think it's just my subconscious self remembering how I like the mirror during the daytime to get ready, do my hair, makeup, try clothes, etc. I live in a shared flat so I can only leave it in my room. It's a cheap full length mirror and anyway, these sleep walks are so rare. Recent 'episodes' HAS made me want to leave the mirror outside my room but then again I don't want to weird out my flatmates by describing them this particular sleeping habit.",
                "labl": 6218,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Not my partner, but was on a camping trip with some friends and at midnight one of them screamed out. \"Don't forget the mountain dew!\" and he didn't remember saying it. best thing i've ever heard",
                "labl": 200,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "Best friend slept with his new girlfriend for the first time on vacation. People were sharing hotel rooms to save cash so he was in the room with 3  other girls he barely knew. Apparently in the middle of the night he yelled “SHUT UP I CAN TELL IF YOU’RE ACTUALLY GAY.”",
                "labl": 146,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "*What if Jod was one of us?*",
                "labl": 429,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "She’s earned her rest. I wish she could have held on a little longer but this woman fought hard for our rights and endured much on a personal level. RIP.\n\nEdit: thank you for the silver",
                "labl": 754,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "At a place where my wife used to work: a body.\n\nThere was a crash from the elevator area. The boss went to see what it was, came back white as a sheet, and said \"*Do not go out there*.\" Two maintenance guys had been working on the elevator, one was in the bottom of the shaft, and the other one made one small error...\n\nBut I'm guessing the single most unusual item ever found at the bottom of an elevator shaft was a Wright R-2600 aircraft engine, on July 28, 1945 in the Empire State Building.",
                "labl": 2324,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "FDR. Gets a lot of credit for steering the US through the Great Depression and WW2, but committed one of the greatest violations of people's rights in US history when he interned tons of Japanese-Americans.",
                "labl": 2197,
                "true_bin": 2,
                "pred_bin": 2
            },
            {
                "sent": "You need to be mentally prepared for the \"benchmarks\" in your life to not happen or for them to not happen on the right schedule. The big events in your life up to now have been driven and put into place largely by governments and parents and teachers. This is by design - to slowly teach you the relationship between efforts and results. The accomplishments you have laid out as an adult in front of you are largely up to you, and your place in society has a lot more to do with luck than you'd probably like to think.\n\nAs a teenager you tend to think \"I will get married at 28, have a kid at 30 and 33, but only after I've graduated from the elite engineering program of my choice.\" You may not achieve any of those things, and the obsession with delivering them on schedule will cause you deep frustration or even grief. You may not find a spouse, or have a child, or own a house, or even remain relatively healthy.\n\nLearn to give yourself a break now before you spend years of your life grieving the future you believe you screwed yourself out of.",
                "labl": 129,
                "true_bin": 2,
                "pred_bin": 2
            }
        ],
        "incorrect": [
            {
                "sent": "All politics aside. She was an extraordinary human being who did extraordinary things. RIP Justice Ginsburg.",
                "labl": 918,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Damn. Cancer needed five tries to take her down. It gave her hell but she spat it right back.",
                "labl": 155,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I was a salesman at a wire and cable place. I got a call Friday morning from a tow truck driver freaking out. He needed a replacement cable for his truck ASAP because the weekends were the big business days for him, bragging about the big money in people who leave their cars somewhere overnight because they're too drunk to drive home. He was shitty and rude the whole time we were on the phone. He demanded that the cable be cut and shipped immediately, sent next day air, saturday delivery (pretty expensive). I rushed his order, ran back to the warehouse to hand it to the manager myself to make sure it could jump in line and get cut before the next day air guy showed up. But we did it, rushed every part of it and got it shipped out in time. Every person involved prioritized this order to get it out to him on time.\n\n\nTow truck dude calls me back later that afternoon saying he got the truck working and no longer needs the cable. He asks to cancel the order and get a refund. I explain to him that because he had it cut to a specific length, if we were to take it back, there would be a restock fee (because we're not going to be able to resell it until someone needs that exact specific length). I also explain that I can't refund the shipping costs because the order has already been shipped the way he demanded it be sent out.\n\n\nDude loses his mind. Screaming at me telling me he's going to give the company terrible reviews everywhere and tell all his friends how we're all pieces of shit. There was literally nothing I could do for him. No amount of him being an asshole could uncut and unship that order.",
                "labl": 333,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "At my university, it was always fun to watch the people who had been High School Popular People think that this sort of popularity would just naturally carry over and that on this campus of thousands, they'd be a big shot or something.  Was always fun to see just how many people could not care less about their attention-whoring.",
                "labl": 2325,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "At the old courthouse I worked at, the stairs leading to the courtroom were often crowded. As I was trying to squeeze by everyone after stopping downstairs, some guy towards the top of the staircase intentionally stepped in my way and refused to move. After asking him to politely move twice, he made a comment under his breath (but purposefully loud enough so I heard it) that I should essentially go screw myself and that lawyers are entitled assholes and should wait in line like everyone else (which they actually do). He didn’t move so I said sorry and quietly waited behind him for a few minutes. \n\n20 minutes later, I call him out of the courtroom to plea bargain and got the satisfaction of seeing his face when he realized I was the prosecutor",
                "labl": 166,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Girl tried to use sex as payment for car repair. Then she found out I'm gay and it was gonna be $200",
                "labl": 354,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Nintendo Directs. Then I'll make \"predictions\" for a lot of things Nintendo will do, but I'll phrase it in an increasingly implausible way. After a few Directs, people will hopefully catch on and start believing everything I say. After five years (assuming I can't look into the future again) I'll start making random shit up and watch the internet argue about my predictions. *Surely this can't be real… but his track record is impeccable!*",
                "labl": 11764,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "If I had unlimited searches I'd probably look up the Reddit frontpage first.\n\nThere's a lot of information in there that would give a good general explanation about that timeperiod. And from there on I could search up anything that seems interesting while already having some context.",
                "labl": 986,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I feel like A is specific towards men.",
                "labl": 150,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Mr Mosby from Suite Life - dudes got it rough, he’s just trying to run a hotel but these kids are hell bent on sabotaging everything, and to make matters worse they live there so it’s daily occurrence\n\nEdit: These comments have kick started my nostalgia, it’s time to rewatch the show.",
                "labl": 31434,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "I never watched it as a teenager, only as an adult but Red Foreman from that 70s show is quite relatable.",
                "labl": 258,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Dinosaurs had brains the size of walnuts. There's no way they'd get caught up in that stupid shit.",
                "labl": 110,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "ITT: people misunderstanding the premise of the question and talking about brain computers and stuff. It's supposed to be something that people *actually say today* which might turn out to completely wrong. The cell phone service one is a good example. The ten different \"mind computer\" ones are not.",
                "labl": 1781,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "You're not always going to be able to access your brain's memory files, sometimes you may need to remember things off the cuff",
                "labl": 3913,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "It's ok to say no to anyone. Don't let anyone in your life guilt trip you into doing something you don't want to do or are uncomfortable with",
                "labl": 8610,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "It's exactly as lame to not do something you want to do because it's too mainstream or popular as it is to do something only because it's cool and the cool kids are doing it",
                "labl": 3592,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "No one owes you a thing. Live your life well by working for what you want. Make good decisions. Not based on fleeting emotions but reason and common sense. Good financial decisions are a must! Know what it costs. \n\nDon't be afraid to seperate yourself from so called friends if those friends are not moving forward. Dont allow their defeatest attitude to hold you back.",
                "labl": 160,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "We have a name for that in the military: \"Dependapotamus\"",
                "labl": 135,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Non Americans must think this was written in another language.",
                "labl": 118,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "It depends on the building / neighborhood. I’ve seen everything from dirty diapers, to used needles... keys, wallets, phones, picture frames, sandwiches, and I guess the icing on the cake was a tomagachi. \n\nNo, it didn’t work. So we typically just trashed everything unless it was valuable. I always turned jewelry into the managements office but I worked with guys who def sold valuables for unsavory purposes. \n\n\nTLDR; that crack between the car and the door sill is a black hole for objects",
                "labl": 281,
                "true_bin": 2,
                "pred_bin": 1
            },
            {
                "sent": "Incubus-mornibg view",
                "labl": 198,
                "true_bin": 2,
                "pred_bin": 1
            }
        ]
    },
    {
        "correct": [],
        "incorrect": [
            {
                "sent": "Graphic Omnipotent Deity.\n\nNo, that's a hard G, bud.",
                "labl": 3007,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "You laugh but having run into these fuckers in the wild I tell you, they would kill you and everyone you love.",
                "labl": 340,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I was in Aussie at Christmas. Holy fuck everything was on fire and now I hear people in Melbourne can't even leave their houses.",
                "labl": 860,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Some secretary of some branch of a state agency would go on a power trip and stamp, \"Do not copy\" on things that she sent to local agencies. Well, I work for an oversight agency and I needed a copy. Locals were terrified so I rolled my eyes and called to explain that the locals and I were basically the same entity. Woman started to have a conniption fit, but she got real quiet when I cut her off and said, \"Fine, I'll issue a subpoena. What's your name and job title?\" She answered, and the sheriff served her a subpoena for what I wanted. Guess she wasn't used to that.",
                "labl": 4795,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Yeah, dude, I saw the funny cartoon going around also. Don’t steal jokes.",
                "labl": 23,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "You will not always have Mambo No. 5",
                "labl": 4887,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Get a marketable skill, unskilled labor sucks. You need something that’s going to pay you, it doesn’t have to be your life’s passion, contrary to what my peers were saying at that age, but you do need to be able to tolerate it.",
                "labl": 5394,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I'm 39.\n\n&nbsp;\n\n#1. Life is work. \n\nEverything requires perpetual maintenance. All elements of your life, be they self-care, friendships, relationships, work-life balance, health, your house, your car, bank accounts, etc. require **constant** repair. This is our attempt at slowing down entropy. We'll never stop it, as the [energy of the universe](https://www.youtube.com/watch?v=w2iTCm0xpDc) is constantly trying to seek perfect equilibrium, and our efforts only last a lifetime. If you wish to be even *remotely* successful in life, you will recognize how much work you will need to put into every little thing. Otherwise, you'll end up like me: alone, unloved, unhealthy, and ready to die at a moment's notice.\n\n&nbsp;\n\n#2. \"Know thyself.\"\n\nIf you don't know who you are, you're gonna have a bad time. You need to understand that your life is HEAVILY impacted by various forms of luck: where you live; how much money your family has; how abusive your family is; the school system's resources; the literal air that you are breathing. These all have an impact on your life, and the possibility of your future life. The opportunities or obstacles of your life are LARGELY dictated by simple factors of luck. Not all, but I'll get to that.\n\n&nbsp;\n\n#3. \"Be yourself\"...is horseshit.\n\nIf you don't know who you are, *how the hell can you be yourself‽* How do you overcome this catch-22? \n\nA better variant, IMO, is ***\"be the person you wish to become\"***. Not a living or dead person that you hope to magically morph into. But the person that you, in your mind, wish to be in the future. \n\nDo you want to [be kind](https://www.youtube.com/watch?v=sicUhD1n-es), or ruthless? Do you want to be respected, or feared? To you want to help, or hurt? Those are broad and vague, and there are many many more, but they're starting points for how to approach your future. If you've decided to be ruthless, then you'll begin to adapt behaviors that go that route. If you're a meek and timid person who can't even say their name clearly (been there, done that, relevant username now), you're not likely to command any kind of respect.\n\nIf who you are right now is not what you want to be, then \"being yourself\" is the worst advice you'll receive. You must change yourself, because whether you like it or not, change occurs, and you can't control the majority of those changes. So change the ones you *can*.\n\n&nbsp;\n\n#4. Friends come and go.\n\nThe reason you have friends *right now* is because of geographic (and, to a not-to-be-dismissed degree, socioeconomic) reasons. Once you stop going to the same schools, and movie theaters, and book stores, and restaurants, etc. the friendships will begin to diminish. You will more likely grow apart over time, not together. It's possible, sure. But don't make any heavy bets, because you'll lose money on those bets more often than not.\n\nYou'll need to find new ways of making friends. College is yet another school-related location that can help. Clubs help. Hobby-related activities help. \n\nRight before COVID lockdowns here in LA, I made a friend with my tattoo artist, barely knew him otherwise. He mentioned he and his friends were gonna start watching crappy 80's horror movies on the weekend. I was down. Then the lockdowns hit, and we couldn't do it. And I'm bad at making friends with new people I've barely met, so I've made no attempts to reconnect. Maybe when I get back to the tattoo shop. Goes back to point #1.\n\nMaking friends will be hard. But if you're lucky, and make enough connections, it won't be *as hard*.\n\n&nbsp;\n\n#5. \"Expect the best, prepare for the worst.\"\n\nHaving a positive outlook is healthy. If you're perpetually despondent, hopeless, and listless, you probably have depression, and that needs tending to. But ONLY having a positive outlook will lead you to trouble. You must prepare for the times when life throws a wrench into your car tire. Saving money is necessary. Blowing it all and wondering how you're gonna eat next week is pointless drama you've placed upon yourself. Get a checking account, a savings account, and a retirement account. Even if you only put $10 / week into the thing, AND LEAVE IT THE HELL ALONE, you'll likely have a nice rainy day fund when the shit hits the fan. \n\nLiving in a fire-prone region? make sure you have proper equipment in case wildfires become too dangerous. Earthquake kits, first aid kits, bottled water, blankets, etc. \n\nIf you don't live in a place with reliable mass transit, best make sure you have a car that's in good working order. In that car, ensure you have a fresh spare tire (replace tires every 5 years, unless otherwise indicated by professionals). Know how to change a tire: loosen those lugnuts FIRST, then jack up the car, remove tire, replace tire, tighten lug nuts with wrench, lower the car SLOWLY AND SAFELY, finish tightening lugnuts, etc. Know how to bleed brakes (get a friend to help). Replace wipers and fluid before the rainy season as needed. SO much car care is necessary, going back to point #1.\n\n&nbsp;\n\n#6. Kissing ass and networking are IMPORTANT.\n\nIf you think you're going to have a *remotely* successful life, you're going to be kissing a LOT of ass. It doesn't mean completely shoving your nose up someone's ass, but sometimes it might. If you are regularly on someone's radar in a good way, especially someone with an inkling of power, you're going to be one of the first people they think of for a promotion or raise or relocation to an exotic land. You're going to have to wear a lot of \"masks\" when you're around various people. Or you could just become like me and avoid that, keep your \"self respect\", and be poor and ignored. \n\nI was \"discovered\" last year. Like, legit. I was on a podcast with a coworker (I was the interviewee), and **an executive producer of one of the nation's largest morning shows** heard the podcast. He found me a month later, talked to me, and helped me get started. He gave me a lot of advice that I never used (regarding kissing ass, etc.), because I'm a fuck up. After a month, he dropped me, told me I needed to \"be my own cheerleader\". Coulda been a host on the radio in Los Angeles, but I'm not.\n\n&nbsp;\n\n#7. Hard Work & Luck.\n\nLuck starts your journey, hard work continues it. Anyone successful who doesn't say they are lucky (or outright refuses to acknowledge it) are not people to look up to. [Survivorship Bias](https://xkcd.com/1827/) is a huge factor. If you look at all the people who've worked hard and were successful, and then found everyone else who did similar, but aren't successful, you can factor in luck for the successful. Every. Single. Time. This [Veritasium video](https://www.youtube.com/watch?v=3LopI4YeC4I&vl) better explains everything.\n\n&nbsp;\n\n#8. \"No man is an island.\"\n\nYou can't do this alone. Everyone who gets anywhere in life is doing it with the help of others. They could be supportive parents. Friends who love them for who they are. Teachers that see the possibilities. Employers who see growth. Coworkers that empower their workday. Baristas at the coffee shop with a smile. Strangers on the train who hold the door for 1 extra second (don't go nuts on this one, people, there's a threshold). If you are surrounded by supportive and loving people, life, in all its difficulties and flaws and foibles, will become much less work. \n\n&nbsp;\n\n#9. Life is a game.\n\nIf you don't play, you lose. If you don't play by the rules, you lose. If you don't play well with others, you lose. No matter how much you want it or not, you're in the game. You have no choice. And your only opponent is you. Goes back to #6, and ties in with #8. And despite how shitty the game is, again, if you choose not to play, you will reap zero rewards. You might get a ball to the face, too.\n\n&nbsp;\n\n#10. Iroh\n\n[\"While it is always best to believe in oneself, a little help from others can be a great blessing.\"](https://www.youtube.com/watch?v=jZZXAvHySQ4)\n\n&nbsp;\n___\n\n#I have failed at all 10 of these points. Don't be like me.\n\n&nbsp;\n___\n\ntl;dr - read it anyway. I just gave you multiple summaries of life. I'm not summarizing my summaries, dammit! Now go out there, try to have fun, and try to find some meaning.",
                "labl": 44,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Not an elevator technician, but I can tell you some dude, at some point is going to find a kindle at the bottom of a shaft in a Toronto hotel elevator. \n\nRules to remember: \nRule #1: Always check that you zipped your carry-on and didn't leave a gap in the bottom\nRule #2: Kindles fit through small carry-on bag zipper gaps and elevator shaft gaps",
                "labl": 321,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Not elevator maintenance but one time I dropped a set of wheels for a cart in the crack. Im sure some maintenance man is going to be concerned to find loose wheels in the elevator of a nursing home. Like some elder person is walking around with a wheel less  walker.",
                "labl": 790,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Is This It- The Strokes",
                "labl": 549,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Prince - Purple Rain Soundtrack",
                "labl": 235,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Reign in Blood by Slayer",
                "labl": 626,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "Ben Folds Five - Whatever and Ever Amen",
                "labl": 48,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Being lonely. Making friends as an adult is difficult, sometimes verging on impossible. You don't see people in your age group who are doing the same things you are every day anymore.",
                "labl": 19541,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "Drunk, and leaned down to kiss a strange dog on the nose, of all things. 27 stitches down my nose later...",
                "labl": 1399,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I used to thoroughly enjoy sliding down grassy hills as a kid. One fateful luge led to me running over a hidden rock, resulting in a permanent rear tyre puncture (my right butt cheek).",
                "labl": 361,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I didn’t want to go to work one day when I was about 18. So I cut across the top of my foot with a sharp knife in such a way I needed 14 stitches. I told them I dropped it on my foot peeling an apple. What a fool am I !!",
                "labl": 232,
                "true_bin": 3,
                "pred_bin": 2
            },
            {
                "sent": "All that held me back was the feeling of guilt for how my family would feel.\n\nI couldn't do it to them.",
                "labl": 26110,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "I was standing on a bridge over the Mississippi River in Minneapolis with the intention to jump, and I took about 5 minutes to look over the edge and decide whether to land on the water or concrete slab 30 feet or so below. Then the thought crossed my mind to walk to the other side of the bridge and think about it on the way back. So I walked, then walked past where I was standing, and back to my car. \n\nWhen I got back into my car I burst into tears. Ugly crying, screaming, hitting my steering wheel, the works. I was 3 steps from being dead. One on to the concrete, one over the rail, and the last off the edge. That was the lowest I had ever sunk. I think what kept me going was the thought of lost potential. I was working a monotonous job that didn't challenge me, had no friends, and had so much love to give to someone who I hadn't met yet. I didn't want to lose any of that,  so I devoted my life moving forward to growth and challenging myself. \n\nNow, 2 years and 1 month later, I have my own house, a loving girlfriend, a fun and challenging job, and am in the best mental state of my life. I'm glad I didn't jump",
                "labl": 737,
                "true_bin": 3,
                "pred_bin": 1
            },
            {
                "sent": "If I die my mom will have to get rid of my guinea pigs because she doesn't have time to take care of them. Also because killing myself would make my girlfriend sad. And I haven't met my half brother yet. And I want to know how my favorite show ends.\n\nThey may be dumb reasons, but if it's stupid and it works it ain't stupid.",
                "labl": 484,
                "true_bin": 3,
                "pred_bin": 1
            }
        ]
    }
]